export const maxAmountTransferItem = 10
export interface InventoryEquipList {
  phone: boolean,
  bankcard: boolean,
  tablet: boolean,
  clock: number,
  bracelet: boolean,
  watch: boolean,
  ear: boolean,
  glasses: boolean,
  hat: boolean,
  accessorie: boolean,
  foot: boolean,
  leg: boolean,
  torso: boolean,
  mask: boolean,
}

export interface InventoryItemCefObject {
  id: number;
  item_id: number;
  amount: number;
  count: number;
  number: number;
  prefix: number;
  key: number;
  disabled?:boolean;
}

export type InventoryItemCef = [number,number,number,number,number,number,number,boolean?];

export interface InventoryDataCef {
  name: string;
  desc: string;
  owner_id: number|string;
  owner_type: number;
  weight: number;
  weight_max: number;
  closed?: boolean;
  items: InventoryItemCef[];
}

export interface InventoryItemDB {
    id: number;
    item_id: number;
    pos_x: number;
    pos_y: number;
    pos_z: number;
    rot_x: number;
    rot_y: number;
    rot_z: number;
    /**
     * - World : 0,
      - Player : 1,
      - VehicleOwner : 2,
      - VehicleServer : 3,
      - VehicleNpc : 4,
      - House : 5,
      - Apartment : 6,
      - Bag : 7,
      - Vehicle : 8,
      - StockFraction : 9,
      - Fridge : 10,
      - UserStock : 11
     */
    owner_type: number;
    owner_id: number;
    count: number;
    prefix: number;
    number: number;
    key_id: number;
    timestamp_update: number;
}

/**
 * + 0 {string} Название
 * + 1 {string} Хеш объекта
 * + 2 {boolean} Можно ли экипировать
 * + 3 {number} Хеш объекта на земле
 * + 4 {number} Вес
 * + 5 {number} Объём
 */
type itemElement = [
    /** Название */
    string,
    /** Хеш объекта */
    string,
    /** Можно ли экипировать */
    boolean,
    /** Хеш объекта на земле */
    number,
    /** Вес */
    number,
    /** Объём */
    number,
    /** Количество в пачке по умолчанию (если не указано - 1) */
    number?,
]

export const getItemWeightById = (id: number) => {
  try {
      return itemsUtil[id][5];
  }
  catch
  {
      return -1;
  }
}
export const getItemWeightInKGById = (id: number) => {
  return getItemWeightById(id) / 1000
}

export const isAmmoBox = (item_id: number) => {
  let itm = getItemNameById(item_id);
  if (!itm) return false;
  return itm.toLowerCase().indexOf('коробка патронов') == 0
}

export const getItemName = (item:InventoryItemCefObject) => {
  let name = getItemNameById(item.item_id);
  let label = ``;
  if([inventoryTypesUtil.BagTransfer, inventoryTypesUtil.Bag, inventoryTypesUtil.BagFull, inventoryTypesUtil.BagSmall].includes(item.item_id)){
    name += ' #'+item.id
  }
  if (isAmmoBox(item.item_id)){
    name += ` (${item.count} шт.)`;
  }
  if ([142, 143, 144, 145].includes(item.item_id) || (item.item_id >= 154 && item.item_id <= 180)){
    name += ` (${item.count} г.)`;
  }
  if ([275, 276].includes(item.item_id)){
    name += ` (${item.count} шт.)`;
  }
  // if ([27, 28, 29, 30].includes(item.item_id) || (item.item_id >= 146 && item.item_id <= 153)){
  //   name += ` (${item.count} шт.)`;
  // }
  if(item.item_id == 277){
    name += `На $${item.prefix} №${item.id}`;
    if (item.key == -1) name += ' (Использован)';
    else if (item.key == 0) name += ' (Ожидает розыгрыша)';
    else if (item.key == 1) name += ' (ПОБЕДА!)';
  }
  if (item.prefix > 0 && item.number > 0 && item.key <= 0) {
    label = item.prefix + "-" + item.number;
  } else if (item.key > 0) {

      if (item.item_id >= 265 && item.item_id <= 268) {

          if (item.prefix == 1)
          name = <string>clothFutil[item.key][9];
          else
          name = <string>clothMutil[item.key][9];
      }
      else if (item.item_id >= 269 && item.item_id <= 273) {
          if (item.prefix == 1)
          name = <string>propFutil[item.key][5];
          else
          name = <string>propMutil[item.key][5];
      }
      else {
          label = "#" + item.key;
      }
  }
  return name+" "+label;
}
export const getItemNameById = (id:number) => {
  if (!itemsUtil[id]) return "";
  return itemsUtil[id][0]
}
export const getItemHashById = (id:number) => {
  if (!itemsUtil[id]) return "";
  return itemsUtil[id][3]
}
export const getItemNameHashById = (id:number) => {
  if (!itemsUtil[id]) return "";
  return itemsUtil[id][1]
}
export const canEquip = (id:number) => {
  if (!itemsUtil[id]) return false;
  return itemsUtil[id][2]
}

export const isWeapon = (item_id:number) => {
  if (!itemsUtil[item_id]) return false;
  return !!itemsUtil[item_id][1]
}

export const groupItems = (datas:InventoryItemCef[]) => {
  let data:InventoryItemCef[] = []
  datas.forEach(item => {
    let fnd = data.find(itm => getItemName(convertInventoryItemArrayToObject(itm)) == getItemName(convertInventoryItemArrayToObject(item)))
    if (!fnd || [265].includes(item[1])) return data.push(item);
    fnd[2] += item[2];
    // if (isWeapon(item[1])){
    //   return;
    // }
    // if(getItemNameById(item[1]) == "Сумка") return data.push(item);
    // if(canEquip(item[1]) && (getItemNameById(item[1]).indexOf("Коробка") == -1 || itemsUtil[item[1]][1].length > 2)) return data.push(item);
    // fnd[2]+=item[2];
  })
  return data
}

export const convertInventoryItemArrayToObject = (data:InventoryItemCef):InventoryItemCefObject => {
  return {
    id: data[0],
    item_id: data[1],
    amount: data[2],
    count: data[3],
    number: data[4],
    prefix: data[5],
    key: data[6],
  }
}
export const convertInventoryItemObjectToArray = (item:InventoryItemCefObject):InventoryItemCef => {
  return [item.id, item.item_id, item.amount, item.count, item.number, item.prefix, item.key]
}

export const getItemChoises = (id:number,count:number,fraction?:number) => {
  let m = itemsChoise.filter(list => {
    if(list.ids.indexOf(id) > -1){
      if (!list.check || list.check(count, id, fraction)) return list
    }
  })
  return m;
}


export const ammoItemIdToMaxCountUtil = (type: number) => {
  switch (type) {
    case 147:
      return 10;
    case 148: //... / Firework
      return 1;
    case 149: //... / RPG
      return 1;
    case 150: //... / Railgun
      return 10;
    case -152: //... / HomingLauncher
      return 1;
    case 151: //... / CompactGrenadeLauncher
      return 10;
    case 146: //12.7mm / SniperGun
      return 60;
    case 28: //18.5mm
      return 120;
    case 30: //5.56mm
      return 260;
    case 27: //9mm
      return 140;
    case 153: //9mm
      return 140;
    case 29: //7.62mm
      return 130;
    default:
      return 1;
  }
}


function range(start:number, end:number) {
  let ids:number[] = [];
  for(let id = start; id<(end+1);id++)ids.push(id)
  return ids
}

export const getDefaultCount = (item_id:number) => {
  if (!itemsUtil[item_id]) return 0;
  if (isAmmoBox(item_id)) return ammoItemIdToMaxCountUtil(item_id)
  return itemsUtil[item_id][6] ? itemsUtil[item_id][6] : 1
}

export const itemsUtil: itemElement[] = [
    ["Верёвка", "", false, -1145063624, 1000, 4000], //0
    ["Мешок", "", false, -1194335261, 100, 2400], //1
    ["Кокаин", "", false, 1808635348, 1, 1], //2
    ["Лечебная марихуана", "", false, 671777952, 1, 5], //3
    ["Отмычка", "", false, -1803909274, 50, 6], //4
    ["Масло", "", false, -1532806025, 3000, 10000], //5
    ["Набор инструментов", "", false, 648185618, 4500, 12800], //6
    ["Электронные часы", "", true, 1169295068, 190, 110], //7
    ["Телефон", "", true, -1038739674, 120, 156], //8
    ["Канистра", "PetrolCan", false, 1069395324, 10000, 11300], //9
    ["Жвачка", "", false, 936464539, 20, 20], //10
    ["Баттончик \"Pluto\"", "", false, 936464539, 60, 30], //11
    ["Чипсы \"AppiPot\"", "", false, 936464539, 100, 1500], //12
    ["Упаковка Роллов", "", false, 936464539, 290, 2000], //13
    ["Гамбургер", "", false, 936464539, 190, 500], //14
    ["Салат Цезарь", "", false, 936464539, 200, 2000], //15
    ["Пицца", "", false, 936464539, 550, 7000], //16
    ["Жаркое", "", false, 936464539, 450, 2000], //17
    ["Кесадилья", "", false, 936464539, 2000, 2000], //18
    ["Фрикасе из кролика", "", false, 936464539, 575, 2000], //19
    ["Фрукты", "", false, 936464539, 180, 1000], //20
    ["Вода", "", false, 746336278, 330, 3500], //21
    ["Кофе", "", false, 746336278, 400, 4000], //22
    ["Чай", "", false, 746336278, 330, 3500], //23
    ["Лимонад", "", false, 746336278, 330, 3500], //24
    ["Кока-Кола", "", false, 746336278, 250, 2500], //25
    ["Энергетик", "", false, 746336278, 250, 2500], //26

    ["Коробка патронов 9mm (Пистолет)", "", true, 190687980, 1140, 432], //27 / 140
    ["Коробка патронов 18.5mm", "", true, 1560006187, 2420, 1024], //28 / 120
    ["Коробка патронов 7.62mm", "", true, 669213687, 2580, 686], //29 / 130
    ["Коробка патронов 5.56mm", "", true, 1843823183, 3620, 1568], //30 / 260

    ["Адреналин", "", false, -1282296755, 50, 6], // 31
    ["Сухпаек", "", false, 9168982, 2000, 5800], // 32
    ["Уголь", "", false, -756465278, 40, 6], // 33
    ["Сироп", "", false, -756465278, 75, 3], // 34
    ["Cосудосуживающий таблетка", "", false, -756465278, 30, 6], // 35
    ["Таблетка от кашля", "", false, -756465278, 40, 6], // 36
    ["Витаминки", "", false, -756465278, 55, 6], // 37
    ["Жаропонижающий", "", false, -756465278, 35, 6], // 38
    ["Антибиотик", "", false, -756465278, 35, 6], // 39
    ["Наручники", "", false, -1281059971, 340, 120], // 40
    ["Ключ от тс", "", false, 977923025, 6, 3], // 41
    ["Ключ от офиса", "", true, -331172978, 6, 3], // 42
    ["Ключ от дома", "", true, -331172978, 6, 3],  // 43
    ["Ключ от квартиры", "", true, -331172978, 6, 3], // 44
    ["Маска", "", true, 9168982, 650, 2800], // 45
    ["Одежда", "", false, 9168982, 650, 3800], //46
    ["Рация", "", false, -1964402432, 250, 170], // 47
    ["Кошелёк", "", false, -34897201, 120, 150], // 48
    ["Письма", "", false, 406712611, 80, 410], // 49
    ["Банковская карта", "", true, -1282513796, 15, 8], // 50
    ["Паспорт", "", false, -1750183478, 40, 16], // 51
    ["Лицензия", "", false, -925658112, 30, 116], // 52
    ["Удостоверение", "", false, -1595369626, 15, 8], // 53

    ["Кавалерийский кинжал", "Dagger", true, 1725061196, 400, 450,], // 54
    ["Бейсбольная бита", "Bat", true, 1742452667, 1500, 2000], // 55
    ["Боевой топор", "BattleAxe", true, 2133533553, 2200, 2400], // 56
    ["Розочка", "Bottle", true, -789123952, 110, 540], // 57
    ["Лом", "Crowbar", true, 1862268168, 3200, 1050], // 58
    ["Фонарик", "Flashlight", true, 211760048, 340, 400], // 59
    ["Клюшка для гольфа", "GolfClub", true, -580196246, 2900, 1150], // 60
    ["Молоток", "Hammer", true, 64104227, 860, 430], // 61
    ["Топорик", "Hatchet", true, 1653948529, 930, 860], // 62
    ["Нож", "Knife", true, -1982443329, 560, 520], // 63
    ["Кастет", "KnuckleDuster", true, -1803909274, 450, 80], // 64
    ["Мачете", "Machete", true, -2055486531, 1120, 525], // 65
    ["Полицейская дубинка", "Nightstick", true, -1634978236, 880, 970], // 66
    ["Разводной ключ", "Wrench", true, 10555072, 1760, 1490], // 67
    ["Бильярдный кий", "PoolCue", true, -1982443329, 470, 160], // 68
    ["Выкидной нож", "SwitchBlade", true, 1653948529, 130, 60], // 69

    ["Сolt SCAMP", "APPistol", true, 905830540, 1500, 950], // 70
    ["P99", "CombatPistol", true, 403140669, 800, 660], // 71
    ["Сигнальный пистолет", "FlareGun", true, 1349014803, 440, 270], // 72
    ["Enterprise Wide Body 1911", "HeavyPistol", true, 1927398017, 1120, 850], // 73
    ["Raging Bull", "Revolver", true, 1430410579, 1440, 1080], // 74
    ["Raging Bull Mk II", "Revolver_Mk2", true, 1430410579, 1990, 1080], // 75
    ["Contender G2", "MarksmanPistol", true, 1430410579, 1360, 1800], // 76
    ["Taurus PT92", "Pistol", true, 1467525553, 950, 1230], // 77
    ["Beretta 90Two", "PistolMk2", true, 1430410579, 920, 1050], // 78
    ["Desert Eagle", "Pistol50", true, -178484015, 1700, 1720], // 79
    ["HK P7M10", "SNSPistol", true, 339962010, 785, 660], // 80
    ["Colt Junior", "SNSPistol_Mk2", true, 1430410579, 365, 310], // 81
    ["Шокер", "StunGun", true, 1609356763, 760, 680], // 82
    ["FN Model 1922", "VintagePistol", true, -1124046276, 700, 720], // 83
    ["Colt New Service", "DoubleAction", true, 1430410579, 1450, 1170], // 84

    ["UTS-15", "AssaultShotgun", true, 1255410010, 2800, 11500], // 85
    ["KSG 12", "BullpupShotgun", true, -1598212834, 3100, 9500], // 86
    ["Обрез", "DoubleBarrelShotgun", true, -1920611843, 1410, 1800], // 87
    ["Сайга-12К", "HeavyShotgun", true, -1209868881, 3500, 10900], // 88
    ["Land Pattern Musket", "Musket", true, 1652015642, 4300, 14400], // 89
    ["Benelli M3", "PumpShotgun", true, 689760839, 4500, 16100], // 90
    ["Benelli M4", "PumpShotgun_Mk2", true, 798951501, 3500, 17600], // 91
    ["Mossberg 500", "SawnOffShotgun", true, -675841386, 2100, 3800], // 92
    ["Protecta", "SweeperShotgun", true, -1920611843, 2900, 6800], // 93

    ["P-90", "AssaultSMG", true, -473574177, 2800, 8800], // 94
    ["Mk 48", "CombatMG", true, -739394447, 8000, 16000], // 95
    ["HK MG4", "CombatMG_Mk2", true, 798951501, 8150, 17600], // 96
    ["SIG MPX-SD", "CombatPDW", true, -1393014804, 2700, 5000], // 97
    ["Thompson M1918A1", "Gusenberg", true, 574348740, 8400, 18400], // 98
    ["Intratec TEC-9", "MachinePistol", true, 1430410579, 1500, 1660], // 99
    ["ПКП «Печенег»", "MG", true, -2056364402, 8200, 17250], // 100
    ["Mini Uzi", "MicroSMG", true, -1056713654, 2650, 2500], // 101
    ["Scorpion vz.61", "MiniSMG", true, 1430410579, 2000, 1900], // 102
    ["MP5A3", "SMG", true, -500057996, 3200, 7800], // 103
    ["MP5K", "SMG_Mk2", true, -1920611843, 3350, 8100], // 104

    ["Tavor CTar-21", "AdvancedRifle", true, -1707584974, 3270, 12400], // 105
    ["AK-102", "AssaultRifle", true, 273925117, 3200, 14700], // 106
    ["AK-103", "AssaultRifle_Mk2", true, 798951501, 3600, 16200], // 107
    ["QBZ-97", "BullpupRifle", true, -1288559573, 3250, 13500], // 108
    ["QBZ-95", "BullpupRifle_Mk2", true, 798951501, 3350, 13900], // 109
    ["HK-416", "CarbineRifle", true, 1026431720, 3490, 8500], // 110
    ["HK-416A5", "CarbineRifle_Mk2", true, 798951501, 3560, 8500], // 111
    ["AKS-47u", "CompactRifle", true, -1920611843, 2400, 5700], // 112
    ["G36C", "SpecialCarbine", true, -1745643757, 2980, 12000], // 113
    ["G36KV", "SpecialCarbine_Mk2", true, 798951501, 3370, 13900], // 114

    ["M107", "HeavySniper", true, -746966080, 13500, 21000], // 115
    ["XM109", "HeavySniper_Mk2", true, 798951501, 14000, 24500], // 116
    ["M14 EBR", "MarksmanRifle", true, -1711248638, 5100, 17800], // 117
    ["SOCOM 16", "MarksmanRifle_Mk2", true, 798951501, 5900, 18200], // 118
    ["L115A3", "SniperRifle", true, 346403307, 6600, 14400], // 119

    ["M79", "CompactGrenadeLauncher", true, -1920611843, 50, 2050], // 120
    ["Пиротехническая установка", "Firework", true, 491091384, 8500, 29000], // 121
    ["M32 MGL", "GrenadeLauncher", true, -606683246, 5300, 19500], // 122
    ["FIM 92 Stinger", "HomingLauncher", true, 1901887007, 13500, 29000], // 123
    ["M134", "Minigun", true, 422658457, 30000, 50000], // 124
    ["Рельсовое оружие", "Railgun", true, -1876506235, 14900, 22500], // 125
    ["РПГ-7", "RPG", true, -218858073, 6000, 46000], // 126

    ["Мяч", "Ball", true, -383950123, 250, 310], // 127
    ["Дымовая гранта", "SmokeGrenade", true, -1936212109, 690, 485], // 128
    ["Сигнальный огонь", "Flare", true, -1564193152, 250, 180], // 129
    ["Граната", "Grenade", true, 290600267, 890, 410], // 130
    ["Коктейль Молотова", "Molotov", true, -880609331, 660, 720], // 131
    ["Неконтактная мина", "ProximityMine", true, 1876445962, 850, 1200], // 132
    ["Самодельная бомба", "PipeBomb", true, 848107085, 430, 180], // 133
    ["Снежок", "Snowball", true, 1297482736, 250, 310], // 134
    ["Бомба-липучка", "StickyBomb", true, -1110203649, 750, 1200], // 135
    ["Слезоточивый газ", "BZGas", true, 1591549914, 690, 485], // 136

    ["Парашют", "Parachute", true, -1679378668, 3200, 7500], // 137

    ["Купюра 1$", "", true, 1814532926, 1, 1], // 138
    ["Купюра 100$", "", true, 1597489407, 1, 1], // 139
    ["Маленькая пачка 100$", "", true, -1170050911, 100, 100], // 140
    ["Большая пачка 100$", "", true, -1448063107, 300, 300], // 141

    ["Упаковка кокаина", "", false, 525896218, 1000, 1000, 1000], // 142
    ["Упаковка марихуаны", "", false, -395076527, 200, 1000, 200], // 143
    ["Упаковка кокаина", "", false, -1688127, 5000, 5000, 5000], // 144
    ["Упаковка марихуаны", "", false, -680115871, 800, 4000, 800], // 145

    ["Коробка патронов 12.7mm", "", true, 1843823183, 8900, 1568], //146 / 60
    ["Коробка патронов сингального пистолета", "", true, 1843823183, 1600, 1568], //147 / 10
    ["Коробка патронов феерверка", "", true, 1843823183, 1600, 1568], //148 / 1
    ["Коробка патронов RPG", "", true, 1843823183, 2200, 1568], //149 / 120
    ["Коробка патронов", "", true, 1843823183, 3800, 1568], //150 / 10
    ["Коробка подствольных гранат", "", true, 1843823183, 3800, 1568], //151 / 10
    ["Коробка патронов Stinger", "", true, 1843823183, 1500, 1568], //152 / 1
    ["Коробка патронов 9mm (SMG)", "", true, 190687980, 1140, 432], //153 / 140

    ["Кокаин", "", false, 1808635348, 10, 10, 10], //154
    ["Лечебная марихуана", "", false, 671777952, 10, 10, 10], //155

    ["Кокаин", "", false, 1808635348, 50, 50, 50], //156
    ["Лечебная марихуана", "", false, 671777952, 50, 50, 50], //157

    ["Амфетамин", "", false, 1808635348, 1, 1, 10], //158
    ["DMT", "", false, 1808635348, 1, 1, 10], //159
    ["Мефедрон", "", false, 1808635348, 1, 1, 10], //160
    ["Кетамин", "", false, 671777952, 1, 5, 5], //161
    ["LSD", "", false, 671777952, 1, 5, 5], //162

    ["Упаковка амфетамина", "", false, 525896218, 1000, 1000, 1000], // 163
    ["Упаковка амфетамина", "", false, -1688127, 5000, 5000, 5000], // 164

    ["Упаковка DMT", "", false, 525896218, 1000, 1000, 1000], // 165
    ["Упаковка DMT", "", false, -1688127, 5000, 5000, 5000], // 166

    ["Упаковка мефедрона", "", false, 525896218, 1000, 1000, 1000], // 167
    ["Упаковка мефедрона", "", false, -1688127, 5000, 5000, 5000], // 168

    ["Упаковка кетамина", "", false, 1430410579, 1000, 3000, 1000], // 169
    ["Упаковка LSD", "", false, 1430410579, 1000, 3000, 1000], // 170

    ["Амфетамин", "", false, 1808635348, 10, 10, 10], //171
    ["DMT", "", false, 1808635348, 10, 10, 10], //172
    ["Мефедрон", "", false, 1808635348, 10, 10, 10], //173
    ["Кетамин", "", false, 671777952, 10, 50, 10], //174
    ["LSD", "", false, 671777952, 10, 50, 10], //175

    ["Амфетамин", "", false, 1808635348, 50, 50, 50], //176
    ["DMT", "", false, 1808635348, 50, 50, 50], //177
    ["Мефедрон", "", false, 1808635348, 50, 50, 50], //178
    ["Кетамин", "", false, 671777952, 50, 250, 50], //179
    ["LSD", "", false, 671777952, 50, 250, 50], //180

    ["Деревянный ящик Gray Tea", "", false, -1147461795, 15000, 500000], //181
    ["Коробка Листов A4", "", false, 1465830963, 2500, 40000], //182
    ["Коробка Redwood", "", false, 1465830963, 2500, 35000], //183
    ["Коробка Clucking Bell", "", false, 250374685, 15000, 70000], //184
    ["Коробка Jo Jo diet Cola", "", false, -1244905398, 8000, 25000], //185
    ["Коробка Craft", "", false, -517243780, 40000, 70000], //186
    ["Коробка Fish and Roll", "", false, -1563678327, 60000, 450000], //187
    ["Деревянный ящик GoPostal", "", false, -1649986476, 19000, 300000], //188
    ["Огромная деревянный ящик", "", false, 1955876122, 420000, 5000000], //189
    ["Важная деревянный ящик", "", false, 307713837, 120000, 1250000], //190
    ["Коробка из китая", "", false, -1513883840, 35000, 450000], //191
    ["Важная коробка", "", false, -1438964996, 12000, 250000], //192
    ["Маленькая коробка", "", false, -721895765, 4000, 55000], //193

    ["Полосатая бочка", "", false, 546252211, 30000, 5000], //194
    ["Ограждение со стрелкой", "", false, 1867879106, 8000, 5000], //195
    ["Длинное ограждение", "", false, -205311355, 10000, 5000], //196
    ["Деревянное ограждение", "", false, 1072616162, 5000, 5000], //197
    ["Деревянное ограждение с огнём", "", false, 1329951119, 5000, 5000], //198
    ["Полицейское огорождение", "", false, -143315610, 9000, 5000], //199
    ["Длинный полосатый конус", "", false, 939377219, 1000, 3000], //200
    ["Полосатый конус", "", false, 1245865676, 1000, 3000], //201
    ["Красный конус", "", false, 862664990, 1000, 3000], //202
    ["Длинный конус с огнями", "", false, -1587301201, 1000, 3000], //203

    ["Капсула с таблетками", "", false, -2127785247, 50, 25], //204
    ["Огромная стекляная бутыль", "", false, -1382355819, 3000, 6750], //205
    ["Капсула с таблетками", "", false, -756465278, 50, 30], //206
    ["Бутыль", "", false, 393961710, 250, 250], //207
    ["Сироп", "", false, 1648892290, 120, 170], //208
    ["Большая стекляная банка", "", false, 566302905, 1500, 4200], //209
    ["Стекляная банка", "", false, -2034834785, 500, 1400], //210
    ["Контейнер с пробирками", "", false, -330775550, 4500, 6000], //211
    ["Контейнер для пробирок", "", false, -192665395, 2000, 6000], //212
    ["Пробирка", "", false, -2022085894, 500, 60], //213
    ["Шприц", "", false, -61966571, 50, 6], //214
    ["Аптечка", "", false, 678958360, 500, 880], //215
    ["Бинт", "", false, 546339338, 70, 280], //216
    ["Большой бинт", "", false, 580223600, 120, 410], //217
    ["Таблетки", "", false, -1129328507, 20, 10], //218
    ["Бутыль с перекисью водорода", "", false, 1254553771, 3000, 8000], //219
    ["Упаковка таблеток", "", false, 1787587532, 50, 130], //220
    ["Антипохмелин", "", false, 1547095841, 12, 130], //221
    ["Упаковка таблеток", "", false, 1174512311, 50, 130], //222

    ["Сырое мясо кабана", "", false, 936464539, 4000, 10000], //223 a_c_boar
    ["Сырое мясо ястреба", "", false, 936464539, 300, 2000], //224 a_c_chickenhawk
    ["Сырое мясо коровы", "", false, 936464539, 4000, 10000], //225 a_c_cow
    ["Сырое мясо баклана", "", false, 936464539, 290, 1500], //226 a_c_cormorant
    ["Сырое мясо оленя", "", false, 936464539, 4000, 15000], //227 a_c_deer
    ["Сырое мясо курицы", "", false, 936464539, 290, 1500], //228 a_c_hen
    ["Сырое мясо свиньи", "", false, 936464539, 4000, 10000], //229 a_c_pig
    ["Сырое мясо кролика", "", false, 936464539, 500, 3000], //230 a_c_rabbit_01
    ["Сырое мясо крысы", "", false, 936464539, 50, 500], //231 a_c_rat

    ["Мясо кабана", "", false, 936464539, 4000, 10000], //232
    ["Мясо ястреба", "", false, 936464539, 300, 2000], //233
    ["Мясо коровы", "", false, 936464539, 4000, 10000], //234
    ["Мясо баклана", "", false, 936464539, 290, 1500], //235
    ["Мясо оленя", "", false, 936464539, 4000, 12000], //236
    ["Мясо курицы", "", false, 936464539, 290, 1500], //237
    ["Мясо свиньи", "", false, 936464539, 4000, 10000], //238
    ["Мясо кролика", "", false, 936464539, 500, 3000], //239
    ["Мясо крысы", "", false, 936464539, 100, 1000], //240

    ["Сырое мясо тунца", "", false, 936464539, 1000, 3000], //241
    ["Сырое мясо окуня", "", false, 936464539, 300, 800], //242
    ["Сырое мясо краба", "", false, 936464539, 600, 4000], //243
    ["Сырое мясо лосося", "", false, 936464539, 290, 1000], //244
    ["Сырое мясо креветок", "", false, 936464539, 290, 600], //245

    ["Мясо тунца", "", false, 936464539, 1000, 3000], //246
    ["Мясо окуня", "", false, 936464539, 300, 800], //247
    ["Мясо краба", "", false, 936464539, 600, 4000], //248
    ["Мясо лосося", "", false, 936464539, 290, 1000], //249
    ["Мясо креветок", "", false, 936464539, 290, 600], //250

    ["Удочка", "", false, 1338703913, 3560, 5500], //251
    ["Бронежилет", "", false, 701173564, 3560, 5000], //252
    ["Игральные кости", "", false, -1803909274, 50, 6], //253

    ["Маленький розовый член", "", false, -422877666, 250, 195], //254
    ["Красный вибратор ", "", false, -463441113, 450, 440], //255
    ["Фиолетовый член", "", false, -731262150, 330, 290], //256
    ["Кожаный член", "", false, -1980613044, 320, 285], //257
    ["Позолоченный член", "", false, 2009373169, 390, 180], //258
    ["Металлический член", "", false, -1921596075, 390, 180], //259
    ["Большой резиновый член", "", false, 1333481871, 950, 2100], //260
    ["Анальная смазка", "", false, 1553232197, 250, 540], //261

    ["C4 (Мощная)", "StickyBomb", false, -1110203649, 750, 1200], //262
    ["Специальная отмычка", "", false, -1803909274, 50, 6], //263
    ["Маска", "", true, -1211793417, 400, 1350], //264
    ["Одежда", "", true, -1158162337, 2000, 2500], //265
    ["Штаны", "", true, -1158162337, 2000, 2500], //266
    ["Обувь", "", true, 101151147, 1500, 3000], //267
    ["Аксессуар", "", true, 1267833770, 400, 1200], //268

    ["Головной убор", "", true, 1267833770, 500, 1500], //269
    ["Очки", "", true, 1298569174, 200, 350], //270
    ["Серьги", "", true, 1267833770, 150, 90], //271
    ["Часы", "", true, 1267833770, 250, 300], //272
    ["Браслет", "", true, 1267833770, 250, 300], //273
    ["Маска", "", true, 1267833770, 400, 1200], //274

    ["Коробка отмычек", "", false, 1267833770, 500, 60, 10], //275
    ["Коробка спец. отмычек", "", false, 1267833770, 1500, 180, 30], //276

    ["Лот. билет", "", false, 406712611, 80, 410], //277
    ["Спец. Аптечка", "", false, 678958360, 500, 880], //278
    ["Сноуборд", "", false, 3328693117, 500, 880], //279
    ["Пакет", "", false, -1158162337, 1000, 1000], //280
    ["Тяжёлая сумка", "", false, -1158162337, 1000, 1000], //281
    ["Планшет", "", true, 1943210810, 300, 300], //282
    ["Чемодан для перевозки", "", false, -1158162337, 1000, 1000], //283
    ["Лёгкая сумка", "", false, -1158162337, 1000, 1000], //284
    ["Дорожные шипы", "", false, -596599738, 10000, 10000], //285
]


export const inventoryTypesUtil = {
  World: 0,
  Player: 1,
  VehicleOwner: 2,
  VehicleServer: 3,
  VehicleNpc: 4,
  House: 5,
  Apartment: 6,
  Vehicle: 8,
  StockFraction: 9,
  Fridge: 10,
  UserStock: 11,
  UserStockMax: 22,
  /** Пакет */
  Bag: 280,
  /** Тяжёлая сумка */
  BagFull: 281,
  /** Лёгкая сумка */
  BagSmall: 284,
  /** Транспортировочная сумка */
  BagTransfer: 283,
}

/** Поднять 10 ХП */
export const healItemCost = 250
/** Поднять 100 ХП */
export const healItemCost2 = 500
/** Вылечить ХП */
export const healItemCost3 = 250

export const itemsChoise:{
  ids: number[],
  task: string,
  name: string,
  check?:(count:number,itemid?:number,fraction?:number) => boolean
  }[] = [
  {
    ids: [279],
    task: "skate",
    name: "Прокатиться"
  },
  {
    ids: [215],
    task: "upNearest10",
    name: "Реанимировать человека рядом (Бесплатно)",
    check: (count, itemid, fraction) => {
      if (typeof fraction == "number"){
        if(fraction == 16) return true;
        else return false;
      }
      return true;
    }
  },
  {
    ids: [278],
    task: "upNearest100",
    name: "Реанимировать человека рядом (Бесплатно)",
    check: (count, itemid, fraction) => {
      if (typeof fraction == "number") {
        if (fraction == 16) return true;
        else return false;
      }
      return true;
    }
  },
  {
    ids: [215, 278],
    task: "healNearest",
    name: "Вылечить человека рядом (Бесплатно)",
    check: (count, itemid, fraction) => {
      if (typeof fraction == "number") {
        if (fraction == 16) return true;
        else return false;
      }
      return true;
    }
  },
  {
    ids: [215, 278],
    task: "healNearestPay",
    name: "Вылечить человека рядом ($" + healItemCost3 + ")",
    check: (count, itemid, fraction) => {
      if (typeof fraction == "number") {
        if (fraction == 16) return true;
        else return false;
      }
      return true;
    }
  },
  {
    ids: [215],
    task: "upNearestPay10",
    name: "Реанимировать человека рядом ($" + healItemCost + ")",
    check: (count, itemid, fraction) => {
      if (typeof fraction == "number") {
        if (fraction == 16) return true;
        else return false;
      }
      return true;
    }
  },
  {
    ids: [278],
    task: "upNearestPay100",
    name: "Реанимировать человека рядом ($" + healItemCost2 + ")",
    check: (count, itemid, fraction) => {
      if (typeof fraction == "number") {
        if (fraction == 16) return true;
        else return false;
      }
      return true;
    }
  },
  {
    ids: [275, 276],
    task: "countPlayerItemButton",
    name: "Посчитать"
  },
  {
    ids: [140, 141],
    task: "countMoneyPlayerItemButton",
    name: "Посчитать"
  },
  {
    ids: [146, 147, 148, 149, 150, 151, 152, 153, 27, 28, 29, 30],
    task: "countBulletsPlayerItemButton",
    name: "Посчитать"
  },
  {
    ids: range(0, 9999),
    task: "usePlayerItemButton",
    name: "Использовать",
    check: (count:number,itemid:number) => {
      if(canEquip(itemid)){
        if(itemid == 7 || itemid == 63) return true
      } else {
        if(itemid != 275 && itemid != 276 && itemid != 277) return true
      }
      return false;
    }
  },
  {
    ids: [277],
    task: "transferLotoItemButton",
    name: "Обменять в любом 24/7"
  },
  {
    ids: [277],
    task: "infoLotoItemButton",
    name: "Информация о билете"
  },
  {
    ids: range(0, 9999),
    task: "equipItemButton",
    name: "Экипировать",
    check: (count, item) => {
      return canEquip(item)
    }
  },
  {
    ids: [...range(142, 145), ...range(154, 157), ...range(163, 180)],
    task: "takeOneGrammPlayerItemButton",
    name: "Взять 1гр."
  },
  {
    ids: [...range(142, 145), ...range(154, 157), ...range(163, 180)],
    task: "takeTenGrammPlayerItemButton",
    name: "Взять 10гр.",
    check: (count:number) => (count >= 10)
  },
  {
    ids: [...range(142, 145), ...range(154, 157), ...range(163, 180)],
    task: "takeFiftyGrammPlayerItemButton",
    name: "Взять 50гр.",
    check: (count:number) => (count >= 50)
  },
  {
    ids: [...range(142, 145), ...range(154, 157), ...range(163, 180)],
    task: "weighPlayerItemButton",
    name: "Взвесить"
  },
  {
    ids: [275, 276],
    task: "takeOneItemPlayerItemButton",
    name: "Взять 1шт."
  },
]

export type clothItem = [number, number, number, number, number, number, number, number, number, string, number, number]
export type propItem = [number, number, number, number, number, string]

export const clothFutil = <clothItem[]>[
  [ 0, 4, 45, 2, -1, -1, -1, -1, 75, "Свободные штаны с карманами", -20, 30 ],
  [ 0, 4, 3, 14, -1, -1, -1, -1, 80, "Мятые штаны", -20, 30 ],
  [ 0, 4, 58, 2, -1, -1, -1, -1, 40, "Широкие спортивные штаны", -10, 30 ],
  [ 0, 4, 66, 9, -1, -1, -1, -1, 40, "Широкие спортивные штаны", -10, 30 ],
  [ 0, 4, 71, 16, -1, -1, -1, -1, 115, "Шаровары", -25, 30 ],
  [ 0, 4, 104, 12, -1, -1, -1, -1, 125, "Заказные Шаровары", -25, 30 ],
  [ 0, 4, 80, 6, -1, -1, -1, -1, 90, "Спортивные штаны", -10, 35 ],
  [ 0, 4, 84, 8, -1, -1, -1, -1, 105, "Низкие джинсы", -10, 40 ],
  [ 0, 4, 101, 24, -1, -1, -1, -1, 90, "Штаны с карманами", -25, 30 ],
  [ 0, 4, 82, 6, -1, -1, -1, -1, 65, "Спортивные бриджи", 10, 50 ],
  [ 0, 4, 2, 1, -1, -1, -1, -1, 55, "Спортивные бриджи", 15, 50 ],
  [ 0, 4, 10, 1, -1, -1, -1, -1, 25, "Спортивные шорты", 15, 60 ],
  [ 0, 4, 14, 0, -1, -1, -1, -1, 35, "Шорты", 20, 60 ],
  [ 0, 4, 16, 10, -1, -1, -1, -1, 35, "Шорты", 20, 60 ],
  [ 0, 4, 78, 2, -1, -1, -1, -1, 45, "Шорты с чулками", 15, 45 ],
  [ 0, 4, 17, 10, -1, -1, -1, -1, 15, "Низ от бикини", 25, 99 ],
  [ 0, 4, 21, -1, -1, -1, -1, -1, 5, "Низ от Мини-Бикини", 25, 99 ],
  [ 0, 4, 57, 6, -1, -1, -1, -1, 60, "Низ от халата", 10, 50 ],
  [ 0, 11, 0, 14, 12, -1, -1, -1, 70, "Футболка с вырезом", 15, 50 ],
  [ 0, 11, 1, 1, 1, -1, 20, 0, 125, "Джинсовая куртка", 10, 35 ],
  [ 0, 11, 3, 3, 3, -1, -1, -1, 140, "Толстовка", 5, 30 ],
  [ 0, 11, 10, 1, 0, -1, 21, 0, 135, "Спортивная ветровка", 5, 30 ],
  [ 0, 11, 11, 1, 4, -1, -1, -1, 35, "Спортивная майка", 20, 60 ],
  [ 0, 11, 16, 5, 4, -1, -1, -1, 35, "Спортивная майка", 20, 60 ],
  [ 0, 11, 17, -1, 14, -1, -1, -1, 80, "Гавайская рубашка", 15, 45 ],
  [ 0, 11, 18, 10, 15, -1, -1, -1, 50, "Верх бикини", 25, 99 ],
  [ 0, 11, 19, 2, 12, -1, -1, -1, 75, "Новогодняя футболк с вырезом", 15, 50 ],
  [ 0, 11, 23, 1, 12, -1, -1, -1, 70, "Футболка с вырезом", 15, 50 ],
  [ 0, 11, 31, 5, 1, -1, 20, 0, 125, "Джинсовая куртка", 10, 35 ],
  [ 0, 11, 32, 1, 4, -1, -1, -1, 35, "Спортивная майка", 20, 60 ],
  [ 0, 11, 33, 7, 4, -1, -1, -1, 60, "Кроп-Майка", 25, 60 ],
  [ 0, 11, 36, 3, 4, -1, -1, -1, 75, "Фирменный верх купальника", 20, 60 ],
  [ 0, 11, 37, 4, 4, -1, -1, -1, 180, "Сарафан", 15, 45 ],
  [ 0, 11, 49, 0, 14, -1, -1, -1, 55, "Футболка", 15, 50 ],
  [ 0, 11, 54, 2, 3, -1, -1, -1, 175, "Старая Мото-Куртка", -15, 30 ],
  [ 0, 11, 55, -1, 3, -1, -1, -1, 135, "Старая тёплая куртка", -20, 25 ],
  [ 0, 11, 73, 1, 14, -1, -1, -1, 55, "Футболка", 15, 50 ],
  [ 0, 11, 74, 1, 4, -1, -1, -1, 30, "Майка", 20, 60 ],
  [ 0, 11, 75, 2, 9, -1, -1, -1, 85, "Задраный джемпер", 10, 40 ],
  [ 0, 11, 76, 3, 9, -1, -1, -1, 90, "Бейбсбольная рубашка", 15, 50 ],
  [ 0, 11, 77, -1, 9, -1, -1, -1, 95, "Рабочая куртка", -5, 30 ],
  [ 0, 11, 96, -1, 14, -1, -1, -1, 80, "Гавайская рубашка", 15, 45 ],
  [ 0, 11, 97, -1, 3, -1, 67, 2, 135, "Старая ветровка", -15, 30 ],
  [ 0, 11, 102, -1, 3, -1, -1, -1, 210, "Старая кожаная куртка", -20, 30 ],
  [ 0, 11, 105, 6, 4, -1, -1, -1, 90, "Верх от халата", 15, 50 ],
  [ 0, 11, 106, 2, 6, -1, -1, -1, 65, "Спортивная куртка", -10, 30 ],
  [ 0, 11, 107, -1, 2, -1, 67, 2, 250, "Старое пальто", -20, 30 ],
  [ 0, 11, 108, 1, 3, -1, 67, 2, 110, "Старая куртка Санты", -5, 30 ],
  [ 0, 11, 120, 15, 5, -1, 60, 0, 80, "Открытая винтажная рубашка", 15, 40],
  [ 0, 11, 121, 15, 3, -1, -1, -1, 80, "Закрытая винтажная рубашка", 10, 35 ],
  [ 0, 11, 123, 10, 3, -1, -1, -1, 115, "Старый свитшот", 5, 30 ],
  [ 0, 11, 125, 8, 14, -1, -1, -1, 25, "Бейсбольная футболка", 15, 50 ],
  [ 0, 11, 126, 1, 14, -1, -1, -1, 25, "Бейсбольная футболка", 15, 50 ],
  [ 0, 11, 132, 5, 14, -1, -1, -1, 80, "Рубашка с рисунком", 15, 45],
  [ 0, 11, 138, 9, 6, -1, -1, -1, 65, "Спортивная куртка", -10, 30 ],
  [ 0, 11, 141, 4, 14, -1, -1, -1, 55, "Футболка", 15, 50 ],
  [ 0, 11, 146, 8, 7, -1, 44, 0, 125, "Старая Шоу-Куртка", -5, 30 ],
  [ 0, 11, 148, 4, 7, -1, 51, 0, 85, "Потёртая кожаная куртка", -10, 30 ],
  [ 0, 11, 152, 2, 7, -1, 44, 0, 125, "Старая Мото-Куртка", -1, 30 ],
  [ 0, 11, 154, 2, 4, -1, 60, 0, 80, "Кожаный жилет", 15, 40 ],
  [ 0, 11, 161, 0, 2, -1, -1, -1, 35, "Бейсбольная рубашка", 15, 50 ],
  [ 0, 11, 163, 4, 2, -1, 26, 0, 145, "Кожаная куртка", -15, 30 ],
  [ 0, 11, 166, 2, 2, -1, 26, 0, 105, "Джинсовая куртка", -10, 30 ],
  [ 0, 11, 167, 2, 4, -1, 60, 0, 75, "Джинсовый жилет", 15, 40 ],
  [ 0, 11, 168, 4, 4, -1, -1, -1, 25, "Рваная майка", 20, 60 ],
  [ 0, 11, 169, 4, 4, -1, -1, -1, 30, "Рваная футболка", 20, 60 ],
  [ 0, 11, 170, 4, 4, -1, -1, -1, 20, "Рваный топик", 20, 60 ],
  [ 0, 11, 171, 6, 4, -1, -1, -1, 55, "Завязанная рубашка", 15, 50 ],
  [ 0, 11, 172, 0, 3, -1, -1, -1, 85, "Худи", 5, 30 ],
  [ 0, 11, 173, -1, 4, -1, -1, -1, 65, "Кожаный Кроп-Жилет", 20, 55 ],
  [ 0, 11, 242, 8, 6, -1, 51, 0, 180, "Закрытая охотничья куртка", -20, 25 ],
  [ 0, 11, 243, 8, 6, -1, 51, 0,180, "Открытая охотничья куртка", -5, 30 ],
  //[ 0, 11, 276, 3, 6, -1, 51, 0, 180, "Фирменная зак. охотничья куртка", -20, 25 ],
  //[ 0, 11, 277, 3, 6, -1, 51, 0,180, "Фирменная отк. охотничья куртка", -5, 30 ],
  [ 0, 11, 247, 24, 15, -1, -1, -1, 40, "Спортивная майка", 20, 60 ],
  //[ 0, 11, 284, 10, 4, -1, -1, -1, 40, "Фирменная спортивная майка", 20, 60 ],
  //[ 0, 11, 286, 20, 14, -1, -1, -1, 90, "Коллекционная классическая футболка", 15, 50 ],
  //[ 0, 11, 292, 16, 3, -1, -1, -1, 125, "Фирменная толстовка", 5, 30 ],
  //[ 0, 11, 294, 22, 9, -1, -1, -1, 100, "Фирменный свитер", 10, 30 ],
  [ 0, 6, 5, 0, -1, -1, -1, -1, 10, "Сланцы", 25, 99 ],
  [ 0, 6, 10, 2, -1, -1, -1, -1, 55, "Кросовки", -10, 50 ],
  [ 0, 6, 16, 10, -1, -1, -1, -1, 10, "Сланцы", 25, 99 ],
  [ 0, 6, 17, -1, -1, -1, -1, -1, 40, "Ботинки Эльфа", -5, 50 ],
  [ 0, 6, 30, -1, -1, -1, -1, -1, 145, "Поношеные высокие туфли", -30, 30 ],
  [ 0, 6, 59, 0, -1, -1, -1, -1, 85, "Поношеные ботинки", -30, 30 ],
  [ 0, 6, 60, 10, -1, -1, -1, -1, 60, "Старые патрули", -10, 50 ],
  [ 0, 6, 67, 12, -1, -1, -1, -1, 80, "Старые фирменные кеды", -10, 50 ],
  [ 0, 6, 83, 0, -1, -1, -1, -1, 90, "Покрашенные высокие ботинки", -30, 30 ],
  [ 0, 6, 84, 0, -1, -1, -1, -1, 65, "Покрашенные низкие ботинки", -30, 30 ],
  [ 0, 6, 85, 1, -1, -1, -1, -1, 95, "Винтажные высокие ботинки", -30, 30 ],
  [ 0, 6, 86, 1, -1, -1, -1, -1, 70, "Винтажные низкие ботинки", -30, 30 ],
  [ 0, 7, 9, -1, -1, -1, -1, -1, 35, "Нашейная бандана", -99, 99 ],
  [ 0, 7, 15, 3, -1, -1, -1, -1, 35, "Нашейная бандана", -99, 99 ],
  [ 0, 7, 83, 1, -1, -1, -1, -1, 35, "Нашейная бандана", -99, 99 ],
  [ 0, 7, 84, -1, -1, -1, -1, -1, 20, "Индейская цепь", -99, 99 ],
  [ 0, 7, 93, 0, -1, -1, -1, -1, 20, "Индейская цепь", -99, 99 ],

  [ 1, 4, 0, 14, -1, -1, -1, -1, 320, "Джинсы в обтяжку", -15, 40 ],
  [ 1, 4, 1, 14, -1, -1, -1, -1, 250, "Потёртые джинсы", -20, 35 ],
  [ 1, 4, 4, 14, -1, -1, -1, -1, 255, "Джинсы с подворотами", 10, 40 ],
  [ 1, 4, 8, 14, -1, -1, -1, -1, 210, "Мини-Юбка в обтяжку", 15, 50 ],
  [ 1, 4, 9, 14, -1, -1, -1, -1, 220, "Мини-Юбка с пайетками", 15, 50 ],
  [ 1, 4, 11, 14, -1, -1, -1, -1, 335, "Штаны с карманами", 10, 40 ],
  [ 1, 4, 12, 14, -1, -1, -1, -1, 190, "Расклешённая Мини-Юбка", 15, 50 ],
  [ 1, 4, 24, 11, -1, -1, -1, -1, 330, "Юбка до колена", 15, 50 ],
  [ 1, 4, 25, 11, -1, -1, -1, -1, 210, "Джинсовые шорты", 15, 50 ],
  [ 1, 4, 27, 14, -1, -1, -1, -1, 225, "Глянцовые леггинсы", -10, 40 ],
  [ 1, 4, 28, -1, -1, -1, -1, -1, 210, "Полосатя Мини-Юбка", 15, 50 ],
  [ 1, 4, 31, 2, -1, -1, -1, -1, 245, "Новогоднии леггинсы", -5, 40 ],
  [ 1, 4, 43, 3, -1, -1, -1, -1, 370, "Джинсы с разрезами на молниях", 5, 40 ],
  [ 1, 4, 106, 6, -1, -1, -1, -1, 380, "Фирменные джинсы с раз. на молниях", 5, 40 ],
  [ 1, 4, 44, 3, -1, -1, -1, -1, 355, "Джинсы с разрезами", 5, 40 ],
  [ 1, 4, 112, 10, -1, -1, -1, -1, 390, "Джинсы на прошиве", -15, 35 ],
  [ 1, 4, 47, 5, -1, -1, -1, -1, 260, "Пижамные штаны", 10, 35 ],
  [ 1, 4, 51, 3, -1, -1, -1, -1, 200, "Матовые лосины", 10, 40 ],
  [ 1, 4, 54, 2, -1, -1, -1, -1, 210, "Глянцевые лосины", -5, 40 ],
  [ 1, 4, 55, -1, -1, -1, -1, -1, 370, "Эксклюзивные леггинсы", -10, 40 ],
  [ 1, 4, 56, 4, -1, -1, -1, -1, 105, "Заказной низ от бикини", 25, 99 ],
  [ 1, 4, 60, 14, -1, -1, -1, -1, 150, "Новогоднии пижамные штаны", 10, 35 ],
  [ 1, 4, 67, 12, -1, -1, -1, -1, 140, "Пижамные штаны", 10, 35 ],
  [ 1, 4, 73, 4, -1, -1, -1, -1, 285, "Джеггинсы", -15, 35 ],
  [ 1, 4, 74, 4, -1, -1, -1, -1, 275, "Рваные джеггинсы", -5, 40 ],
  [ 1, 4, 75, 1, -1, -1, -1, -1, 345, "Глянцевые джинсы", -15, 35 ],
  [ 1, 4, 76, 1, -1, -1, -1, -1, 350, "Рельефные глянцевые джинсы", -15, 35 ],
  [ 1, 4, 77, 1, -1, -1, -1, -1, 360, "Заказные глянцевые джинсы", -15, 35 ],
  [ 1, 4, 81, 1, -1, -1, -1, -1, 160, "Глянцевые спортивные штаны", -10, 40 ],
  [ 1, 4, 83, 1, -1, -1, -1, -1, 125, "Глянцевые спортивные бриджи", 15, 50 ],
  [ 1, 4, 85, 2, -1, -1, -1, -1, 190, "Глянцевые низкие джинсы", -10, 40 ],
  [ 1, 4, 87, 14, -1, -1, -1, -1, 225, "Заказные леггинсы", -10, 40 ],
  [ 1, 4, 102, 19, -1, -1, -1, -1, 380, "Глянцевые легинсы с ремнями",-15, 30 ],
  [ 1, 4, 108, 14, -1, -1, -1, -1, 220, "Фирменная расклешённая Мини-Юбка", 15, 50 ],
  [ 1, 11, 2, 14, 2, -1, -1, -1, 180, "Футболка на плечо", 15, 50 ],
  [ 1, 11, 8, 1, 1, -1, 20, 0, 690, "Кожаная куртка", 10, 35 ],
  [ 1, 11, 14, 14, 14, -1, -1, -1, 210, "Поло", 15, 50 ],
  [ 1, 11, 30, 1, 2, -1, -1, -1, 180, "Футболка на плечо", 15, 50 ],
  [ 1, 11, 35, 10, 1, -1, 20, 0, 690, "Кожаная куртка", 10, 35 ],
  [ 1, 11, 38, 2, 2, -1, -1, -1, 180, "Футболка на плечо", 15, 50 ],
  [ 1, 11, 40, 0, 2, -1, -1, -1, 180, "Патриотичная футболка на плечо", 15, 50 ],
  [ 1, 11, 44, 1, 3, -1, -1, -1, 285, "Новогодний свитер", 10, 40 ],
  [ 1, 11, 45, 2, -1, -1, -1, -1, 285, "Новогодний свитер", 10, 40 ],
  [ 1, 11, 63, 4, 3, -1, 44, 0, 590, "Куртка с капюшоном", -15, 30 ],
  [ 1, 11, 67, -1, 2, -1, -1, -1, 380, "Золотая футболка на плечо", 15, 50 ],
  [ 1, 11, 68, 18, 14, -1, -1, -1, 155, "Заказная футболка", 15, 50 ],
  [ 1, 11, 71, 14, 4, -1, -1, -1, 245, "Задранный свитер", 10, 40 ],
  [ 1, 11, 72, -1, 3, -1, -1, -1, 510, "Бомбер Wolf", -5, 35 ],
  [ 1, 11, 78, 6, 9, -1, -1, -1, 425, "Свитшот", 5, 30 ],
  [ 1, 11, 79, 2, 1, -1, -1, -1, 245, "Задранный свитер", 10, 40 ],
  [ 1, 11, 81, 10, 3, -1, -1, -1, 525, "Фирменный бомбер", -10, 35 ],
  [ 1, 11, 83, 5, 9, -1, -1, -1, 190, "Пижамная рубашка", 10, 35 ],
  [ 1, 11, 84, 1, 14, -1, -1, -1, 225, "Фирменное поло", 15, 50 ],
  [ 1, 11, 98, 3, 3, -1, -1, -1, 415, "Китайская рубашка", -5, 35 ],
  [ 1, 11, 101, 4, 15, -1, -1, -1, 155, "Заказной верх от бикини", 25, 99 ],
  [ 1, 11, 109, 14, 1, -1, -1, -1, 210, "Новогодняя пижамная рубашка", 10, 35 ],
  [ 1, 11, 110, 8, 3, -1, -1, -1, 490, "Мото-Куртка", -15, 35 ],
  [ 1, 11, 117, 1, 11, -1, -1, -1, 260, "Заправленная задранная футболка", 20, 60 ],
  [ 1, 11, 195, 24, 4, -1, -1, -1, 120, "Фирменная рваная футболка", 20, 60 ],
  [ 1, 11, 118, 1, 11, -1, -1, -1, 160, "Задранная футболка", 20, 60 ],
  [ 1, 11, 119, 1, 11, -1, -1, -1, 285, "Рубашка с карманами", 15, 50 ],
  [ 1, 11, 140, 8, 3, -1, -1, -1, 390, "Бомбер", -10, 35 ],
  [ 1, 11, 142, 12, 9, -1, -1, -1, 190, "Пижамная рубашка", 10, 35 ],
  [ 1, 11, 145, 10,  3, -1, -1, -1, 490, "Мото-Куртка", -10, 30 ],
  [ 1, 11, 149, 14, 3, -1, -1, -1, 265, "Мото-Свитер", 10, 35 ],
  [ 1, 11, 155, 1, 4, -1, -1, -1, 310, "Мото-Жилет", 15, 35 ],
  [ 1, 11, 162, 5, 2, -1, -1, -1, 310, "Мото-Жилет со свитером", -5, 35 ],
  [ 1, 11, 164, 14, 4, -1, 52, 0, 590, "Пуховик", -25, 25 ],
  [ 1, 11, 165, 1, 4, -1, 51, 0, 425, "Кожаное худи", -10, 30 ],
  [ 1, 11, 179, 5, 11, -1, -1, -1, 310, "Мото-Жилет", 15, 35 ],
  [ 1, 11, 186, 2, 3, -1, -1, -1, 650, "Заказная закрытая парка", -20, 25 ],
  [ 1, 11, 187, 2, 9, -1, 52, 0, 650, "Заказная открытая парка", -5, 30 ],
  [ 1, 11, 189, 11, 1, -1, 55, 0, 515, "Длинное худи", -15, 35 ],
  [ 1, 11, 190, 9, 3, -1, -1, -1, 650, "Закрытая парка", -20, 25 ],
  [ 1, 11, 191, 9, 9, -1, 52, 0, 650, "Открытая парка", -5, 30 ],
  [ 1, 11, 192, 24, 5, -1, -1, -1, 370, "Заказной свитер", 10, 30 ],
  [ 1, 11, 193, 24, 4, -1, 52, 0, 590, "Заказной пуховик", -25, 25 ],
  [ 1, 11, 194, 10, 4, -1, 52, 0, 790, "Заканое пальто", -15, 25 ],
  [ 1, 11, 196, 1, 3, -1, -1, -1, 620, "Новогодний неоновый свитер", 10, 30 ],
  [ 1, 11, 197, 1, 3, -1, -1, -1, 320, "Новогодний свитер", 10, 30 ],
  [ 1, 11, 198, 14, 9, -1, -1, -1, 620, "Рождественский неоновый свитер", 10, 30 ],
  [ 1, 11, 198, 14, 9, -1, -1, -1, 320, "Рождественский свитер", 10, 30 ],
  [ 1, 11, 200, 6, 9, -1, -1, -1, 590, "Новогодняя неоновая теп. кофта", -5, 25 ],
  [ 1, 11, 201, 6, 9, -1, -1, -1, 290, "Новогодняя теплая кофта", -5, 25 ],
  [ 1, 11, 202, 24, 3, -1, -1, -1, 310, "Заказное худи", 5, 30 ],
  [ 1, 11, 207, 3, 4, -1, -1, -1, 250, "Жилет с капюшоном", 15, 45 ],
  [ 1, 11, 208, 15, 11, -1, -1, -1, 90, "Заправленная майка", 20, 60 ],
  [ 1, 11, 209, 15, 11, -1, -1, -1, 90, "Майка", 20, 60 ],
  [ 1, 11, 227, 13, 3, -1, -1, -1, 435, "Заказная куртка", -25, 25 ],
  [ 1, 11, 147, 10, 3, -1, -1, -1, 385, "Заказная спортивная куртка", -10, 35 ],
  [ 1, 11, 150, 24, 3, -1, -1, -1, 385, "Заказная спортивная куртка", -10, 35 ],
  //[ 1, 11, 151, 6, 4, -1, -1, -1, 425, "Фирменная спортивная куртка", -10, 35 ],
  [ 1, 11, 233, 11, 4, -1, -1, -1, 330, "Фирменный тёплый жилет", 10, 30 ],
  [ 1, 11, 234, 14, 6, -1, -1, -1, 460, "Фирменная тёплая куртка", -20, 30 ],
  //[ 1, 11, 235, 0, 9, -1, -1, -1, 270, "Коллекционный задранный джемпер", 10, 35 ],
  [ 1, 11, 239, 10, 3, -1, -1, -1, 425, "Закрытый бомбер", -10, 30 ],
  [ 1, 11, 240, 10, 1, -1, 52, 0, 425, "Открытый бомбер", -5, 35 ],
  [ 1, 11, 246, 10, 14, -1, -1, -1, 250, "Фирменное поло", 15, 50 ],
  [ 1, 11, 249, 4, 14, -1, -1, -1, 270, "Заказное поло", 15, 50 ],
  [ 1, 11, 252, 24, 14, -1, 51, 0, 710, "Модная куртка с карманами", -25, 30 ],
  [ 1, 11, 253, 8, 14, -1, -1, -1, 220, "Новогодний свитер", 10, 40 ],
  [ 1, 11, 255, 24, 11, -1, -1, -1, 320, "Модный жилет с карманами", 15, 35 ],
  //[ 1, 11, 256, 24, 5, -1, -1, -1, 740, "Плотная куртка с карманами", -25, 30 ],
  [ 1, 11, 259, 24, 3, -1, -1, -1, 880, "Анорак", -25, 30 ],
  /*[ 1, 11, 264, 24, 3, -1, -1, -1, 370, "Эксклюзивный свитер Bigness", 10, 30 ],
  [ 1, 11, 265, 14, 3, -1, -1, -1, 495, "Фирменный закрытый бомбер", -10, 30 ],
  [ 1, 11, 270, 14, 1, -1, 52, 0, 495, "Фирменный открытый бомбер", -5, 35 ],
  [ 1, 11, 274, 16, 3, -1, -1, -1, 515, "Модный закрытый бомбер", -10, 30 ],
  [ 1, 11, 275, 16, 1, -1, 0, 1, 515, "Модный открытый бомбер", -5, 35 ],
  [ 1, 11, 267, 13, 7, -1, -1, -1, 550, "Тёплая кофта", -5, 25 ],
  [ 1, 11, 268, 24, 1, -1, -1, -1, 390, "Эксклюзивный свитер", 10, 30 ],
  [ 1, 11, 271, 14, 3, -1, -1, -1, 390, "Эксклюзивная толстовка", 5, 35 ],
  [ 1, 11, 278, 14, 4, -1, 52, 0, 590, "Модный пуховик", -25, 25 ],
  [ 1, 11, 279, 6, 15, -1, -1, -1, 175, "Модный верх от бикини", 25, 99 ],
  [ 1, 11, 280, 19, 14, -1, -1, -1, 170, "Модная классическая футболка", 15, 50 ],
  [ 1, 11, 281, 19, 14, -1, -1, -1, 170, "Модная классическая футболка", 15, 50 ],
  [ 1, 11, 301, 12, 9, -1, -1, -1, 350, "Неоновый фир. новогодний свитер", 10, 30 ],*/
  [ 1, 6, 1, 14, -1, -1, -1, -1, 220, "Скейтерские кеды", 5, 50 ],
  [ 1, 6, 2, 14, -1, -1, -1, -1, 290, "Угги", -30, 30 ],
  [ 1, 6, 3, 14, -1, -1, -1, -1, 205, "Низкие кеды", -10, 50 ],
  [ 1, 6, 4, 2, -1, -1, -1, -1, 210, "Кросовки ProLaps", -10, 50 ],
  [ 1, 6, 11, 2, -1, -1, -1, -1, 275, "Патрули", -10, 50 ],
  [ 1, 6, 31, -1, -1, -1, -1, -1, 575, "Золотые патрули", -10, 50 ],
  [ 1, 6, 32, 3, -1, -1, -1, -1, 215, "Фирменные кросовки", -10, 50 ],
  [ 1, 6, 33, 6, -1, -1, -1, -1, 255, "Теплые кеды", -20, 50 ],
  [ 1, 6, 47, 8, -1, -1, -1, -1, 225, "Мото-Кросовки", -10, 50 ],
  [ 1, 6, 49, 0, -1, -1, -1, -1, 285, "Кеды", -10, 50 ],
  [ 1, 6, 50, 0, -1, -1, -1, -1, 285, "Кеды", -10, 50 ],
  [ 1, 6, 58, 8, -1, -1, -1, -1, 640, "Неоновые кеды", -10, 50 ],
  [ 1, 6, 73, 24, -1, -1, -1, -1, 415, "Фирменные сапоги", -30, 30 ],
  [ 1, 6, 74, 24, -1, -1, -1, -1, 345, "Фирменные ботинки", -30, 30 ],
  [ 1, 6, 75, 24, -1, -1, -1, -1, 400, "Фирменные высокие кроссовки", -30, 30 ],
  [ 1, 6, 76, 24, -1, -1, -1, -1, 330, "Фирменные кроссовки", -10, 50 ],
  [ 1, 6, 77, 7, -1, -1, -1, -1, 450, "Модные ботинки на каблуке", -30, 30 ],
  [ 1, 6, 81, 24, -1, -1, -1, -1, 440, "Светодиодные кроссовки", -10, 50 ],

  [ 2, 4, 6, 1, -1, -1, -1, -1, 960, "Кожаные брюки", -15, 40 ],
  [ 2, 4, 7, 0, -1, -1, -1, -1, 1090, "Кожаная юбка", 15, 40 ],
  [ 2, 4, 18, 0, -1, -1, -1, -1, 1190, "Офисная юбка", 15, 40 ],
  [ 2, 4, 19, 3, -1, -1, -1, -1, 450, "Кружевные шорты", 25, 99 ],
  [ 2, 4, 20, 1, -1, -1, -1, -1, 750, "Трусы с чулками", 25, 99 ],
  [ 2, 4, 23, 11, -1, -1, -1, -1, 860, "Брюки", -15, 40 ],
  [ 2, 4, 26, -1, -1, -1, -1, -1, 550, "Леопардовая Мини-Юбка", 15, 60 ],
  [ 2, 4, 34, -1, -1, -1, -1, -1, 810, "Брюки на ремне", -15, 40 ],
  [ 2, 4, 36, 2, -1, -1, -1, -1, 1190, "Офисная юбка", 15, 40 ],
  [ 2, 4, 37, 5, -1, -1, -1, -1, 545, "Прямые брюки", -15, 40 ],
  [ 2, 4, 41, 2, -1, -1, -1, -1, 585, "Свободные штаны на ремне", -15, 40 ],
  [ 2, 4, 50, 2, -1, -1, -1, -1, 860, "Брюки", -15, 40 ],
  [ 2, 4, 52, 2, -1, -1, -1, -1, 860, "Брюки", -15, 40 ],
  [ 2, 4, 53, -1, -1, -1, -1, -1, 1160, "Эксклюзивные брюки", -15, 40 ],
  [ 2, 4, 62, 10, -1, -1, -1, -1, 450, "Кружевные шорты", 25, 99 ],
  [ 2, 4, 63, 10, -1, -1, -1, -1, 750, "Трусы с чулками", 25, 99 ],
  [ 2, 4, 64, 2, -1, -1, -1, -1, 725, "Брюки с карманами", -15, 40 ],
  [ 2, 11, 6, 1, 1, -1, 20, 0, 1290, "Жакет", 5, 35 ],
  [ 2, 11, 7, 1, 6, -1, 20, 0, 1890, "Открытый пиджак", 5, 35 ],
  [ 2, 11, 9, 13, -1, -1, -1, -1, 1190, "Задранная рубашка", 15, 45 ],
  [ 2, 11, 244, 24, 9, -1, -1, -1, 1490, "Заказная задранная рубашка", 15, 45 ],
  //[ 2, 11, 269, 24, 9, -1, -1, -1, 1590, "Эксклюзивная задранная рубашка", 10, 45 ],
  [ 2, 11, 13, 14, 4, -1, -1, -1, 650, "Корсет", 20, 60 ],
  [ 2, 11, 20, 0, 1, -1, 18, 0, 1390, "Новогодний жакет", 5, 35 ],
  [ 2, 11, 21, 4, 4, -1, -1, -1, 2490, "Винтажное платье", 20, 50 ],
  [ 2, 11, 22, 3, 4, -1, -1, -1, 790, "Кружевной корсет", 20, 60 ],
  [ 2, 11, 24, 10, 1, -1, 20, 0, 1290, "Жакет", 5, 35 ],
  [ 2, 11, 25, 9, 6, -1, 20, 0, 1890, "Открытый пиджак", 5, 35 ],
  [ 2, 11, 26, 11, 12, -1, -1, -1, 490, "Плиссированная майка", 20, 60 ],
  [ 2, 11, 28, 14, 0, -1, 24, 3, 890, "Жилетка с рубашкой", 15, 45 ],
  [ 2, 11, 39, -1, 5, -1, -1, -1, 1790, "Патриотичный фрак", 5, 35 ],
  [ 2, 11, 51, -1, 3, -1, 41, 1, 1690, "Фрак", 5, 35 ],
  [ 2, 11, 52, 2, 3, -1, 41, 1, 860, "Открытый мятый пиджак", 5, 35 ],
  [ 2, 11, 53, 2, 1, -1, 41, 1, 860, "Закрытый мятый пиджак", 5, 35 ],
  [ 2, 11, 57, 7, 3, -1, 41, 1, 2690, "Открытый пиджак с жилетом", -5, 35 ],
  [ 2, 11, 58, 7, 1, -1, 41, 1, 2690, "Закрытый пиджак с жилетом", -5, 35 ],
  [ 2, 11, 64, 3, 3, -1, 67, 2, 4250, "Пальто", -25, 30 ],
  [ 2, 11, 65, 10, 6, -1, 53, 0, 7990, "Куртка с мехом", -30, 25 ],
  [ 2, 11, 248, 4, 6, -1, 53, 0, 7990, "Куртка с мехом", -30, 25 ],
  [ 0, 11, 135, 1, 3, -1, -1, -1, 4500, "Кожаная куртка", -20, 30 ],
  [ 0, 11, 133, 5, 3, -1, 67, 2, 3100, "Ветровка", -15, 30 ],
  [ 0, 11, 139, 1, 3, -1, 67, 2, 250, "Пальто", -25, 30 ],
  [ 2, 11, 66, 2, 1, -1, 60, 0, 3490, "Кожаный пиджак на поясе", -5, 30 ],
  [ 2, 11, 69, -1, 1, -1, 53, 0, 2780, "Заказная кожаная куртка", -15, 30],
  [ 2, 11, 70, 3, -1, -1, 53, 0, 3090, "Пальто на поясе", -25, 30 ],
  [ 2, 11, 90, 3, 6, -1, 0, 1, 2690, "Заказной открытый пиджак", 5, 35 ],
  [ 2, 11, 91, 3, 6, -1, 1, 1, 2690, "Заказной закрытый пиджак", 5, 35 ],
  [ 2, 11, 92, 2, 5, -1, 0, 1, 3190, "Открытый глянцевый пидждак", 5, 35 ],
  [ 2, 11, 93, 2, 5, -1, 1, 1, 3190, "Закрытый глянцевый пиджак", 5, 35 ],
  [ 2, 11, 94, -1, 5, -1, 0, 1, 5290, "Элитный закрытый пиджак", 5, 35 ],
  [ 2, 11, 95, -1, 5, -1, 1, 1, 5290, "Элитный открытый пиджак", 5, 35 ],
  [ 2, 11, 99, 9, 4, -1, 60, 0, 3590, "Раритетный пиджак", -5, 35 ],
  [ 2, 11, 143, 12, 4, -1, 60, 0, 3590, "Раритетный пиджак", -5, 35 ],
  [ 2, 11, 111, 10, 4, -1, -1, -1, 790, "Заказной корсет", 20, 60 ],
  [ 2, 11, 112, 1, 4, -1, -1, -1, 1790, "Платье Арт-Деко #1", 20, 50 ],
  [ 2, 11, 113, 1, 4, -1, -1, -1, 1790, "Платье Арт-Деко #2", 20, 50 ],
  [ 2, 11, 114, 1, 4, -1, -1, -1, 1790, "Платье Арт-Деко #3", 20, 50 ],
  [ 2, 11, 115, 1, 4, -1, -1, -1, 1790, "Платье Арт-Деко #4", 20, 50 ],
  [ 2, 11, 116, 1, 4, -1, -1, -1, 1790, "Платье Арт-Деко #5", 20, 50 ],
  [ 2, 11, 137, 13, 3, -1, 66, 4, 2890, "Пиджак на пуговицах", -5, 35 ],
  [ 2, 11, 185, 4, 6, -1, 21, 0, 2250, "Праздничный пиджак", 5, 35 ],
  //[ 2, 11, 273, 14, 6, -1, 44, 0, 1650, "Замшевая куртка", -10, 35 ],
  //[ 2, 11, 283, 10, 12, -1, -1, -1, 550, "Фирменная плиссированная майка", 20, 60 ],
  [ 2, 6, 0, 2, -1, -1, -1, -1, 880, "Высокие туфли", 10, 50 ],
  [ 2, 6, 6, 2, -1, -1, -1, -1, 960, "Острые высокие туфли", 10, 50 ],
  [ 2, 6, 7, 14, -1, -1, -1, -1, 1150, "Ботинки на каблуке", -30, 30 ],
  [ 2, 6, 8, 14, -1, -1, -1, -1, 1020, "Закрытые высокие туфли", -10, 30 ],
  [ 2, 6, 9, 2, -1, -1, -1, -1, 1420, "Сапоги", -25, 30 ],
  [ 2, 6, 13, 14, -1, -1, -1, -1, 320, "Балетки", 10, 50 ],
  [ 2, 6, 14, 14, -1, -1, -1, -1, 1290, "Открытые высокие туфли", 10, 50 ],
  [ 2, 6, 15, 14, -1, -1, -1, -1, 590, "Заказные сандали", 20, 60 ],
  [ 2, 6, 18, 1, -1, -1, -1, -1, 975, "Заказные туфли с подложкой", 5, 50 ],
  [ 2, 6, 19, 10, -1, -1, -1, -1, 880, "Высокие туфли", 10, 50 ],
  [ 2, 6, 20, 10, -1, -1, -1, -1, 960, "Острые выоские туфли", 10, 50 ],
  [ 2, 6, 21, 8, -1, -1, -1, -1, 1420, "Сапоги", -25, 30 ],
  [ 2, 6, 22, 14, -1, -1, -1, -1, 1320, "Закрытые выоские туфли", -25, 30 ],
  [ 2, 6, 23, 1, -1, -1, -1, -1, 1100, "Фирменные высокие туфли", 10, 50 ],
  [ 2, 6, 29, 1, -1, -1, -1, -1, 780, "Туфли", -15, 50 ],
  [ 2, 6, 37, 2, -1, -1, -1, -1, 490, "Винтажные макасины", 10, 50 ],
  [ 2, 6, 38, 0, -1, -1, -1, -1, 1090, "Ковбойские ботинки", -25, 30 ],
  [ 2, 6, 39, 0, -1, -1, -1, -1, 890, "Ковбойские туфли", -15, 40 ],
  [ 2, 6, 41, 10, -1, -1, -1, -1, 975, "Заказные туфли с подложкой", 5, 50 ],
  [ 2, 6, 42, 10, -1, -1, -1, -1, 950, "Заказные высокие туфли", 10, 50 ],
  [ 2, 6, 43, 6, -1, -1, -1, -1, 780, "Туфли на толстом каблуке", -20, 30 ],
  [ 2, 6, 44, 6, -1, -1, -1, -1, 770, "Туфли на шнурках", -15, 30 ],
  [ 2, 6, 45, 9, -1, -1, -1, -1, 1090, "Ковбойские ботинки", -25, 30 ],
  [ 2, 6, 46, 9, -1, -1, -1, -1, 890, "Ковбойские туфли", -15, 40 ],
  [ 2, 6, 51, 4, -1, -1, -1, -1, 1295, "Кожаные сапоги", -25, 25 ],
  [ 2, 6, 52, 4, -1, -1, -1, -1, 1075, "Кожаные ботинки", -20, 30 ],
  [ 2, 6, 53, 0, -1, -1, -1, -1, 620, "Зимние ботикнки", -30, 20 ],
  [ 2, 6, 56, 1, -1, -1, -1, -1, 950, "Сапоги на застёжках", -25, 25 ],
  [ 2, 6, 55, 1, -1, -1, -1, -1, 650, "Ботинки на застёжках", -20, 30],
  [ 2, 6, 92, 10, -1, -1, -1, -1, 820, "Меховые сапоги", -30, 20 ],
  [ 2, 7, 13, 4, -1, -1, -1, -1, 260, "Дамский галстук", -99, 99 ],
  [ 2, 7, 19, -1, -1, -1, -1, -1, 170, "Свободная бабочка", -99, 99 ],
  [ 2, 7, 20, 14, -1, -1, -1, -1, 195, "Свободный галстук", -99, 99 ],
  [ 2, 7, 21, 1, -1, -1, -1, -1, 195, "Тонкий галстук", -99, 99 ],
  [ 2, 7, 22, 14, -1, -1, -1, -1, 195, "Тонкий галстук", -99, 99 ],
  [ 2, 7, 23, 1, -1, -1, -1, -1, 170, "Бабочка", -99, 99 ],
  [ 2, 7, 26, 14, -1, -1, -1, -1, 195, "Свободный галстук (под)", -99, 99 ],
  [ 2, 7, 27, 1, -1, -1, -1, -1, 195, "Тонкий галстук (под)", -99, 99 ],
  [ 2, 7, 28, 14, -1, -1, -1, -1, 195, "Тонкий галстук (под)", -99, 99 ],


  [ 3, 4, 30, 3, -1, -1, -1, -1, 285, "Камуфляжные бриджи", 5, 35 ],
  [ 3, 4, 89, 22, -1, -1, -1, -1, 320, "Камуфляжные карго-штаны", -30, 30 ],
  [ 3, 4, 91, 22, -1, -1, -1, -1, 115, "Камуфляжные карго-шорты", 15, 50 ],
  [ 3, 4, 109, 16, -1, -1, -1, -1, 150, "Камуфляжные штаны", -25, 25 ],
  [ 3, 4, 110, 16, -1, -1, -1, -1, 110, "Камуфляжные шорты", -25, 25 ],
  [ 3, 11, 43, 3, 3, -1, -1, -1, 390, "Свитер с накладками", 5, 30 ],
  [ 3, 11, 210, 22, 4, -1, -1, -1, 250, "Камуфляжный жилет с капюшоном", 15, 35 ],
  [ 3, 11, 212, 22, 14, -1, -1, -1, 135, "Камуфляжная футболка", 15, 50 ],
  [ 3, 11, 213, 22, 3, -1, -1, -1, 465, "Камуфялжная заказная куртка", -20, 30 ],
  [ 3, 11, 214, 22, 3, -1, -1, -1, 675, "Камуфляжная закрытая парка", -25, 25 ],
  [ 3, 11, 216, 22, 9, -1, 52, 0, 675, "Камуфляжная открытая парка", -5, 30 ],
  [ 3, 11, 217, 22, 4, -1, -1, -1, 325, "Камуфляжный Мото-Жилет", 10, 35 ],
  [ 3, 11, 218, 22, 2, -1, -1, -1, 325, "Камуфляжная Мото-Кофта", -10, 30 ],
  [ 3, 11, 219, 22, 2, -1, 26, 0, 125, "Камуфляжная джинсовая куртка", -10, 30 ],
  [ 3, 11, 220, 22, 4, -1, 60, 0, 125, "Камуфляжный джинсовый жилет", 15, 40 ],
  [ 3, 11, 221, 22, 4, -1, -1, -1, 35, "Камуфляжная рваная майка", 20, 60 ],
  [ 3, 11, 222, 22, 4, -1, -1, -1, 40, "Камуфляжная рваная футболка", 20, 60 ],
  [ 3, 11, 223, 22, 4, -1, -1, -1, 30, "Камуфляжный рваная топик", 20, 60 ],
  [ 3, 11, 224, 22, 14, -1, -1, -1, 135, "Камуфляжная заправленная футболка", 16, 50 ],
  [ 3, 11, 225, 22, 15, -1, -1, -1, 100, "Камуфляжная майка", 20, 60 ],
  [ 3, 11, 226, 22, 15, -1, -1, -1, 100, "Камуфляжная заправленная майка", 20, 60 ],
  [ 3, 11, 229, 24, 15, -1, -1, -1, 145, "Камуфляжная рубашка без рук", 20, 60 ],
  [ 3, 11, 230, 24, 3, -1, -1, -1, 225, "Камуфляжная кофта с карманами", -5, 30 ],
  [ 3, 11, 231, 24, 3, -1, -1, -1, 290, "Камуфляжная куртка с карманами", -20, 25 ],
  [ 3, 11, 232, 24,  2, -1, -1, -1, 290, "Камуфляжная задранная рубашка", 10, 30 ],
  [ 3, 6, 54, 4, -1, -1, -1, -1, 190, "Охотничьи сапоги", -30, 25 ],
  [ 3, 6, 55, 4, -1, -1, -1, -1, 170, "Охотничьи ботинки", -25, 30 ],
  [ 3, 6, 62, 24, -1, -1, -1, -1, 115, "Камуфляжные кросовки", -10, 50 ],
  [ 3, 6, 63, 6, -1, -1, -1, -1, 210, "Камуфляжные сапоги", -30, 25 ],
  [ 3, 6, 64, 6, -1, -1, -1, -1, 170, "Камуфляжные ботинки", -25, 30 ],
  [ 3, 6, 65, 6, -1, -1, -1, -1, 195, "Камуфляжные высокие ботинки", -30, 25 ],
  [ 3, 6, 66, 6, -1, -1, -1, -1, 155, "Камуфляжные низкие кросовки", -10, 50 ],

  [ 4, 7, 6, 4, -1, -1, -1, -1, 2550, "Ожерелье с камнем", -99, 99 ],
  [ 4, 7, 7, 0, -1, -1, -1, -1, 450, "Ожерелье с сердцем", -99, 99 ],
  [ 4, 7, 11, 2, -1, -1, -1, -1, 450, "Ожерелье с сердцем", -99, 99 ],
  [ 4, 7, 12, 1, -1, -1, -1, -1, 2100, "Жемчужные бусы", -99, 99 ],
  [ 4, 7, 29, 0, -1, -1, -1, -1, 1200, "Цепь SN", -99, 99 ],
  [ 4, 7, 30, 0, -1, -1, -1, -1, 1350, "Цепь Череп", -99, 99 ],
  [ 4, 7, 31, -1, -1, -1, -1, -1, 1300, "Цепь Маска", -99, 99 ],
  [ 4, 7, 32, 0, -1, -1, -1, -1, 1450, "Цепь ZORSE", -99, 99 ],
  [ 4, 7, 33, 0, -1, -1, -1, -1, 1550, "Цепь LC", -99, 99 ],
  [ 4, 7, 34, 0, -1, -1, -1, -1, 1500, "Цепь Dix", -99, 99 ],
  [ 4, 7, 35, 0, -1, -1, -1, -1, 1400, "Цепь Le Chen", -99, 99 ],
  [ 4, 7, 36, 0, -1, -1, -1, -1, 1200, "Цепь SN (над)", -99, 99 ],
  [ 4, 7, 37, 0, -1, -1, -1, -1, 1350, "Цепь Череп (над)", -99, 99 ],
  [ 4, 7, 38, -1, -1, -1, -1, -1, 1300, "Цепь Маска (над)", -99, 99 ],
  [ 4, 7, 39, 0, -1, -1, -1, -1, 1450, "Цепь ZORSE (над)", -99, 99 ],
  [ 4, 7, 40, 0, -1, -1, -1, -1, 1550, "Цепь LC (над)", -99, 99 ],
  [ 4, 7, 41, 0, -1, -1, -1, -1, 1500, "Цепь Dix (над)", -99, 99 ],
  [ 4, 7, 42, 0, -1, -1, -1, -1, 1400, "Цепь Le Chen (над)", -99, 99 ],
  [ 4, 7, 53, 0, -1, -1, -1, -1, 450, "Тонкая цепь", -99, 99 ],
  [ 4, 7, 54, 0, -1, -1, -1, -1, 475, "Толстая цепь", -99, 99 ],
  [ 4, 7, 55, 0, -1, -1, -1, -1, 500, "Плотная цепь", -99, 99 ],
  [ 4, 7, 56, 0, -1, -1, -1, -1, 580, "Ребристая цепь", -99, 99 ],
  [ 4, 7, 57, 0, -1, -1, -1, -1, 540, "Наружная цепь", -99, 99 ],
  [ 4, 7, 58, 0, -1, -1, -1, -1, 560, "Клёсткая цепь", -99, 99 ],
  [ 4, 7, 59, 0, -1, -1, -1, -1, 890, "Винтажная цепь", -99, 99 ],
  [ 4, 7, 60, 0, -1, -1, -1, -1, 320, "Лёгкая цепь", -99, 99 ],
  [ 4, 7, 61, 0, -1, -1, -1, -1, 350, "Сплошная цепь", -99, 99 ],
  [ 4, 7, 62, 0, -1, -1, -1, -1, 345, "Тряпичная цепь", -99, 99 ],
  [ 4, 7, 64, 0, -1, -1, -1, -1, 450, "Тонкая цепь (над)", -99, 99 ],
  [ 4, 7, 65, 0, -1, -1, -1, -1, 475, "Толстая цепь (над)", -99, 99 ],
  [ 4, 7, 66, 0, -1, -1, -1, -1, 500, "Плотная цепь (над)", -99, 99 ],
  [ 4, 7, 67, 0, -1, -1, -1, -1, 580, "Ребристая цепь (над)", -99, 99 ],
  [ 4, 7, 68, 0, -1, -1, -1, -1, 540, "Наружная цепь (над)", -99, 99 ],
  [ 4, 7, 69, 0, -1, -1, -1, -1, 560, "Клёсткая цепь (над)", -99, 99 ],
  [ 4, 7, 70, 0, -1, -1, -1, -1, 890, "Винтажная цепь (над)", -99, 99 ],
  [ 4, 7, 71, 0, -1, -1, -1, -1, 320, "Лёгкая цепь (над)", -99, 99 ],
  [ 4, 7, 72, 0, -1, -1, -1, -1, 350, "Сплошная цепь (над)", -99, 99 ],
  [ 4, 7, 73, 0, -1, -1, -1, -1, 345, "Тряпичная цепь (над)", -99, 99 ],
  [ 4, 7, 81, 0, -1, -1, -1, -1, 1100, "Цепь M", -99, 99 ],
  [ 4, 7, 82, 0, -1, -1, -1, -1, 1100, "Цепь M (над)", -99, 99 ],
  [ 4, 7, 89, 0, -1, -1, -1, -1, 1850, "Цепь Колесо M", -99, 99 ],
  [ 4, 7, 90, 0, -1, -1, -1, -1, 1850, "Цепь Колесо M (над)", -99, 99 ],
  [ 4, 7, 91, 0, -1, -1, -1, -1, 1900, "Цепь Колесо S", -99, 99 ],
  [ 4, 7, 92, 0, -1, -1, -1, -1, 1900, "Цепь Колесо S (над)", -99, 99 ],

  [ 5, 4, 45, 2, -1, -1, -1, -1, 75, "Свободные штаны с карманами", -20, 30 ],
  [ 5, 4, 3, 14, -1, -1, -1, -1, 80, "Мятые штаны", -20, 30 ],
  [ 5, 4, 58, 2, -1, -1, -1, -1, 40, "Широкие спортивные штаны", -10, 30 ],
  [ 5, 4, 66, 9, -1, -1, -1, -1, 40, "Широкие спортивные штаны", -10, 30 ],
  [ 5, 4, 71, 16, -1, -1, -1, -1, 115, "Шаровары", -25, 30 ],
  [ 5, 4, 80, 6, -1, -1, -1, -1, 90, "Спортивные штаны", -10, 35 ],
  [ 5, 4, 84, 8, -1, -1, -1, -1, 105, "Низкие джинсы", -10, 40 ],
  [ 5, 4, 101, 24, -1, -1, -1, -1, 90, "Штаны с карманами", -25, 30 ],
  [ 5, 4, 82, 6, -1, -1, -1, -1, 65, "Спортивные бриджи", 10, 50 ],
  [ 5, 4, 2, 1, -1, -1, -1, -1, 55, "Спортивные бриджи", 15, 50 ],
  [ 5, 4, 10, 1, -1, -1, -1, -1, 25, "Спортивные шорты", 15, 60 ],
  [ 5, 4, 14, 0, -1, -1, -1, -1, 35, "Шорты", 20, 60 ],
  [ 5, 4, 16, 10, -1, -1, -1, -1, 35, "Шорты", 20, 60 ],
  [ 5, 4, 78, 2, -1, -1, -1, -1, 45, "Шорты с чулками", 15, 45 ],
  [ 5, 4, 17, 10, -1, -1, -1, -1, 15, "Низ от бикини", 25, 99 ],
  [ 5, 4, 21, -1, -1, -1, -1, -1, 5, "Низ от Мини-Бикини", 25, 99 ],
  [ 5, 4, 57, 6, -1, -1, -1, -1, 60, "Низ от халата", 10, 50 ],
  [ 5, 4, 107, 10, -1, -1, -1, -1, 35, "Заказные спортивные шорты", 15, 60 ],
  [ 5, 11, 0, 14, 12, -1, -1, -1, 70, "Футболка с вырезом", 15, 50 ],
  [ 5, 11, 1, 1, 1, -1, 20, 0, 125, "Джинсовая куртка", 10, 35 ],
  [ 5, 11, 3, 3, 3, -1, -1, -1, 140, "Толстовка", 5, 30 ],
  [ 5, 11, 10, 1, 0, -1, 21, 0, 135, "Спортивная ветровка", 5, 30 ],
  [ 5, 11, 11, 1, 4, -1, -1, -1, 35, "Спортивная майка", 20, 60 ],
  [ 5, 11, 16, 5, 4, -1, -1, -1, 35, "Спортивная майка", 20, 60 ],
  [ 5, 11, 18, 10, 15, -1, -1, -1, 50, "Верх бикини", 25, 99 ],
  [ 5, 11, 19, 2, 12, -1, -1, -1, 75, "Новогодняя футболк с вырезом", 15, 50 ],
  [ 5, 11, 23, 1, 12, -1, -1, -1, 70, "Футболка с вырезом", 15, 50 ],
  [ 5, 11, 31, 5, 1, -1, 20, 0, 125, "Джинсовая куртка", 10, 35 ],
  [ 5, 11, 32, 1, 4, -1, -1, -1, 35, "Спортивная майка", 20, 60 ],
  [ 5, 11, 33, 7, 4, -1, -1, -1, 60, "Кроп-Майка", 25, 60 ],
  [ 5, 11, 36, 3, 4, -1, -1, -1, 75, "Фирменный верх купальника", 20, 60 ],
  [ 5, 11, 37, 4, 4, -1, -1, -1, 180, "Сарафан", 15, 45 ],
  [ 5, 11, 49, 0, 14, -1, -1, -1, 55, "Футболка", 15, 50 ],
  [ 0, 11, 54, 2, 3, -1, -1, -1, 175, "Старая Мото-Куртка", -15, 30 ],
  [ 5, 11, 73, 1, 14, -1, -1, -1, 55, "Футболка", 15, 50 ],
  [ 5, 11, 74, 1, 4, -1, -1, -1, 30, "Майка", 20, 60 ],
  [ 5, 11, 75, 2, 9, -1, -1, -1, 85, "Задраный джемпер", 10, 40 ],
  [ 5, 11, 76, 3, 9, -1, -1, -1, 90, "Бейбсбольная рубашка", 15, 50 ],
  [ 5, 11, 105, 6, 4, -1, -1, -1, 90, "Верх от халата", 15, 50 ],
  [ 5, 11, 106, 2, 6, -1, -1, -1, 65, "Спортивная куртка", -10, 30 ],
  [ 5, 11, 125, 8, 14, -1, -1, -1, 25, "Бейсбольная футболка", 15, 50 ],
  [ 5, 11, 126, 1, 14, -1, -1, -1, 25, "Бейсбольная футболка", 15, 50 ],
  [ 5, 11, 132, 5, 14, -1, -1, -1, 80, "Рубашка с рисунком", 15, 45 ],
  [ 5, 11, 138, 9, 6, -1, -1, -1, 65, "Спортивная куртка", -10, 30 ],
  [ 5, 11, 141, 4, 14, -1, -1, -1, 55, "Футболка", 15, 50 ],
  [ 5, 11, 148, 4, 7, -1, 51, 0, 85, "Потёртая кожаная куртка", -10, 30 ],
  [ 5, 11, 154, 2, 4, -1, 60, 0, 80, "Кожаный жилет", 15, 40 ],
  [ 5, 11, 156, 0, 4, -1, 60, 0, 80, "Байкерский жилет", 15, 40 ],
  [ 5, 11, 157, 0, 4, -1, 60, 0, 80, "Байкерский жилет", 15, 40 ],
  [ 5, 11, 158, 2, 5, -1, -1, -1, 110, "Байкерская куртка", -15, 30 ],
  [ 5, 11, 159, 2, 4, -1, -1, -1, 80, "Байкерский жилет", 15, 35 ],
  [ 5, 11, 160, -1, 2, -1, 26, 0, 95, "Старая байкерская куртка", -15, 35 ],
  [ 5, 11, 161, 0, 2, -1, -1, -1, 35, "Бейсбольная рубашка", 15, 50 ],
  [ 5, 11, 163, 4, 2, -1, 26, 0, 145, "Кожаная куртка", -15, 35 ],
  [ 5, 11, 166, 2, 2, -1, 26, 0, 105, "Джинсовая куртка", -10, 30 ],
  [ 5, 11, 167, 2, 4, -1, 60, 0, 75, "Джинсовый жилет", 15, 40 ],
  [ 5, 11, 168, 4, 4, -1, -1, -1, 25, "Рваная майка", 20, 60 ],
  [ 5, 11, 169, 4, 4, -1, -1, -1, 30, "Рваная футболка", 20, 60 ],
  [ 5, 11, 170, 4, 4, -1, -1, -1, 20, "Рваный топик", 20, 60 ],
  [ 5, 11, 171, 6, 4, -1, -1, -1, 55, "Завязанная рубашка", 15, 50 ],
  [ 5, 11, 172, 0, 3, -1, -1, -1, 85, "Худи", 5, 30 ],
  [ 5, 11, 173, -1, 4, -1, -1, -1, 65, "Кожаный Кроп-Жилет", 20, 55 ],
  [ 5, 11, 174, 2, 2, -1, 26, 0, 135, "Байкерская джинсовая куртка", -10, 30 ],
  [ 5, 11, 175, 2, 4, -1, 60, 0, 105, "Байкерский джинсовый жилет", 15, 40 ],
  [ 5, 11, 176, 2, 5, -1, -1, -1, 135, "Байкерская кожаная куртка", -15, 30 ],
  [ 5, 11, 177, 2, 4, -1, -1, -1, 115, "Байкерский кожаный жилет", 15, 35 ],
  [ 5, 11, 242, 8, 6, -1, 51, 0, 180, "Закрытая охотничья куртка", -25, 25 ],
  [ 5, 11, 242, 8, 6, -1, 51, 0,180, "Открытая охотничья куртка", -5, 30 ],
  [ 5, 11, 247, 24, 15, -1, -1, -1, 40, "Спортивная майка", 20, 60 ],
  [ 5, 11, 266, 22, 7, -1, -1, -1, 120, "Фирменная спортивная куртка", -5, 30 ],
  [ 5, 11, 286, 20, 14, -1, -1, -1, 90, "Коллекционная классическая футболка", 15, 50 ],
  //[ 5, 11, 292, 16, 3, -1, -1, -1, 125, "Фирменная толстовка", 5, 30 ],
  //[ 5, 11, 294, 22, 9, -1, -1, -1, 100, "Фирменный свитер", 10, 30 ],
  //[ 5, 11, 295, 14, 14, -1, -1, -1, 75, "Фирменная бейсбольная футболка", 15, 50 ],
  [ 5, 6, 5, 0, -1, -1, -1, -1, 10, "Сланцы", 25, 99 ],
  [ 5, 6, 10, 2, -1, -1, -1, -1, 55, "Кросовки", -10, 50 ],
  [ 5, 6, 16, 10, -1, -1, -1, -1, 10, "Сланцы", 25, 99 ],
  [ 5, 6, 17, -1, -1, -1, -1, -1, 40, "Ботинки Эльфа", -5, 50 ],
  [ 5, 6, 68, 0, -1, -1, -1, -1, 110, "Винтажные ботинки", -30, 30 ],
  [ 5, 6, 69, 0, -1, -1, -1, -1, 60, "Винтажные кросовки", -10, 50 ],
  [ 5, 6, 78, 0, -1, -1, -1, -1, 90, "ProLaps фирменный кеды", -10, 50 ],
  [ 5, 6, 79, 24, -1, -1, -1, -1, 150, "Беговые высокие кроссовки", -10, 50 ],
  [ 5, 6, 80, 24, -1, -1, -1, -1, 150, "Беговые низкие кроссовки", -10, 50 ],
  [ 5, 7, 9, -1, -1, -1, -1, -1, 35, "Нашейная бандана", -99, 99 ],
  [ 5, 7, 15, 3, -1, -1, -1, -1, 35, "Нашейная бандана", -99, 99 ],
  [ 5, 7, 17, 2, -1, -1, -1, -1, 55, "Новогодний шарф", -99, 99 ],
  [ 5, 7, 18, 2, -1, -1, -1, -1, 55, "Новогодний шарф (над)", -99, 99 ],
  [ 5, 7, 83, 1, -1, -1, -1, -1, 35, "Нашейная бандана", -99, 99 ],
  [ 5, 7, 84, -1, -1, -1, -1, -1, 20, "Индейская цепь", -99, 99 ],
  [ 5, 7, 93, 0, -1, -1, -1, -1, 20, "Индейская цепь", -99, 99 ],


  [9999, 11, 347, 7, 14, -1, -1, -1, 60, "Майки", 10, 40], // 481
  [9999, 11, 348, 2, 12, -1, -1, -1, 60, "Майки2", 10, 40], // 481
  [9999, 11, 349, 7, 4, -1, -1, -1, 60, "Майки3", 10, 40], // 481
  [9999, 11, 350, 1, 15, -1, -1, -1, 60, "Майки4", 10, 40], // 481
]

export const clothMutil = <clothItem[]>[
  [ 0, 4, 0, 14, -1, -1, -1, -1, 80, "Классические джинсы", -20, 35 ],
  [ 0, 4, 43, 0, -1, -1, -1, -1, 75, "Рабочие джинсы", -25, 30 ],
  [ 0, 4, 63, -1, -1, -1, -1, -1, 60, "Старые джинсы", -20, 35 ],
  [ 0, 4, 1, 14, -1, -1, -1, -1, 95, "Широкие джинсы", -20, 35 ],
  [ 0, 4, 3, 14, -1, -1, -1, -1, 35, "Домашние штаны", -5, 35 ],
  [ 0, 4, 29, 1, -1, -1, -1, -1, 80, "Патриот-Карго штаны", -25, 25 ],
  [ 0, 4, 47, 0, -1, -1, -1, -1, 20, "Рабочие-Карго штаны", -25, 25 ],
  [ 0, 4, 8, -1, -1, -1, -1, -1, 70, "Рабочие-Карго штаны", -30, 20 ],
  [ 0, 4, 9, 14, -1, -1, -1, -1, 80, "Рабочие-Карго штаны", -25, 25 ],
  [ 0, 4, 7, 14, -1, -1, -1, -1, 70, "Рабочие штаны", -25, 25 ],
  [ 0, 4, 27, 10, -1, -1, -1, -1, 70, "Рабочие-Карго штаны", -20, 30 ],
  [ 0, 4, 5, 14, -1, -1, -1, -1, 40, "Спортивные штаны", -10, 30 ],
  [ 0, 4, 55, 2, -1, -1, -1, -1, 40, "Спортивные штаны", -10, 30 ],
  [ 0, 4, 64, 9, -1, -1, -1, -1, 40, "Спортивные штаны", -10, 30 ],
  [ 0, 4, 98, 24, -1, -1, -1, -1, 100, "Фирменные-Карго штаны", -25, 25 ],
  [ 0, 4, 15, 14, -1, -1, -1, -1, 55, "Карго шорты", 20, 50 ],
  [ 0, 4, 100, 12, -1, -1, -1, -1, 125, "Заказные шаровары", -25, 30 ],
  [ 0, 4, 14, 0, -1, -1, -1, -1, 25, "Спортивные шорты", 25, 60 ],
  [ 0, 4, 18, 10, -1, -1, -1, -1, 20, "Спортивные шорты", 25, 60 ],
  [ 0, 4, 42, 6, -1, -1, -1, -1, 45, "Повседневные шорты", 15, 55 ],
  [ 0, 4, 62, 2, -1, -1, -1, -1, 30, "Рабочие шорты", 15, 55 ],
  [ 0, 4, 21, -1, -1, -1, -1, -1, 5, "Трусы", 25, 99 ],
  [ 0, 4, 61, 12, -1, -1, -1, -1, 5, "Трусы", 25, 99 ],
  [ 0, 11, 123, 1, 11, -1, -1, -1, 50, "Бейсбольное поло", 15, 50 ],
  [ 0, 11, 83, 3, 11, -1, -1, -1, 45, "Бейсбольная рубашка", 15, 50 ],
  [ 0, 11, 84, 4, 4, -1, -1, -1, 80, "Бейсбольный свитер", -5, 35 ],
  [ 0, 11, 81, 1, 11, -1, -1, -1, 35, "Бейсбольная футболка", 15, 50 ],
  [ 0, 11, 128, 8, 0, -1, -1, -1, 25, "Бейсбольная футболка", 15, 50 ],
  [ 0, 11, 164, 1, 11, -1, -1, -1, 35, "Бейсбольная футболка", 15, 50 ],
  [ 0, 11, 111, 4, 4, -1, -1, -1, 75, "Водолазка", -5, 30 ],
  [ 0, 11, 139, 6, 4, -1, -1, -1, 75, "Водолазка", -5, 30 ],
  [ 0, 11, 97, 0, -1, -1, -1, -1, 5, "Грязная футболка", 15, 50 ],
  [ 0, 11, 17, 4, 5, -1, -1, -1, 20, "Классическая майка", 20, 60 ],
  [ 0, 11, 36, 4, 5, -1, -1, -1, 20, "Классическая майка", 20, 60 ],
  [ 0, 11, 237, 24, 5, -1, -1, -1, 20, "Классическая майка", 20, 60 ],
  [ 0, 11, 1, 0, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  [ 0, 11, 16, 1, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  [ 0, 11, 22, 1, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  [ 0, 11, 33, -1, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  [ 0, 11, 34, 0, 0, -1, -1, -1, 10, "Классическая футболка", 15, 50 ],
  [ 0, 11, 44, 2, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  [ 0, 11, 146, 7, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  //[ 0, 11, 273, 20, 0, -1, -1, -1, 90, "Коллекционная классическая футболка", 15, 50 ],
  [ 0, 11, 14, 14, 1, -1, -1, -1, 30, "Кофта под рубашкой", 5, 35 ],
  [ 0, 11, 89, 2, 6, -1, -1, -1, 30, "Свитер", 5, 35 ],
  [ 0, 11, 238, 4, 5, -1, -1, -1, 15, "Старая майка", 20, 60 ],
  [ 0, 11, 169, 2, 4, -1, 0, 1, 105, "Джинсовая куртка", -10, 30 ],
  [ 0, 11, 170, 2, 5, -1, 0, 1, 75, "Джинсовый жилет", 15, 35 ],
  [ 0, 11, 87, 10, 4, -1, -1, -1, 130, "Закрытый бейсбольный бомбер", -10, 30 ],
  [ 0, 11, 88, 10, 4, -1, 0, 1, 130, "Открытый бейсбольный бомбер", 5, 35 ],
  [ 0, 11, 125, -1, 4, -1, -1, -1, 80, "Старая бейсбольная куртка", -20, 25 ],
  [ 0, 11, 126, 13, 4, -1, -1, -1, 45, "Закрытая винтажная рубашка", 10, 30 ],
  [ 0, 11, 127, 13, 4, -1, 0, 1, 45, "Открытая винтажная рубашка", 15, 35 ],
  [ 0, 11, 6, 0, 4, -1, 2, 1, 110, "Кожанная куртка", -10, 30 ],
  [ 0, 11, 37, 1, 4, -1, 2, 1, 30, "Кожанная куртка", -10, 30 ],
  [ 0, 11, 166, 4, 4, -1, 0, 1, 145, "Кожаная куртка", -10, 30 ],
  [ 0, 11, 157, 2, 15, -1, 0, 1, 80, "Кожаный жилет", 15, 35 ],
  [ 0, 11, 232, 8, 4, -1, 0, 1, 180, "Закрытая охотничья куртка", -15, 30 ],
  [ 0, 11, 233, 8, 4, -1, 0, 1, 180, "Открытая охотничья куртка", -5, 30 ],
  //[ 0, 11, 267, 3, 4, -1, 0, 1, 280, "Фирменная зак. охотничья куртка", -15, 30 ],
  //[ 0, 11, 267, 3, 4, -1, 0, 1, 280, "Фирменная отк. охотничья куртка", -5, 30 ],
  [ 0, 11, 3, 14, 1, -1, 38, 0, 80, "Открытая спортивная куртка", 5, 30 ],
  [ 0, 11, 141, 9, 6, -1, -1, -1, 80, "Спортивная куртка", -10, 30 ],
  [ 0, 11, 113, 2, 6, -1, -1, -1, 30, "Старая спортивная куртка", -10, 30 ],
  [ 0, 11, 7, 14, 4, -1, 0, 1, 90, "Спортивный толстовка", 5, 30 ],
  [ 0, 11, 86, 3, 4, -1, -1, -1, 30, "Спортивная толстовка", 5, 30 ],
  [ 0, 11, 249, 0, 6, -1, -1, -1, 70, "Старая бейсбольная куртка", 5, 30 ],
  [ 0, 11, 110, -1, 4, -1, -1, -1, 220, "Старая кожаная куртка", -20, 25 ],
  [ 0, 11, 138, 1, 4, -1, -1, -1, 180, "Старая кожаная куртка", -20, 25 ],
  [ 0, 11, 151, 4, 4, -1, 0, 1, 95, "Старая потёртая куртка", -10, 30 ],
  [ 0, 11, 156, 4, 4, -1, 0, 1, 95, "Старая потёртая куртка", -10, 30 ],
  //[ 0, 11, 264, 10, 4, -1, 0, 1, 95, "Старая потёртая куртка", -10, 30 ],
  [ 0, 11, 116, 1, 6, -1, 5, 1, 110, "Старая куртка санты", -5, 30 ],
  [ 0, 11, 115, -1, 4, -1, 75, 2, 155, "Старое пальто", -25, 25 ],
  [ 0, 11, 121, 10, 4, -1, -1, -1, 95, "Старая толстовка", 5, 30 ],
  [ 0, 11, 171, 0, 4, -1, -1, -1, 85, "Толстовка", 5, 30 ],
  //[ 0, 11, 279, 16, 4, -1, -1, -1, 125, "Фирменная толстовка", 5, 30 ],
  //[ 0, 11, 281, 22, 6, -1, -1, -1, 100, "Фирменный свитер", 10, 30 ],
  [ 0, 6, 5, 2, -1, -1, -1, -1, 10, "Сланцы", 25, 99 ],
  [ 0, 6, 16, 10, -1, -1, -1, -1, 10, "Модные сланцы", 25, 99 ],
  [ 0, 6, 6, 0, -1, -1, -1, -1, 5, "Тапочки с носками", 20, 99 ],
  [ 0, 6, 8, 14, -1, -1, -1, -1, 50, "Беговые кеды с носками", -10, 50 ],
  [ 0, 6, 46, 8, -1, -1, -1, -1, 60, "Старые спортивные кеды", -10, 50 ],
  [ 0, 6, 23, 14, -1, -1, -1, -1, 40, "Классические кеды", -10, 50 ],
  [ 0, 6, 64, 12, -1, -1, -1, -1, 80, "Старые фирменные кеды", -10, 50 ],
  [ 0, 6, 7, 14, -1, -1, -1, -1, 30, "Старые кросовки с носками", -10, 50 ],
  [ 0, 6, 9, 14, -1, -1, -1, -1, 65, "Кросовки с носками", -10, 50 ],
  [ 0, 6, 17, -1, -1, -1, -1, -1, 45, "Ботинки Эльфа", -5, 50 ],
  [ 0, 6, 35, 0, -1, -1, -1, -1, 50, "Высокие ботинки", -30, 30 ],
  [ 0, 6, 79, 0, -1, -1, -1, -1, 90, "Покрашенные высокие ботинки", -30, 30 ],
  [ 0, 6, 80, 0, -1, -1, -1, -1, 65, "Покрашенные низкие ботинки", -30, 30 ],
  [ 0, 6, 81, 1, -1, -1, -1, -1, 95, "Винтажные высокие ботинки", -30, 30 ],
  [ 0, 6, 82, 1, -1, -1, -1, -1, 70, "Винтажные низкие ботинки", -30, 30 ],
  [ 0, 7, 30, -1, -1, -1, -1, -1, 35, "Шарф", -99, 99 ],
  [ 0, 7, 31, -1, -1, -1, -1, -1, 35, "Шарф (над)", -99, 99 ],
  [ 0, 7, 112, 1, -1, -1, -1, -1, 35, "Нашейная бандана", -99, 99 ],
  [ 0, 7, 113, -1, -1, -1, -1, -1, 20, "Индейская цепь", -99, 99 ],
  [ 0, 7, 123, 0, -1, -1, -1, -1, 20, "Индейская цепь", -99, 99 ],

  [ 1, 4, 4, 1, -1, -1, -1, -1, 390, "Зауженные джинсы", -15, 40 ],
  [ 1, 4, 26, 10, -1, -1, -1, -1, 390, "Зауженные джинсы", -15, 40 ],
  [ 1, 4, 82, 8, -1, -1, -1, -1, 460, "Фирменные зауженные джинсы", -10, 40 ],
  [ 1, 4, 83, 2, -1, -1, -1, -1, 20, "Кожанные зауженные джинсы", -20, 40 ],
  [ 1, 4, 75, 6, -1, -1, -1, -1, 290, "Фирменные джинсы", -20, 35 ],
  [ 1, 4, 76, 6, -1, -1, -1, -1, 310, "Фирменные рваные джинсы", -5, 35 ],
  [ 1, 4, 105, 10, -1, -1, -1, -1, 390, "Джинсы на прошиве", -15, 35 ],
  [ 1, 4, 32, 2, -1, -1, -1, -1, 225, "Новогодние легенсы", -1, 40 ],
  [ 1, 4, 45, 5, -1, -1, -1, -1, 180, "Пижамные штаны", 5, 35 ],
  [ 1, 4, 58, 14, -1, -1, -1, -1, 180, "Пижамные штаны", 5, 35 ],
  [ 1, 4, 65, 12, -1, -1, -1, -1, 180, "Пижамные штаны", 5, 35 ],
  [ 1, 4, 69, 16, -1, -1, -1, -1, 230, "Фирменные-Карго штаны", -20, 30 ],
  [ 1, 4, 71, 4, -1, -1, -1, -1, 370, "Кожанные штаны", -20, 30 ],
  [ 1, 4, 73, 4, -1, -1, -1, -1, 370, "Кожанные штаны", -20, 30 ],
  [ 1, 4, 6, 1, -1, -1, -1, -1, 145, "Пляжные шорты", 15, 60 ],
  [ 1, 4, 16, 10, -1, -1, -1, -1, 145, "Пляжные шорты", 15, 60 ],
  [ 1, 4, 54, 5, -1, -1, -1, -1, 245, "Заказные пляжные шорты", 15, 60 ],
  [ 1, 4, 12, -1, -1, -1, -1, -1, 210, "Стильные шорты", 15, 60 ],
  [ 1, 4, 17, 9, -1, -1, -1, -1, 210, "Стильные шорты", 15, 60 ],
  [ 1, 4, 78, 6, -1, -1, -1, -1, 380, "Фирменные спортивные штаны", -10, 35 ],
  [ 1, 4, 79, 1, -1, -1, -1, -1, 410, "Кожанные спортивные штаны", -10, 35 ],
  [ 1, 4, 80, 6, -1, -1, -1, -1, 250, "Фирменные спортивные шорты", 10, 50 ],
  [ 1, 4, 81, 1, -1, -1, -1, -1, 280, "Кожанные спортивные шорты", 10, 50 ],
//[ 1, 11, 9, 6, 11, -1, -1, -1, 220, "Рубашка поло", 15, 50 ],
//[ 1, 11, 39, 0, 11, -1, -1, -1, 220, "Рубашка поло", 15, 50 ],
  [ 1, 11, 82, 14, 11, -1, -1, -1, 220, "Рубашка поло", 15, 50 ],
  [ 1, 11, 93, 1, 0, -1, -1, -1, 250, "Спортивное поло", 15, 50 ],
  [ 1, 11, 94, 1, 0, -1, -1, -1, 250, "Заправленное спортивное поло", 15, 50 ],
  [ 1, 11, 18, 2, 0, -1, -1, -1, 140, "Новогодняя футболка", 15, 50 ],
  [ 1, 11, 8, -1, 8, -1, -1, -1, 270, "Задранный джемпер", 10, 40 ],
  [ 1, 11, 38, 3, 8, -1, -1, -1, 270, "Задранный джемпер", 10, 40 ],
  [ 1, 11, 50, 3, 4, -1, -1, -1, 390, "Свитер с накладками", -5, 30 ],
  [ 1, 11, 51, 1, 4, -1, -1, -1, 320, "Новогодний свитер", 10, 30 ],
  [ 1, 11, 52, 2, 4, -1, -1, -1, 320, "Новогодний свитер", 10, 30 ],
  [ 1, 11, 53, 2, 4, -1, -1, -1, 380, "Заправленный свитер", -5, 30 ],
  [ 1, 11, 71, -1, 0, -1, -1, -1, 620, "Заказная футболка", 15, 50 ],
  [ 1, 11, 73, 17, 0, -1, -1, -1, 320, "Заказная футболка", 15, 50 ],
  [ 1, 11, 78, 14, 6, -1, -1, -1, 390, "Заказной свитер", 10, 30 ],
  [ 1, 11, 80, 1, 11, -1, -1, -1, 20, "Стильная футболка", 15, 50 ],
  [ 1, 11, 92, 5, 6, -1, -1, -1, 150, "Пижамная рубашка", 10, 35 ],
  [ 1, 11, 144, 12, 6, -1, -1, -1, 150, "Пижамная рубашка", 10, 35 ],
  [ 1, 11, 117, 14, 6, -1, -1, -1, 150, "Новогодняя пижамная рубашка", 10, 35 ],
  [ 1, 11, 105, -1, 5, -1, -1, -1, 85, "Гавайская рубашка", 15, 40 ],
  [ 1, 11, 107, 3, 4, -1, -1, -1, 20, "Китайская рубашка", -5, 35 ],
  [ 1, 11, 61, 2, 4, -1, -1, -1, 490, "Мото-Куртка", -15, 30 ],
  [ 1, 11, 62, -1, 4, -1, 0, 1, 490, "Открытая Мото-Куртка", -1, 30 ],
  [ 1, 11, 64, -1, 4, -1, 2, 1, 490, "Мото-Куртка", -5, 30 ],
  [ 1, 11, 118, 8, 4, -1, 0, 1, 490, "Мото-Куртка", -5, 30 ],
  [ 1, 11, 155, 2, 14, -1, -1, -1, 270, "Шоу-Куртка", 10, 35 ],
  [ 1, 11, 148, 10, 4, -1, -1, -1, 245, "Мото-Кофта", -5, 30 ],
  [ 1, 11, 152, 14, 4, -1, -1, -1, 265, "Мото-Свитер", 10, 35 ],
  [ 1, 11, 147, 8, 4, -1, -1, -1, 295, "Мото-Жилет", -5, 30 ],
  [ 1, 11, 158, 1, 15, -1, -1, -1, 310, "Мото-Жилет", 15, 35 ],
  [ 1, 11, 165, 5, 6, -1, -1, -1, 310, "Мото-Жилет со свитером", -5, 30 ],
  [ 1, 11, 177, 5, 15, -1, -1, -1, 310, "Мото-Жилет", 15, 30 ],
  [ 1, 11, 69, 4, 4, -1, 2, 1, 420, "Куртка с капюшоном", -10, 30 ],
  [ 1, 11, 74, 9, 4, -1, 0, 1, 565, "Открытый заказной бомбер", -1, 35 ],
  [ 1, 11, 75, 9, 4, -1, -1, -1, 565, "Закрытый заказной бомбер", -5, 35 ],
  [ 1, 11, 79, -1, 4, -1, -1, -1, 510, "Бомбер Wolf", -5, 35 ],
  [ 1, 11, 106, -1, 4, -1, 0, 1, 20, "Куртка на пуговицах", -20, 25 ],
  [ 1, 11, 134, 1, 4, -1, -1, -1, 310, "Фирменная толстовка", 5, 35 ],
  [ 1, 11, 135, 5, 5, -1, -1, -1, 85, "Гавайская рубашка", 15, 45 ],
  [ 1, 11, 143, 8, 4, -1, -1, -1, 410, "Кожаный бомбер", 5, 35 ],
  [ 1, 11, 149, 8, 14, -1, -1, -1, 270, "Шоу-Куртка", 10, 35 ],
  [ 1, 11, 150, 10, 4, -1, -1, -1, 385, "Заказная спортивная куртка", -10, 35 ],
  [ 1, 11, 153, 24, 6, -1, -1, -1, 385, "Заказная спортивная куртка", -10, 35 ],
  [ 1, 11, 154, 6, 6, -1, -1, -1, 425, "Фирменная спортивная куртка", -10, 35 ],
  [ 1, 11, 167, 14, 4, -1, 0, 1, 590, "Пуховик", -25, 25 ],
  [ 1, 11, 168, 1, 4, -1, 2, 1, 425, "Кожаное худи", -10, 30 ],
  [ 1, 11, 184, 2, 4, -1, -1, -1, 650, "Заказная закрытая парка", -20, 25 ],
  [ 1, 11, 185, 2, 4, -1, 0, 1, 650, "Заказная открытая парка", -5, 30 ],
  [ 1, 11, 187, 11, 4, -1, 2, 1, 515, "Длинное худи", -15, 35 ],
  [ 1, 11, 188, 9, 4, -1, -1, -1, 610, "Закрытая парка", -20, 25 ],
  [ 1, 11, 189, 9, 4, -1, 0, 1, 610, "Открытая парка", -5, 30 ],
  [ 1, 11, 190, 24, 6, -1, -1, -1, 370, "Заказной свитер", 10, 30 ],
  [ 1, 11, 191, 24, 4, -1, 0, 1, 590, "Заказной пуховик", -25, 25 ],
  [ 1, 11, 192, 10, 4, -1, 75, 2, 790, "Заказное пальто", -25, 25 ],
  [ 1, 11, 193, 24, 11, -1, -1, -1, 320, "Заказная футболка", 15, 50 ],
  [ 1, 11, 194, 1, 6, -1, -1, -1, 620, "Новогодний неоновый свитер", 10, 30 ],
  [ 1, 11, 195, 1, 6, -1, -1, -1, 320, "Новогодний свитер", 10, 30 ],
  [ 1, 11, 196, 14, 6, -1, -1, -1, 620, "Рождественский неоновый свитер", 10, 30 ],
  [ 1, 11, 197, 14, 6, -1, -1, -1, 320, "Рождественский свитер", 10, 30 ],
  [ 1, 11, 198, 6, 6, -1, -1, -1, 590, "Новогодняя неоновая теп. кофта", -5, 25 ],
  [ 1, 11, 199, 6, 6, -1, -1, -1, 290, "Новогодняя теплая кофта", -5, 25 ],
  [ 1, 11, 200, 24, 4, -1, -1, -1, 310, "Заказное худи", 5, 30 ],
  [ 1, 11, 205, 3, 5, -1, -1, -1, 250, "Жилет с капюшоном", 15, 35 ],
  [ 1, 11, 217, 13, 4, -1, -1, -1, 445, "Заказная куртка", -25, 25 ],
  [ 1, 11, 223, 14, 2, -1, -1, -1, 330, "Фирменный тёплый жилет", 10, 30 ],
  [ 1, 11, 224, 14, 11, -1, -1, -1, 460, "Фирменная тёплая куртка", -20, 30 ],
  [ 1, 11, 225, 0, 8, -1, -1, -1, 270, "Коллекционный задранный джемпер", 10, 40 ],
  [ 1, 11, 227, 12, 4, -1, -1, -1, 315, "Фирменный жилет", -5, 30 ],
  [ 1, 11, 229, 10, 4, -1, -1, -1, 425, "Закрытый бомбер", -10, 30 ],
  [ 1, 11, 230, 10, 4, -1, 0, 1, 425, "Открытый бомбер", -5, 35 ],
  [ 1, 11, 235, 10, 0, -1, -1, -1, 250, "Фирменное поло", 15, 50 ],
  [ 1, 11, 236, 10, 0, -1, -1, -1, 250, "Заправленное фирменное поло", 15, 50 ],
  [ 1, 11, 241, 4, 0, -1, -1, -1, 270, "Заказное поло", 15, 50 ],
  [ 1, 11, 242, 4, 0, -1, -1, -1, 270, "Заправленное заказное поло", 15, 50 ],
  [ 1, 11, 244, 24, 4, -1, 2, 1, 710, "Модная куртка с карманами", -25, 30 ],
  [ 1, 11, 245, 8, 4, -1, -1, -1, 220, "Новогодний свитер", 10, 30 ],
  [ 1, 11, 247, 24, 5, -1, -1, -1, 320, "Модный жилет с карманами", 10, 35 ],
  [ 1, 11, 248, 24, 14, -1, -1, -1, 740, "Плотная куртка с карманами", -25, 30 ],
  [ 1, 11, 251, 24, 4, -1, -1, -1, 880, "Анорак", -25, 30 ],
  [ 1, 11, 255, 24, 4, -1, -1, -1, 370, "Эксклюзивный свитер Bigness", 10, 30 ],
  //[ 1, 11, 256, 14, 4, -1, -1, -1, 495, "Фирменный закрытый бомбер", -10, 30 ],
  //[ 1, 11, 261, 14, 4, -1, 0, 1, 495, "Фирменный открытый бомбер", -5, 35 ],
  //[ 1, 11, 265, 14, 4, -1, -1, -1, 515, "Модный закрытый бомбер", -10, 30 ],
  //[ 1, 11, 266, 14, 4, -1, 0, 1, 515, "Модный открытый бомбер", -5, 35 ],
  //[ 1, 11, 258, 13, 6, -1, -1, -1, 550, "Тёплая кофта", -5, 25 ],
  //[ 1, 11, 259, 24, 4, -1, -1, -1, 390, "Эксклюзивный свитер", 10, 30 ],
  //[ 1, 11, 262, 14, 4, -1, -1, -1, 390, "Эксклюзивная толстовка", 5, 35 ],
  //[ 1, 11, 269, 14, 4, -1, 0, 1, 590, "Модный пуховик", -25, 25 ],
  //[ 1, 11, 271, 19, 0, -1, -1, -1, 170, "Модная классическая футболка", 15, 50 ],
  //[ 1, 11, 288, 12, 6, -1, -1, -1, 350, "Неоновый фир. новогодний свитер", 10, 30 ],
  [ 1, 6, 1, 14, -1, -1, -1, -1, 220, "Скейтерские кеды", -10, 50 ],
  [ 1, 6, 4, 1, -1, -1, -1, -1, 250, "Высокие кеды", -10, 50 ],
  [ 1, 6, 12, 14, -1, -1, -1, -1, 320, "Заказные ботинки", -30, 30 ],
  [ 1, 6, 14, 14, -1, -1, -1, -1, 225, "Винтажные ботинки", -30, 30 ],
  [ 1, 6, 22, 10, -1, -1, -1, -1, 270, "Заказные высокие кеды", -10, 50 ],
  [ 1, 6, 26, 14, -1, -1, -1, -1, 230, "Платформенные кеды", -10, 50 ],
  [ 1, 6, 28, 4, -1, -1, -1, -1, 290, "Модные кеды", -10, 50 ],
  [ 1, 6, 29, -1, -1, -1, -1, -1, 750, "Золотые кеды", -10, 50 ],
  [ 1, 6, 31, 3, -1, -1, -1, -1, 345, "Заказные кросовки", -10, 50 ],
  [ 1, 6, 32, 14, -1, -1, -1, -1, 375, "Высокие кросовки", -10, 50 ],
  [ 1, 6, 42, 8, -1, -1, -1, -1, 190, "Модные низкие кеды", -10, 50 ],
  [ 1, 6, 43, 6, -1, -1, -1, -1, 325, "Заказные ботинки на шнурках", -30, 30 ],
  [ 1, 6, 48, 0, -1, -1, -1, -1, 230, "Платформенные кеды", -10, 50 ],
  [ 1, 6, 49, 0, -1, -1, -1, -1, 230, "Платформенные кеды", -10, 50 ],
  [ 1, 6, 55, 8, -1, -1, -1, -1, 640, "Неоновые кеды", -10, 50 ],
  [ 1, 6, 57, 10, -1, -1, -1, -1, 390, "Фирменные кеды", -10, 50 ],
  [ 1, 6, 70, 24, -1, -1, -1, -1, 415, "Фирменные сапоги", -35, 30 ],
  [ 1, 6, 71, 24, -1, -1, -1, -1, 345, "Фирменные ботинки", -30, 30 ],
  [ 1, 6, 72, 24, -1, -1, -1, -1, 400, "Фирменные высокие кроссовки", -30, 30 ],
  [ 1, 6, 73, 24, -1, -1, -1, -1, 330, "Фирменные кроссовки", -10, 50 ],
  [ 1, 6, 77, 24, -1, -1, -1, -1, 440, "Светодиодные кроссовки", -10, 50 ],

  [ 2, 4, 10, 1, -1, -1, -1, -1, 990, "Широкие брюки", -15, 40 ],
  [ 2, 4, 13, 1, -1, -1, -1, -1, 1090, "Широкие брюки", -15, 40 ],
  [ 2, 4, 19, 0, -1, -1, -1, -1, 1090, "Широкие брюки", -15, 40 ],
  [ 2, 4, 20, 2, -1, -1, -1, -1, 990, "Широкие брюки", -15, 40 ],
  [ 2, 4, 22, 11, -1, -1, -1, -1, 990, "Широкие брюки", -15, 40 ],
  [ 2, 4, 23, 11, -1, -1, -1, -1, 1090, "Широкие брюки", -15, 40 ],
  [ 2, 4, 24, 5, -1, -1, -1, -1, 1290, "Зауженные брюки", -10, 40 ],
  [ 2, 4, 25, 5, -1, -1, -1, -1, 990, "Широкие брюки", -15, 40 ],
  [ 2, 4, 28, 14, -1, -1, -1, -1, 1290, "Зауженные брюки", -10, 40 ],
  [ 2, 4, 35, -1, -1, -1, -1, -1, 990, "Широкие брюки", -15, 40 ],
  [ 2, 4, 37, 2, -1, -1, -1, -1, 650, "Мятые брюки", -15, 40 ],
  [ 2, 4, 48, 2, -1, -1, -1, -1, 990, "Широкие брюки", -15, 40 ],
  [ 2, 4, 49, 3, -1, -1, -1, -1, 1290, "Зауженные брюки", -10, 40 ],
  [ 2, 4, 50, 2, -1, -1, -1, -1, 990, "Широкие брюки", -15, 40 ],
  [ 2, 4, 51, -1, -1, -1, -1, -1, 2990, "Заказные широкие брюки", -15, 40 ],
  [ 2, 4, 52, 2, -1, -1, -1, -1, 1290, "Зауженные брюки", -10, 50 ],
  [ 2, 4, 53, -1, -1, -1, -1, -1, 3290, "Заказные зауженные брюки", -10, 40 ],
  [ 2, 4, 60, 10, -1, -1, -1, -1, 990, "Широкие брюки", -15, 40 ],
  [ 2, 4, 96, 0, -1, -1, -1, 1, 990, "Широкие брюки", -15, 40 ],
  [ 2, 11, 11, 0, 11, -1, 6, 8, 990, "Жилет с задраной рубашкой", 10, 45 ],
  [ 2, 11, 21, 2, 11, -1, 6, 8, 990, "Жилет с задраной рубашкой", 10, 40 ],
  [ 2, 11, 25, 8, 11, -1, 6, 8, 990, "Жилет с задраной рубашкой", 10, 40 ],
  [ 2, 11, 120, 10, 11, -1, 6, 8, 990, "Жилет с задраной рубашкой", 10, 40 ],
  [ 2, 11, 45, 1, 11, -1, 50, 0, 1190, "Патриотичный жилет", 10, 40 ],
  [ 2, 11, 11, 0, 4, -1, 22, 3, 990, "Жилет с рубашкой", 10, 45 ],
  [ 2, 11, 21, 2, 4, -1, 22, 3, 990, "Жилет с рубашкой", 10, 40 ],
  [ 2, 11, 25, 8, 4, -1, 22, 3, 990, "Жилет с рубашкой", 10, 40 ],
  [ 2, 11, 120, 10, 4, -1, 22, 3, 990, "Жилет с рубашкой", 10, 40 ],
  [ 2, 11, 12, -1, 12, -1, -1, -1, 1190, "Расправленная рубашка", 10, 45 ],
  [ 2, 11, 13, 2, 11, -1, -1, -1, 1190, "Заправленная рубашка", 10, 45 ],
  [ 2, 11, 26, 8, 11, -1, -1, -1, 1190, "Заправленная рубашка", 10, 45 ],
  [ 2, 11, 41, 2, 12, -1, -1, -1, 1190, "Расправленная рубашка", 10, 45 ],
  [ 2, 11, 4, -1, 4, -1, 21, 3, 1990, "Открытый пиджак", -5, 35 ],
  [ 2, 11, 10, 1, 4, -1, 21, 3, 1990, "Закрытый пиджак", -5, 35 ],
  [ 2, 11, 19, 0, 1, -1, 20, 1, 2390, "Новогодний пиджак", -5, 35 ],
  [ 2, 11, 20, 2, 4, -1, 21, 3, 3990, "Стильный пиджак", -5, 35 ],
  [ 2, 11, 23, 2, 4, -1, 21, 3, 1990, "Открытый пиджак", -5, 35 ],
  [ 2, 11, 24, 11, 4, -1, 21, 3, 1990, "Закрытый пиджак", -5, 35 ],
  [ 2, 11, 27, 1, 4, -1, 21, 3, 1990, "Закрытый пиджак", -5, 35 ],
  [ 2, 11, 28, 1, 4, -1, 21, 3, 1990, "Закрытый пиджак", -5, 35 ],
  [ 2, 11, 29, 6, 4, -1, 31, 1, 1990, "Открытый пиджак", -5, 35 ],
  [ 2, 11, 30, 6, 4, -1, 31, 1, 1990, "Закрытый пиджак", -5, 35 ],
  [ 2, 11, 95, 1, 11, -1, -1, -1, 1190, "Задранная рубашка", 10, 45 ],
  [ 2, 11, 234, 24, 11, -1, -1, -1, 1490, "Заказная задранная рубашка", 10, 45 ],
  //[ 2, 11, 260, 24, 11, -1, -1, -1, 1590, "Эксклюзивная задранная рубашка", 10, 45 ],
  [ 2, 11, 31, 6, 4, -1, 31, 1, 1990, "Приталенный открытый пиджак", -5, 35 ],
  [ 2, 11, 32, 6, 4, -1, 31, 1, 1990, "Приталенный закрытый пиджак", -5, 35 ],
  [ 2, 11, 35, 5, 4, -1, 21, 3, 1990, "Открытый пиджак", -5, 35 ],
  [ 2, 11, 46, 1, 4, -1, 21, 3, 2490, "Патриотичный фрак", -5, 35 ],
  [ 2, 11, 58, -1, 1, -1, 63, 1, 2490, "Фрак", -5, 35 ],
  [ 2, 11, 59, 2, 1, -1, 63, 1, 990, "Мятый открытый пиджак", -5, 35 ],
  [ 2, 11, 60, 2, 0, -1, 64, 1, 990, "Мятый задранный пиджак", -5, 35 ],
  [ 2, 11, 99, 3, 4, -1, 31, 1, 1990, "Приталенный открытый пиджак", -5, 35 ],
  [ 2, 11, 100, 3, 4, -1, 31, 1, 1990, "Приталенный закрытый пиджак", -5, 35 ],
  [ 2, 11, 101, 2, 4, -1, 31, 1, 2990, "Кожаный открытый пиджак", -5, 35 ],
  [ 2, 11, 102, 2, 4, -1, 31, 1, 2990, "Кожаный закрытый пиджак", -5, 35 ],
  [ 2, 11, 103, -1, 4, -1, 31, 1, 3590, "Заказной открытый пиджак", -5, 35 ],
  [ 2, 11, 104, -1, 4, -1, 31, 1, 3590, "Заказной закрытый пиджак", -5, 35 ],
  [ 2, 11, 108, 9, 4, -1, 31, 1, 2690, "Раритетный пиджак", -5, 35 ],
  [ 2, 11, 119, 10, 4, -1, 21, 3, 2490, "Пиджак на пуговицах", -5, 35 ],
  [ 2, 11, 145, 12, 4, -1, 31, 1, 2690, "Раритетный пиджак", -5, 35 ],
  [ 2, 11, 183, 4, 4, -1, 31, 1, 2250, "Праздничный пиджак", -5, 35 ],
  [ 2, 11, 70, 10, 1, -1, 12, 1, 5990, "Кожаная куртка с мехом", -30, 25 ],
  [ 2, 11, 240, 4, 1, -1, 12, 1, 5990, "Кожаная куртка с мехом", -30, 25 ],
  [ 2, 11, 140, 13, 4, -1, 31, 1, 4490, "Пиджачное пальто на пуговицах", -15, 35 ],
  [ 2, 11, 72, 2, 1, -1, 12, 1, 4790, "Пальто", -25, 25 ],
  [ 2, 11, 76, 3, 4, -1, 71, 2, 5490, "Пальто на пуговицах", -25, 25 ],
  [ 2, 11, 77, 2, 1, -1, 12, 1, 6190, "Открытое пальто", -25, 25 ],
  [ 2, 11, 142, 1, 4, -1, 31, 10, 3390, "Открытое пальто", -20, 30 ],
  [ 2, 11, 136, 5, 4, -1, 0, 1, 1690, "Фирменная куртка", -15, 30 ],
  [ 2, 6, 10, -1, -1, -1, -1, -1, 790, "Туфли с носками", -15, 45 ],
  [ 2, 6, 15, 14, -1, -1, -1, -1, 1990, "Кожаные ботинки", -30, 30 ],
  [ 2, 6, 18, 0, -1, -1, -1, -1, 790, "Заказные туфли с носками", -15, 45 ],
  [ 2, 6, 19, -1, -1, -1, -1, -1, 840, "Высокие туфли", -15, 45 ],
  [ 2, 6, 20, 10, -1, -1, -1, -1, 790, "Кожаные туфли с носками", -15, 45 ],
  [ 2, 6, 21, 10, -1, -1, -1, -1, 760, "Кожаные туфли", -15, 45 ],
  [ 2, 6, 30, 0, -1, -1, -1, -1, 490, "Винтажные макасины", 10, 45 ],
  [ 2, 6, 36, 2, -1, -1, -1, -1, 490, "Винтажные макасины", 10, 45 ],
  [ 2, 6, 37, 3, -1, -1, -1, -1, 1090, "Ковбойские ботинки", -25, 30 ],
  [ 2, 6, 38, 3, -1, -1, -1, -1, 890, "Ковбойские туфли", -15, 40 ],
  [ 2, 6, 40, 10, -1, -1, -1, -1, 790, "Кожаные туфли с носками", -15, 45 ],
  [ 2, 6, 44, 9, -1, -1, -1, -1, 1090, "Ковбойские ботинки", -25, 30 ],
  [ 2, 6, 45, 9, -1, -1, -1, -1, 890, "Ковбойские туфли", -15, 40 ],
  [ 2, 6, 50, 4, -1, -1, -1, -1, 1290, "Кожаные сапоги", -25, 25 ],
  [ 2, 6, 51, 4, -1, -1, -1, -1, 1050, "Кожаные ботинки", -20, 30 ],
  [ 2, 6, 52, 0, -1, -1, -1, -1, 620, "Зимние ботикнки", -30, 20 ],
  [ 2, 6, 56, 0, -1, -1, -1, -1, 510, "Низкие зимние ботинки", -25, 25 ],
  [ 2, 6, 88, 10, -1, -1, -1, -1, 820, "Меховые сапоги", -30, 20 ],
  [ 2, 7, 10, 1, -1, -1, -1, -1, 220, "Широкий галстук", -99, 99 ],
  [ 2, 7, 12, 1, -1, -1, -1, -1, 195, "Тонкий галстук", -99, 99 ],
  [ 2, 7, 18, -1, -1, -1, -1, -1, 220, "Широкий галстук", -99, 99 ],
  [ 2, 7, 19, -1, -1, -1, -1, -1, 195, "Тонкий галстук", -99, 99 ],
  [ 2, 7, 20, 3, -1, -1, -1, -1, 220, "Широкий галстук (под)", -99, 99 ],
  [ 2, 7, 21, 11, -1, -1, -1, -1, 220, "Широкий галстук", -99, 99 ],
  [ 2, 7, 22, 13, -1, -1, -1, -1, 170, "Бабочка", -99, 99 ],
  [ 2, 7, 23, 11, -1, -1, -1, -1, 195, "Тонкий галстук", -99, 99 ],
  [ 2, 7, 24, 14, -1, -1, -1, -1, 220, "Широкий галстук (под)", -99, 99 ],
  [ 2, 7, 25, 14, -1, -1, -1, -1, 195, "Тонкий галстук (под)", -99, 99 ],
  [ 2, 7, 26, 14, -1, -1, -1, -1, 220, "Широкий галстук (под)", -99, 99 ],
  [ 2, 7, 27, 14, -1, -1, -1, -1, 195, "Тонкий галстук (под)", -99, 99 ],
  [ 2, 7, 28, 14, -1, -1, -1, -1, 220, "Широкий галстук", -99, 99 ],
  [ 2, 7, 29, 14, -1, -1, -1, -1, 195, "Тонкий галстук", -99, 99 ],
  [ 2, 7, 32, 1, -1, -1, -1, -1, 180, "Патриотичная бабочка", -99, 99 ],
  [ 2, 7, 36, -1, -1, -1, -1, -1, 170, "Свободная бабочка", -99, 99 ],
  [ 2, 7, 37, 14, -1, -1, -1, -1, 195, "Свободный галстук", -99, 99 ],
  [ 2, 7, 38, 14, -1, -1, -1, -1, 220, "Толстый галстук (над)", -99, 99 ],
  [ 2, 7, 39, 14, -1, -1, -1, -1, 195, "Очень свободный галстук", -99, 99 ],
  [ 2, 7, 116, 8, -1, -1, -1, -1, 195, "Тонкий галстук (под)", -99, 99 ],
  [ 2, 7, 117, 8, -1, -1, -1, -1, 195, "Тонкий галстук", -99, 99 ],
  [ 2, 7, 118, -1, -1, -1, -1, -1, 170, "Бабочка", -99, 99 ],

  [ 3, 4, 86, 22, -1, -1, -1, -1, 100, "Камуфляжные-Карго штаны", -25, 25 ],
  [ 3, 4, 88, 22, -1, -1, -1, -1, 70, "Камуфляжные-Карго шорты", 10, 65 ],
  [ 3, 4, 102, 16, -1, -1, -1, -1, 150, "Камуфляжные штаны", -25, 25 ],
  [ 3, 4, 102, 16, -1, -1, -1, -1, 110, "Камуфляжные шорты", -25, 25 ],
  [ 3, 11, 239, 22, 5, -1, -1, -1, 35, "Камуфляжная старая майка", 20, 60 ],
  [ 3, 11, 219, 24, 2, -1, -1, -1, 60, "Старая камуфляжная жилетка", 10, 40 ],
  [ 3, 11, 215, 22, 4, -1, 0, 1, 125, "Камуфляжная джинсовая куртка", -10, 30 ],
  [ 3, 11, 216, 22, 5, -1, 0, 1, 95, "Камуфляжный джинсовый жилет", 15, 35 ],
  [ 3, 11, 220, 24, 4, -1, -1, -1, 110, "Камуфляжная кофтка с карманами", -5, 30 ],
  [ 3, 11, 221, 24, 4, -1, -1, -1, 175, "Камуфляжная куртка с карманами", -20, 25 ],
  [ 3, 11, 222, 24, 11, -1, -1, -1, 175, "Камуфляжная рубашка с карманами", 10, 30 ],
  [ 3, 11, 206, 22, 5, -1, -1, -1, 275, "Камуфляжный жилет с капюшоном", 10, 35 ],
  [ 3, 11, 208, 22, 0, -1, -1, -1, 135, "Камуфляжная футболка", 15, 50 ],
  [ 3, 11, 209, 22, 4, -1, -1, -1, 465, "Камуфялжная заказная куртка", -20, 30 ],
  [ 3, 11, 210, 22, 4, -1, -1, -1, 675, "Камуфляжная закрытая парка", -25, 25 ],
  [ 3, 11, 212, 22, 4, -1, 0, 1, 675, "Камуфляжная открытая парка", -5, 30 ],
  [ 3, 11, 213, 22, 5, -1, -1, -1, 325, "Камуфляжный Мото-Жилет", 10, 35 ],
  [ 3, 11, 214, 22, 4, -1, -1, -1, 325, "Камуфляжная Мото-Кофта", -5, 30 ],
  [ 3, 6, 53, 4, -1, -1, -1, -1, 190, "Охотничьи сапоги", -30, 25 ],
  [ 3, 6, 54, 4, -1, -1, -1, -1, 170, "Охотничьи ботинки", -25, 30 ],
  [ 3, 6, 59, 24, -1, -1, -1, -1, 115, "Камфуляжные кросовки", -10, 50 ],
  [ 3, 6, 60, 6, -1, -1, -1, -1, 210, "Камуфляжные сапоги", -30, 25 ],
  [ 3, 6, 61, 6, -1, -1, -1, -1, 170, "Камуфляжные ботинки", -25, 30 ],
  [ 3, 6, 62, 6, -1, -1, -1, -1, 195, "Камуфляжные высокие кросовки", -30, 25 ],
  [ 3, 6, 63, 6, -1, -1, -1, -1, 155, "Камуфляжные низкие кросовки", -10, 50 ],

  [ 4, 7, 16, 1, -1, -1, -1, -1, 450, "Цепь", -99, 99 ],
  [ 4, 7, 17, 1, -1, -1, -1, -1, 450, "Цепь (над)", -99, 99 ],
  [ 4, 7, 42, 0, -1, -1, -1, -1, 1200, "Цепь SN", -99, 99 ],
  [ 4, 7, 43, 0, -1, -1, -1, -1, 1350, "Цепь Череп", -99, 99 ],
  [ 4, 7, 44, -1, -1, -1, -1, -1, 1300, "Цепь Маска", -99, 99 ],
  [ 4, 7, 45, 0, -1, -1, -1, -1, 1450, "Цепь ZORSE", -99, 99 ],
  [ 4, 7, 46, 0, -1, -1, -1, -1, 1550, "Цепь LC", -99, 99 ],
  [ 4, 7, 47, 0, -1, -1, -1, -1, 1500, "Цепь Dix", -99, 99 ],
  [ 4, 7, 48, 0, -1, -1, -1, -1, 1400, "Цепь Le Chen", -99, 99 ],
  [ 4, 7, 49, 0, -1, -1, -1, -1, 1200, "Цепь SN (над)", -99, 99 ],
  [ 4, 7, 50, 0, -1, -1, -1, -1, 1350, "Цепь Череп (над)", -99, 99 ],
  [ 4, 7, 51, -1, -1, -1, -1, -1, 1300, "Цепь Маска (над)", -99, 99 ],
  [ 4, 7, 52, 0, -1, -1, -1, -1, 1450, "Цепь ZORSE (над)", -99, 99 ],
  [ 4, 7, 53, 0, -1, -1, -1, -1, 1550, "Цепь LC (над)", -99, 99 ],
  [ 4, 7, 54, 0, -1, -1, -1, -1, 1500, "Цепь Dix (над)", -99, 99 ],
  [ 4, 7, 55, 0, -1, -1, -1, -1, 1400, "Цепь Le Chen (над)", -99, 99 ],
  [ 4, 7, 74, 0, -1, -1, -1, -1, 450, "Тонкая цепь", -99, 99 ],
  [ 4, 7, 75, 0, -1, -1, -1, -1, 475, "Толстая цепь", -99, 99 ],
  [ 4, 7, 76, 0, -1, -1, -1, -1, 500, "Плотная цепь", -99, 99 ],
  [ 4, 7, 77, 0, -1, -1, -1, -1, 580, "Ребристая цепь", -99, 99 ],
  [ 4, 7, 78, 0, -1, -1, -1, -1, 540, "Наружная цепь", -99, 99 ],
  [ 4, 7, 79, 0, -1, -1, -1, -1, 560, "Клёсткая цепь", -99, 99 ],
  [ 4, 7, 80, 0, -1, -1, -1, -1, 890, "Винтажная цепь", -99, 99 ],
  [ 4, 7, 81, 0, -1, -1, -1, -1, 320, "Лёгкая цепь", -99, 99 ],
  [ 4, 7, 82, 0, -1, -1, -1, -1, 350, "Сплошная цепь", -99, 99 ],
  [ 4, 7, 83, 0, -1, -1, -1, -1, 345, "Тряпичная цепь", -99, 99 ],
  [ 4, 7, 85, 0, -1, -1, -1, -1, 450, "Тонкая цепь (над)", -99, 99 ],
  [ 4, 7, 86, 0, -1, -1, -1, -1, 475, "Толстая цепь (над)", -99, 99 ],
  [ 4, 7, 87, 0, -1, -1, -1, -1, 500, "Плотная цепь (над)", -99, 99 ],
  [ 4, 7, 88, 0, -1, -1, -1, -1, 580, "Ребристая цепь (над)", -99, 99 ],
  [ 4, 7, 89, 0, -1, -1, -1, -1, 540, "Наружная цепь (над)", -99, 99 ],
  [ 4, 7, 90, 0, -1, -1, -1, -1, 560, "Клёсткая цепь (над)", -99, 99 ],
  [ 4, 7, 91, 0, -1, -1, -1, -1, 890, "Винтажная цепь (над)", -99, 99 ],
  [ 4, 7, 92, 0, -1, -1, -1, -1, 320, "Лёгкая цепь (над)", -99, 99 ],
  [ 4, 7, 93, 0, -1, -1, -1, -1, 350, "Сплошная цепь (над)", -99, 99 ],
  [ 4, 7, 94, 0, -1, -1, -1, -1, 345, "Тряпичная цепь (над)", -99, 99 ],
  [ 4, 7, 110, 0, -1, -1, -1, -1, 1100, "Цепь M", -99, 99 ],
  [ 4, 7, 111, 0, -1, -1, -1, -1, 1100, "Цепь M (над)", -99, 99 ],
  [ 4, 7, 119, 0, -1, -1, -1, -1, 1850, "Цепь Колесо M", -99, 99 ],
  [ 4, 7, 120, 0, -1, -1, -1, -1, 1850, "Цепь Колесо M (над)", -99, 99 ],
  [ 4, 7, 121, 0, -1, -1, -1, -1, 1900, "Цепь Колесо S", -99, 99 ],
  [ 4, 7, 122, 0, -1, -1, -1, -1, 1900, "Цепь Колесо S (над)", -99, 99 ],

  [ 5, 4, 0, 14, -1, -1, -1, -1, 80, "Классические джинсы", -20, 35 ],
  [ 5, 4, 43, 0, -1, -1, -1, -1, 75, "Рабочие джинсы", -25, 30 ],
  [ 5, 4, 1, 14, -1, -1, -1, -1, 95, "Широкие джинсы", -20, 35 ],
  [ 5, 4, 3, 14, -1, -1, -1, -1, 35, "Домашние штаны", -2, 35 ],
  [ 5, 4, 29, 1, -1, -1, -1, -1, 80, "Патриот-Карго штаны", -25, 25 ],
  [ 5, 4, 47, 0, -1, -1, -1, -1, 20, "Рабочие-Карго штаны", -25, 25 ],
  [ 5, 4, 8, -1, -1, -1, -1, -1, 70, "Рабочие-Карго штаны", -30, 20 ],
  [ 5, 4, 9, 14, -1, -1, -1, -1, 80, "Рабочие-Карго штаны", -25, 20 ],
  [ 5, 4, 7, 14, -1, -1, -1, -1, 70, "Рабочие штаны", -25, 25 ],
  [ 5, 4, 27, 10, -1, -1, -1, -1, 70, "Рабочие-Карго штаны", -20, 30 ],
  [ 5, 4, 5, 14, -1, -1, -1, -1, 40, "Спортивные штаны", -10, 30 ],
  [ 5, 4, 55, 2, -1, -1, -1, -1, 40, "Спортивные штаны", -10, 30 ],
  [ 5, 4, 64, 9, -1, -1, -1, -1, 40, "Спортивные штаны", -10, 30 ],
  [ 5, 4, 98, 24, -1, -1, -1, -1, 100, "Фирменные-Карго штаны", -25, 25],
  [ 5, 4, 15, 14, -1, -1, -1, -1, 55, "Карго шорты", 20, 50 ],
  [ 5, 4, 100, 12, -1, -1, -1, -1, 125, "Заказные шаровары", -25, 30 ],
  [ 5, 4, 14, 0, -1, -1, -1, -1, 25, "Спортивные шорты", 25, 60 ],
  [ 5, 4, 18, 10, -1, -1, -1, -1, 20, "Спортивные шорты", 25, 60 ],
  [ 5, 4, 42, 6, -1, -1, -1, -1, 45, "Повседневные шорты", 15, 55 ],
  [ 5, 4, 62, 2, -1, -1, -1, -1, 30, "Рабочие шорты", 15, 55 ],
  [ 5, 4, 21, -1, -1, -1, -1, -1, 5, "Трусы", 25, 99 ],
  [ 5, 4, 61, 12, -1, -1, -1, -1, 5, "Трусы", 25, 99 ],
  [ 5, 11, 123, 1, 11, -1, -1, -1, 50, "Бейсбольное поло", 15, 50 ],
  [ 5, 11, 83, 3, 11, -1, -1, -1, 45, "Бейсбольная рубашка", 15, 50 ],
  [ 5, 11, 84, 4, 4, -1, -1, -1, 80, "Бейсбольный свитер", 5, 35 ],
  [ 5, 11, 81, 1, 11, -1, -1, -1, 35, "Бейсбольная футболка", 15, 50 ],
  [ 5, 11, 128, 8, 0, -1, -1, -1, 25, "Бейсбольная футболка", 15, 50 ],
  [ 5, 11, 164, 1, 11, -1, -1, -1, 35, "Бейсбольная футболка", 15, 50 ],
  [ 5, 11, 111, 4, 4, -1, -1, -1, 75, "Водолазка", -5, 30 ],
  [ 5, 11, 139, 6, 4, -1, -1, -1, 75, "Водолазка", -5, 30 ],
  [ 5, 11, 97, 0, -1, -1, -1, -1, 5, "Грязная футболка", 15, 50 ],
  [ 5, 11, 17, 4, 5, -1, -1, -1, 20, "Классическая майка", 20, 60 ],
  [ 5, 11, 36, 4, 5, -1, -1, -1, 20, "Классическая майка", 20, 60 ],
  [ 5, 11, 237, 24, 5, -1, -1, -1, 20, "Классическая майка", 20, 60 ],
  [ 5, 11, 1, 0, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  [ 5, 11, 16, 1, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  [ 5, 11, 22, 1, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  [ 5, 11, 33, -1, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  [ 5, 11, 34, 0, 0, -1, -1, -1, 10, "Классическая футболка", 15, 50 ],
  [ 5, 11, 44, 2, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  [ 5, 11, 146, 7, 0, -1, -1, -1, 30, "Классическая футболка", 15, 50 ],
  //[ 5, 11, 273, 20, 0, -1, -1, -1, 90, "Коллекционная классическая футболка", 15, 50 ],
  [ 5, 11, 14, 14, 1, -1, -1, -1, 30, "Кофта под рубашкой", 5, 35 ],
  [ 5, 11, 89, 2, 6, -1, -1, -1, 30, "Свитер", 5, 35 ],
  [ 5, 11, 169, 2, 4, -1, 0, 1, 105, "Джинсовая куртка", -10, 30 ],
  [ 5, 11, 170, 2, 5, -1, 0, 1, 75, "Джинсовый жилет", 15, 35 ],
  [ 5, 11, 172, 2, 4, -1, 0, 1, 130, "Байкерская джинсовая куртка", -10, 30 ],
  [ 5, 11, 173, 2, 5, -1, 0, 1, 105, "Байкерский джинсовый жилет", 15, 35 ],
  [ 5, 11, 174, 2, 4, -1, 2, 1, 135, "Байкерская кожаная куртка", -20, 30 ],
  [ 5, 11, 175, 2, 5, -1, 2, 1, 115, "Байкерский кожаный жилет", 10, 30 ],
  [ 5, 11, 122, 12, 4, -1, 0, 1, 120, "Байкерская куртка", -5, 30 ],
  [ 5, 11, 161, 2, 4, -1, 0, 1, 90, "Байкерская куртка", -20, 30 ],
  [ 5, 11, 163, -1, 4, -1, 0, 1, 95, "Старая байкерская куртка", -5, 30 ],
  [ 5, 11, 159, 0, 15, -1, 0, 1, 80, "Байкерский жилет", 10, 30 ],
  [ 5, 11, 160, 0, 15, -1, 0, 1, 80, "Байкерский жилет", 10, 30 ],
  [ 5, 11, 162, 2, 2, -1, 0, 1, 60, "Байкерский жилет", 10, 30 ],
  [ 5, 11, 87, 10, 4, -1, -1, -1, 130, "Закрытый бейсбольный бомбер", -10, 30 ],
  [ 5, 11, 88, 10, 4, -1, 0, 1, 130, "Открытый бейсбольный бомбер", 5, 35 ],
  [ 5, 11, 126, 13, 4, -1, -1, -1, 45, "Закрытая винтажная рубашка", 10, 30 ],
  [ 5, 11, 127, 13, 4, -1, 0, 1, 45, "Открытая винтажная рубашка", 15, 35 ],
  [ 5, 11, 6, 0, 4, -1, 2, 1, 110, "Кожанная куртка", -10, 30 ],
  [ 5, 11, 37, 1, 4, -1, 2, 1, 30, "Кожанная куртка", -10, 30 ],
  [ 5, 11, 166, 4, 4, -1, 0, 1, 145, "Кожаная куртка", -15, 30 ],
  [ 5, 11, 157, 2, 15, -1, 0, 1, 80, "Кожаный жилет", 15, 35 ],
  [ 5, 11, 232, 8, 4, -1, 0, 1, 180, "Закрытая охотничья куртка", -15, 30 ],
  [ 5, 11, 233, 8, 4, -1, 0, 1, 180, "Открытая охотничья куртка", -5, 30 ],
  [ 5, 11, 3, 14, 1, -1, 38, 0, 80, "Спортивная куртка", 5, 30 ],
  [ 5, 11, 141, 9, 6, -1, -1, -1, 80, "Спортивная куртка", -5, 30 ],
  [ 5, 11, 7, 14, 4, -1, 0, 1, 90, "Спортивный толстовка", 5, 30 ],
  [ 5, 11, 86, 3, 4, -1, -1, -1, 30, "Спортивная толстовка", 5, 30 ],
  [ 5, 11, 171, 0, 4, -1, -1, -1, 85, "Толстовка", 5, 30 ],
  //[ 5, 11, 279, 16, 4, -1, -1, -1, 125, "Фирменная толстовка", 5, 30 ],
  //[ 5, 11, 257, 22, 6, -1, -1, -1, 180, "Фирменная спортивная куртка", -5, 30 ],
  //[ 5, 11, 281, 22, 6, -1, -1, -1, 100, "Фирменный свитер", 10, 30 ],
  //[ 5, 11, 282, 14, 0, -1, -1, -1, 75, "Фирменная бейсбольная футболка", 15, 50 ],
  [ 5, 6, 5, 2, -1, -1, -1, -1, 10, "Сланцы", 25, 99 ],
  [ 5, 6, 16, 10, -1, -1, -1, -1, 10, "Модные сланцы", 25, 99 ],
  [ 5, 6, 6, 0, -1, -1, -1, -1, 5, "Тапочки с носками", 20, 99 ],
  [ 5, 6, 8, 14, -1, -1, -1, -1, 50, "Беговые кеды с носками", -10, 50 ],
  [ 5, 6, 23, 14, -1, -1, -1, -1, 40, "Классические кеды", -10, 50 ],
  [ 5, 6, 9, 14, -1, -1, -1, -1, 65, "Кросовки с носками", -10, 50 ],
  [ 5, 6, 17, -1, -1, -1, -1, -1, 45, "Ботинки Эльфа", -5, 50 ],
  [ 5, 6, 35, 0, -1, -1, -1, -1, 50, "Высокие ботинки", -30, 30 ],
  [ 5, 6, 65, 5, -1, -1, -1, -1, 110, "Винтажные ботинки", -30, 30 ],
  [ 5, 6, 66, 5, -1, -1, -1, -1, 60, "Винтажные кросовки", -10, 50 ],
  [ 5, 6, 74, 0, -1, -1, -1, -1, 90, "ProLaps фирменный кеды", -10, 50 ],
  [ 5, 6, 75, 24, -1, -1, -1, -1, 150, "Беговые высокие кроссовки", -10, 50 ],
  [ 5, 6, 76, 24, -1, -1, -1, -1, 150, "Беговые низкие кроссовки", -10, 50 ],
  [ 5, 6, 78, 12, -1, -1, -1, -1, 65, "Спортивные сандали", 20, 99 ],
  [ 5, 7, 30, -1, -1, -1, -1, -1, 35, "Шарф", -99, 99 ],
  [ 5, 7, 31, -1, -1, -1, -1, -1, 35, "Шарф (над)", -99, 99 ],
  [ 5, 7, 34, 2, -1, -1, -1, -1, 55, "Новогодний шарф", -99, 99 ],
  [ 5, 7, 35, 2, -1, -1, -1, -1, 55, "Новогодний шарф (над)", -99, 99 ],
  [ 5, 7, 112, 1, -1, -1, -1, -1, 35, "Нашейная бандана", -99, 99 ],
  [ 5, 7, 113, -1, -1, -1, -1, -1, 20, "Индейская цепь", -99, 99 ],
  [ 5, 7, 123, 0, -1, -1, -1, -1, 20, "Индейская цепь", -99, 99 ],

















  [9999, 11, 332, 7, 0, -1, -1, -1, 60, "Майки", 10, 40], // 481
  [9999, 11, 334, 6, 4, -1, -1, -1, 60, "Худи gucci,kenzo,supreme,balenciaga", 10, 40], // 482
  [9999, 11, 335, 2, 4, -1, -1, -1, 60, "Худ Tommy Hilfiger", 10, 40], // 483
  [9999, 6, 96, 1, -1, -1, -1, -1, 55, "VANS", -10, 50], // 484
  
  
  // [0, 11, 333, 24, 2, -1, -1, -1, 60, "Кожанка", 10, 40],
  // [0, 11, 336, 24, 2, -1, -1, -1, 60, "Рубашка", 10, 40],
]

export const propFutil = <propItem[]>[
  [ 0, 0, 4, 6, 35, "Старый снепбек" ],
  [ 0, 0, 5, 6, 10, "Вязаная шапка" ],
  [ 0, 0, 6, 6, 35, "Бретонская кепка" ],
  [ 0, 0, 7, 6, 15, "Кепи" ],
  [ 0, 0, 9, 6, 25, "Кепка на бок" ],
  [ 0, 0, 12, -1, 15, "Длинная шапка" ],
  [ 0, 0, 20, 5, 40, "Ковбойская шляпа" ],
  [ 0, 0, 21, 5, 25, "Панама" ],
  [ 0, 0, 22, 5, 45, "Пляжная панама" ],
  [ 0, 0, 29, 3, 15, "Длинная шапка" ],
  [ 0, 0, 36, 4, 40, "Пивная кепка" ],
  [ 0, 0, 53, 0, 35, "Фирменный снепбек" ],
  [ 0, 0, 75, 19, 30, "Фирменная кепка (козырёк вперёд)" ],
  [ 0, 0, 76, 19, 30, "Фирменная кепка (козырёк назад)" ],
  [ 0, 0, 129, 17, 30, "Фирменная кепка (козырёк вперёд)" ],
  [ 0, 0, 130, 17, 30, "Фирменная кепка (козырёк назад)" ],
  [ 0, 0, 131, 2, 25, "Фирменная панама" ],
  [ 0, 0, 82, 5, 20, "Байкерская бандана" ],
  [ 0, 0, 93, 8, 30, "Заказная панама" ],
  [ 0, 1, 9, 9, 20, "Спортивные очки" ],
  [ 0, 1, 10, 9, 15, "Солнцезащитные очки" ],
  [ 0, 1, 11, 6, 25, "Авиаторы" ],
  [ 0, 1, 18, 6, 35, "Плоские очки" ],
  [ 0, 1, 19, 9, 40, "Офисные очки" ],
  [ 0, 6, 11, -1, 45, "Цепь на левую руку" ],
  [ 0, 7, 7, -1, 45, "Цепь на правую руку" ],
  [ 0, 6, 12, -1, 55, "Толстая цепь на левую руку" ],
  [ 0, 7, 8, -1, 55, "Толстая цепь на правую руку" ],
  [ 0, 6, 13, -1, 65, "Твёрдая цепь на левую руку" ],
  [ 0, 7, 9, -1, 65, "Твёрдая цепь на правую руку" ],
  [ 0, 6, 14, -1, 30, "Черепной браслет на левую руку" ],
  [ 0, 7, 10, -1, 30, "Черепной браслет на правую руку" ],
  [ 0, 6, 15, -1, 25, "Старый браслет на левую руку" ],
  [ 0, 7, 11, -1, 25, "Старый браслет на правую руку" ],
  [ 0, 6, 16, -1, 40, "Цепь с браслетами на левую руку" ],
  [ 0, 7, 12, -1, 40, "Цепь с браслетами на правую руку" ],

  [ 1, 0, 15, 6, 95, "Наушники" ],
  [ 1, 0, 23, 0, 125, "Новогодняя шапка Санты" ],
  [ 1, 0, 24, -1, 150, "Шапка эльфа" ],
  [ 1, 0, 25, -1, 85, "Рожки" ],
  [ 1, 0, 42, 2, 135, "Новогодняя шапка Санты" ],
  [ 1, 0, 55, 24, 120, "Фирменная бейсболка" ],
  [ 1, 0, 56, 8, 140, "Фирменный снепбек" ],
  [ 1, 0, 58, 1, 100, "Заказная кепка" ],
  [ 1, 0, 63, 8, 110, "Бейсболка" ],
  [ 1, 0, 95, 14, 115, "Заказная бейсболка" ],
  [ 1, 0, 108, 9, 95, "Кепка в сетку (козырёк вперёд)" ],
  [ 1, 0, 109, 9, 95, "Кепка в сетку (козырёк назад)" ],
  [ 1, 0, 119, 24, 95, "Большая шапка" ],
  [ 1, 1, 4, 9, 110, "Cats eye очки" ],
  [ 1, 1, 20, 6, 95, "Солнцезащитные вайфареры" ],
  [ 1, 1, 21, 6, 90, "Вайфареры" ],
  [ 1, 1, 22, -1, 70, "Патриотические звёдочки" ],
  [ 1, 1, 23, -1, 60, "Патриотические очки" ],
  [ 1, 1, 24, 9, 100, "Прямоугольные вайфареры" ],
  [ 1, 1, 27, 6, 210, "Мото-Очки" ],

  [ 2, 0, 13, 6, 225, "Порк-Пай" ],
  [ 2, 0, 14, 6, 145, "Берет" ],
  [ 2, 0, 26, 12, 280, "Котелок" ],
  [ 2, 0, 27, 12, 310, "Цилиндр" ],
  [ 2, 0, 28, 6, 190, "Эквадорская панама" ],
  [ 2, 0, 30, -1, 225, "Патриотичная шляпа" ],
  [ 2, 0, 31, -1, 335, "Патриотичный цилиндр" ],
  [ 2, 0, 32, 0, 355, "Патриотичный боливар" ],
  [ 2, 0, 54, 6, 240, "Широкополая шляпа" ],
  [ 2, 0, 61, 8, 260, "Гангстерская шляпа" ],
  [ 2, 0, 94, 8, 310, "Федора" ],
  [ 2, 1, 0, 9, 225, "Элегантные очки" ],
  [ 2, 1, 1, 9, 260, "Большие очки" ],
  [ 2, 1, 2, 9, 230, "Округлые очки" ],
  [ 2, 1, 3, 9, 295, "Фирменные плоские очки" ],
  [ 2, 1, 6, -1, 425, "Фирменные очки" ],
  [ 2, 1, 7, 9, 365, "Заказные очки" ],
  [ 2, 1, 8, -1, 375, "Фирменные округлые очки" ],
  [ 2, 1, 14, 9, 210, "Дамские очки" ],
  [ 2, 1, 16, 8, 425, "Фирменные очки" ],
  [ 2, 1, 17, 9, 375, "Фирменные округлые очки" ],

  [ 3, 0, 0, 6, 80, "Наушники для стрельбы" ],
  [ 3, 0, 102, 18, 110, "Камуфляжная заказная кепка" ],
  [ 3, 0, 103, 24, 95, "Камуфляжная панама" ],
  [ 3, 0, 104, 24, 95, "Камуфляжная охотнисья панама" ],
  [ 3, 0, 105, 24, 85, "Камуфляжный берет" ],
  [ 3, 0, 106, 24, 125, "Камуфляжная армейская кепка" ],
  [ 3, 0, 107, 24, 65, "Камуфляжная вязаная кепка" ],
  [ 3, 1, 25, 8, 40, "Очки для стрельбы" ],
  [ 3, 1, 26, 4, 145, "Очки лётчиков" ],
  [ 3, 1, 27, 6, 210, "Мото-Очки" ],

  [ 4, 2, 3, -1, 1550, "Серебрянные капли" ],
  [ 4, 2, 4, -1, 2250, "Золотые капли" ],
  [ 4, 2, 5, -1, 1850, "Золотые нигары" ],
  [ 4, 2, 6, 1, 3600, "Руби с камнями" ],
  [ 4, 2, 7, 1, 3320, "Фельционы с камнями" ],
  [ 4, 2, 8, 1, 3450, "Таенты с камнями" ],
  [ 4, 2, 9, 1, 2670, "Алиты с камнями" ],
  [ 4, 2, 10, 1, 2150, "Истании с камнями" ],
  [ 4, 2, 11, 1, 2970, "Снежинки с камнями" ],
  [ 4, 2, 12, 1, 1450, "Серьги с камнями" ],
  [ 4, 2, 13, -1, 1950, "Золотые серьги AKM" ],
  [ 4, 2, 14, -1, 960, "Караловые серьги" ],
  [ 4, 2, 15, -1, 1390, "Золотые кольца" ],
  [ 4, 2, 16, -1, 1090, "Караловые серьги Fuck You" ],
  [ 4, 2, 17, -1, 1090, "Караловые серьги Screw You" ],
  [ 4, 6, 2, 2, 1250, "Тонкие механические часы" ],
  [ 4, 6, 3, 1, 1500, "Прямоугольные механические часы" ],
  [ 4, 6, 4, 1, 1360, "Круглые механические часы" ],
  [ 4, 6, 5, 1, 550, "Электронные часы" ],
  [ 4, 6, 6, 1, 575, "Заказные электронные часы" ],
  [ 4, 6, 7, 1, 1150, "Гранитные механические часы" ],
  [ 4, 6, 8, 1, 1340, "Квадратные мехнические часы" ],
  [ 4, 6, 9, 1, 1090, "Плоские механические часы" ],
  [ 4, 6, 10, 1, 890, "Электронные часы IFruit" ],
  [ 4, 7, 0, -1, 1790, "Золотой винтажный браслет" ],
  [ 4, 7, 1, -1, 1810, "Золотой браслет с гравировкой" ],
  [ 4, 7, 2, -1, 1750, "Золотой браслет" ],
  [ 4, 7, 3, -1, 350, "Фирменный браслет" ],
  [ 4, 7, 5, -1, 495, "Бронзовый браслет" ],
  [ 4, 7, 0, -1, 450, "Бронзовый полный браслет" ],

  [ 5, 0, 5, 6, 10, "Вязаная шапка" ],
  [ 5, 0, 6, 6, 35, "Бретонская кепка" ],
  [ 5, 0, 7, 6, 15, "Кепи" ],
  [ 5, 0, 9, 6, 25, "Кепка на бок" ],
  [ 5, 0, 12, -1, 15, "Длинная шапка" ],
  [ 5, 0, 20, 5, 40, "Ковбойская шляпа" ],
  [ 5, 0, 21, 5, 25, "Панама" ],
  [ 5, 0, 22, 5, 45, "Пляжная панама" ],
  [ 5, 0, 29, 3, 15, "Длинная шапка" ],
  [ 5, 0, 33, -1, 90, "Патриотичная вязаная шапка" ],
  [ 5, 0, 34, -1, 45, "Патриотичная корона" ],
  [ 5, 0, 35, -1, 40, "Патриотичные ушки" ],
  [ 5, 0, 36, 4, 40, "Пивная кепка" ],
  [ 5, 0, 39, 6, 50, "Новогодняя длинная шапка" ],
  [ 5, 0, 40, -1, 35, "Новогодняя шапка" ],
  [ 5, 0, 41, 2, 40, "Новогодняя шапка с пумпоном" ],
  [ 5, 0, 43, 6, 35, "Новогодняя кепка (козырёк вперёд)" ],
  [ 5, 0, 44, 6, 35, "Новогодняя кепка (козырёк назад)" ],
  [ 5, 0, 53, 0, 35, "Фирменный снепбек" ],
  [ 5, 0, 75, 19, 30, "Фирменная кепка (козырёк вперёд)" ],
  [ 5, 0, 76, 19, 30, "Фирменная кепка (козырёк назад)" ],
  [ 5, 0, 129, 17, 30, "Фирменная кепка (козырёк вперёд)" ],
  [ 5, 0, 130, 17, 30, "Фирменная кепка (козырёк назад)" ],
  [ 5, 0, 131, 2, 25, "Фирменная панама" ],
  [ 5, 0, 82, 5, 20, "Байкерская бандана" ],
  [ 5, 0, 93, 8, 30, "Заказная панама" ],
  [ 5, 1, 9, 9, 20, "Спортивные очки" ],
  [ 5, 1, 10, 9, 15, "Солнцезащитные очки" ],
  [ 5, 1, 11, 6, 25, "Авиаторы" ],
  [ 5, 1, 18, 6, 35, "Плоские очки" ],
  [ 5, 1, 19, 9, 40, "Офисные очки" ],
  [ 5, 6, 11, -1, 45, "Цепь на левую руку" ],
  [ 5, 7, 7, -1, 45, "Цепь на правую руку" ],
  [ 5, 6, 12, -1, 55, "Толстая цепь на левую руку" ],
  [ 5, 7, 8, -1, 55, "Толстая цепь на правую руку" ],
  [ 5, 6, 13, -1, 65, "Твёрдая цепь на левую руку" ],
  [ 5, 7, 9, -1, 65, "Твёрдая цепь на правую руку" ],
  [ 5, 6, 14, -1, 30, "Черепной браслет на левую руку" ],
  [ 5, 7, 10, -1, 30, "Черепной браслет на правую руку" ],
  [ 5, 6, 16, -1, 40, "Цепь с браслетами на левую руку" ],
  [ 5, 7, 12, -1, 40, "Цепь с браслетами на правую руку" ],
  [ 5, 6, 17, -1, 75, "Байкерский браслет на левую руку" ],
  [ 5, 7, 13, -1, 75, "Байкерский браслет на правую руку" ],
  [ 5, 6, 18, 1, 40, "Кожаный браслет на левую руку" ],
  [ 5, 7, 14, 1, 40, "Кожаный браслет на правую руку" ],
]

export const propMutil = <propItem[]>[
  [ 0, 0, 2, 6, 10, "Шапка" ],
  [ 0, 0, 5, 0, 15, "Длинная шапка" ],
  [ 0, 0, 28, 4, 15, "Длинная шапка" ],
  [ 0, 0, 7, 6, 15, "Кепи" ],
  [ 0, 0, 13, 6, 40, "Ковбойская шляпа" ],
  [ 0, 0, 14, 6, 15, "Бандана" ],
  [ 0, 0, 83, 5, 20, "Байкерская бандана" ],
  [ 0, 0, 20, 4, 25, "Панама" ],
  [ 0, 0, 94, 8, 30, "Заказная панама" ],
  [ 0, 0, 76, 19, 30, "Фирменная кепка (козырёк вперёд)" ],
  [ 0, 0, 77, 19, 30, "Фирменная кепка (козырёк назад)" ],
  [ 0, 0, 130, 17, 30, "Фирменная кепка (козырёк вперёд)" ],
  [ 0, 0, 131, 17, 30, "Фирменная кепка (козырёк назад)" ],
  [ 0, 0, 132, 2, 25, "Фирменная панама" ],
  [ 0, 0, 37, 4, 40, "Пивная кепка" ],
  [ 0, 1, 5, 9, 25, "Авиаторы" ],
  [ 0, 1, 8, 9, 35, "Заказные авиаторы" ],
  [ 0, 1, 16, 9, 30, "Беговые очки" ],
  [ 0, 1, 17, 9, 40, "Офисные очки" ],
  [ 0, 1, 15, 9, 25, "Спортивные очки" ],
  [ 0, 6, 22, -1, 45, "Цепь на левую руку" ],
  [ 0, 7, 0, -1, 45, "Цепь на правую руку" ],
  [ 0, 6, 23, -1, 55, "Толстая цепь на левую руку" ],
  [ 0, 7, 1, -1, 55, "Толстая цепь на правую руку" ],
  [ 0, 6, 24, -1, 65, "Твёрдая цепь на левую руку" ],
  [ 0, 7, 2, -1, 65, "Твёрдая цепь на левую руку" ],
  [ 0, 6, 25, -1, 30, "Черепной браслет на левую руку" ],
  [ 0, 7, 3, -1, 25, "Черепной браслет на левую руку" ],
  [ 0, 6, 26, -1, 25, "Старый браслет на левую руку" ],
  [ 0, 7, 4, -1, 25, "Старый браслет на левую руку" ],
  [ 0, 6, 27, -1, 40, "Цепь с браслетами на левую руку" ],
  [ 0, 7, 5, -1, 40, "Цепь с браслетами на левую руку" ],

  [ 1, 0, 3, 0, 100, "Снепбек LS" ],
  [ 1, 0, 15, 6, 95, "Наушники" ],
  [ 1, 0, 22, 0, 125, "Новогодняя шапка Санты" ],
  [ 1, 0, 23, -1, 150, "Шапка эльфа" ],
  [ 1, 0, 24, -1, 85, "Рожки" ],
  [ 1, 0, 43, 2, 135, "Новогодняя шапка Санты" ],
  [ 1, 0, 55, 24, 120, "Фирменная бейсболка" ],
  [ 1, 0, 56, 8, 140, "Фирменный снепбек" ],
  [ 1, 0, 58, 1, 100, "Заказная кепка" ],
  [ 1, 0, 63, 8, 110, "Бейсболка" ],
  [ 1, 0, 96, 14, 115, "Заказная бейсболка" ],
  [ 1, 0, 109, 9, 95, "Кепка в сетку (козырёк вперёд)" ],
  [ 1, 0, 110, 9, 95, "Кепка в сетку (козырёк назад)" ],
  [ 1, 0, 120, 24, 95, "Большая шапка" ],
  [ 1, 1, 7, 9, 100, "Прямоугольные вайфареры" ],
  [ 1, 1, 12, 9, 120, "Круглые очки" ],
  [ 1, 1, 13, 9, 115, "Хипстер-Квадратные очки" ],
  [ 1, 1, 19, 9, 120, "Хипстер-Выгнутые очки" ],
  [ 1, 1, 20, 9, 90, "Вайфареры" ],
  [ 1, 1, 21, -1, 70, "Патриотические звёдочки" ],
  [ 1, 1, 22, -1, 60, "Патриотические очки" ],

  [ 2, 0, 12, 1, 260, "Гангстерская шляпа" ],
  [ 2, 0, 21, 6, 225, "Порк-Пай" ],
  [ 2, 0, 25, 1, 260, "Гангстерская шляпа" ],
  [ 2, 0, 26, 12, 280, "Котелок" ],
  [ 2, 0, 27, 12, 310, "Цилиндр" ],
  [ 2, 0, 29, 6, 235, "Трибли" ],
  [ 2, 0, 30, 0, 260, "Гангстерская шляпа" ],
  [ 2, 0, 31, -1, 225, "Патриотичная шляпа" ],
  [ 2, 0, 32, -1, 335, "Патриотичный цилиндр" ],
  [ 2, 0, 33, 0, 355, "Патриотичный боливар" ],
  [ 2, 0, 61, 8, 260, "Гангстерская шляпа" ],
  [ 2, 0, 64, 10, 260, "Гангстерская шляпа" ],
  [ 2, 0, 95, 8, 310, "Федора" ],
  [ 2, 1, 2, 4, 250, "Толстые очки" ],
  [ 2, 1, 3, 9, 210, "Панто" ],
  [ 2, 1, 4, 9, 240, "Кламбастер" ],
  [ 2, 1, 10, 9, 290, "Заказные толстые очки" ],
  [ 2, 1, 11, 9, 315, "Прямоугольные очки" ],
  [ 2, 1, 18, 9, 255, "Широкие очки" ],

  [ 3, 0, 0, 6, 80, "Наушники для стрельбы" ],
  [ 3, 0, 103, 18, 110, "Камуфляжная заказная кепка" ],
  [ 3, 0, 104, 24, 95, "Камуфляжная панама" ],
  [ 3, 0, 105, 24, 95, "Камуфляжная охотничья панама" ],
  [ 3, 0, 106, 24, 85, "Камуфляжный берет" ],
  [ 3, 0, 107, 24, 125, "Камуфляжная армейская кепка" ],
  [ 3, 0, 108, 24, 65, "Камуфляжная вязаная кепка" ],
  [ 3, 1, 23, 8, 40, "Очки для стрельбы" ],
  [ 3, 1, 24, 4, 145, "Очки лётчиков" ],
  [ 3, 1, 25, 6, 210, "Мото-Очки" ],

  [ 4, 2, 3, 1, 650, "Кольцо в левом ухе" ],
  [ 4, 2, 4, 1, 650, "Кольцо в правом ухе" ],
  [ 4, 2, 5, 1, 1300, "Кольца" ],
  [ 4, 2, 6, 0, 450, "Клипса в левом ухе" ],
  [ 4, 2, 7, 0, 450, "Клипса в правом ухе" ],
  [ 4, 2, 8, 0, 900, "Клипсы" ],
  [ 4, 2, 9, 1, 1500, "Даймонд в левом ухе" ],
  [ 4, 2, 10, 1, 1500, "Даймонд в правом ухе" ],
  [ 4, 2, 11, 1, 3000, "Даймонды" ],
  [ 4, 2, 12, 1, 1100, "Звезда в левом ухе" ],
  [ 4, 2, 13, 1, 1100, "Зевезда в правом ухе" ],
  [ 4, 2, 14, 1, 2200, "Звезды" ],
  [ 4, 2, 15, 1, 750, "Серьга в левом ухе" ],
  [ 4, 2, 16, 1, 750, "Серьги в правом ухе" ],
  [ 4, 2, 17, 1, 1500, "Серьги" ],
  [ 4, 2, 18, 3, 850, "Кварт в левом ухе" ],
  [ 4, 2, 19, 3, 850, "Кварт в правом ухе" ],
  [ 4, 2, 20,3, 1700, "Кварты" ],
  [ 4, 2, 21, 0, 550, "Серьга S в лвеом ухе" ],
  [ 4, 2, 22, 0, 550, "Серьга S в правом ухе" ],
  [ 4, 2, 23, 0, 110, "Серьги S" ],
  [ 4, 2, 24, 2, 600, "Череп в левом ухе" ],
  [ 4, 2, 25, 2, 600, "Череп в правом ухе" ],
  [ 4, 2, 26, 2, 1200, "Черепа" ],
  [ 4, 2, 27, 0, 400, "Напрент в левом ухе" ],
  [ 4, 2, 28, 0, 400, "Напрент в правом ухе" ],
  [ 4, 2, 29, 0, 800, "Напренты" ],
  [ 4, 2, 30, 1, 1250, "Сариот в левом ухе" ],
  [ 4, 2, 31, 1, 1250, "Сариот в правом ухе" ],
  [ 4, 2, 32, 1, 2500, "Сариоты" ],
  [ 4, 2, 34, 0, 600, "Батенс в левом ухе" ],
  [ 4, 2, 35, 0, 600, "Батенс в правом ухе" ],
  [ 4, 2, 36, 0, 1200, "Батенсые" ],
  [ 4, 6, 0, -1, 5500, "Фирменные механические часы" ],
  [ 4, 6, 1, -1, 2200, "Фирменные электронные часы" ],
  [ 4, 6, 3, 3, 1360, "Круглые механические часы" ],
  [ 4, 6, 4, 2, 2600, "Эксклюзивные механические часы" ],
  [ 4, 6, 5, 2, 2200, "Фирменные электронные часы" ],
  [ 4, 6, 6, 1, 2800, "Морские механические часы" ],
  [ 4, 6, 7, 1, 1900, "Ромбо-Электронные часы" ],
  [ 4, 6, 8, 1, 3450, "Сложные механические часы" ],
  [ 4, 6, 9, 1, 3900, "Авиаторские часы" ],
  [ 4, 6, 10, 1, 2100, "Спортивные часы" ],
  [ 4, 6, 11, 1, 3050, "Туртатовы механические часы" ],
  [ 4, 6, 12, 1, 550, "Электронные часы" ],
  [ 4, 6, 13, 1, 550, "Электронные часы" ],
  [ 4, 6, 14, 1, 1860, "Браслетные механические часы" ],
  [ 4, 6, 15, 1, 1650, "Вакумные механические часы" ],
  [ 4, 6, 16, 1, 2100, "Сатовые механические часы" ],
  [ 4, 6, 17, 1, 1900, "Ромбо-Электронные часы" ],
  [ 4, 6, 18, 1, 2750, "Крупные механические часы" ],
  [ 4, 6, 19, 1, 3450, "Цирста механические часы" ],
  [ 4, 6, 20, 1, 2350, "Водолазные механические часы" ],
  [ 4, 6, 21, 1, 890, "Электронные часы IFruit" ],

  [ 5, 0, 2, 6, 10, "Шапка" ],
  [ 5, 0, 5, 0, 15, "Длинная шапка" ],
  [ 5, 0, 28, 4, 15, "Длинная шапка" ],
  [ 5, 0, 6, 6, 35, "Армейская кепка" ],
  [ 5, 0, 60, 8, 35, "Армейская кепка" ],
  [ 5, 0, 7, 6, 15, "Кепи" ],
  [ 5, 0, 13, 6, 40, "Ковбойская шляпа" ],
  [ 5, 0, 14, 6, 15, "Бандана" ],
  [ 5, 0, 83, 5, 20, "Байкерская бандана" ],
  [ 5, 0, 20, 4, 25, "Панама" ],
  [ 5, 0, 94, 8, 30, "Заказная панама" ],
  [ 5, 0, 34, -1, 90, "Патриотичная вязаная шапка" ],
  [ 5, 0, 35, -1, 45, "Патриотичная корона" ],
  [ 5, 0, 36, -1, 40, "Патриотичные ушки" ],
  [ 5, 0, 40, 6, 50, "Новогодняя длинная шапка" ],
  [ 5, 0, 41, -1, 35, "Новогодняя шапка" ],
  [ 5, 0, 42, 2, 40, "Новогодняя шапка с пумпоном" ],
  [ 5, 0, 54, 0, 35, "Фирменный снепбек" ],
  [ 5, 0, 44, 6, 35, "Новогодняя кепка (козырёк вперёд)" ],
  [ 5, 0, 45, 6, 35, "Новогодняя кепка (козырёк назад)" ],
  [ 5, 0, 76, 19, 30, "Фирменная кепка (козырёк вперёд)" ],
  [ 5, 0, 77, 19, 30, "Фирменная кепка (козырёк назад)" ],
  [ 5, 0, 130, 17, 30, "Фирменная кепка (козырёк вперёд)" ],
  [ 5, 0, 131, 17, 30, "Фирменная кепка (козырёк назад)" ],
  [ 5, 0, 132, 2, 25, "Фирменная панама" ],
  [ 5, 0, 37, 4, 40, "Пивная кепка" ],
  [ 5, 1, 5, 9, 25, "Авиаторы" ],
  [ 5, 1, 8, 9, 35, "Заказные авиаторы" ],
  [ 5, 1, 16, 9, 30, "Беговые очки" ],
  [ 5, 1, 17, 9, 40, "Офисные очки" ],
  [ 5, 1, 15, 9, 25, "Спортивные очки" ],
  [ 5, 6, 22, -1, 45, "Цепь на левую руку" ],
  [ 5, 7, 0, -1, 45, "Цепь на правую руку" ],
  [ 5, 6, 23, -1, 55, "Толстая цепь на левую руку" ],
  [ 5, 7, 1, -1, 55, "Толстая цепь на правую руку" ],
  [ 5, 6, 24, -1, 65, "Твёрдая цепь на левую руку" ],
  [ 5, 7, 2, -1, 65, "Твёрдая цепь на левую руку" ],
  [ 5, 6, 25, -1, 30, "Черепной браслет на левую руку" ],
  [ 5, 7, 3, -1, 25, "Черепной браслет на левую руку" ],
  [ 5, 6, 27, -1, 40, "Цепь с браслетами на левую руку" ],
  [ 5, 7, 5, -1, 40, "Цепь с браслетами на левую руку" ],
  [ 5, 6, 28, -1, 75, "Байкерский браслет на левую руку" ],
  [ 5, 7, 6, -1, 75, "Байкерский браслет на левую руку" ],
  [ 5, 6, 29, 1, 40, "Кожаный браслет на левую руку" ],
  [ 5, 7, 7, 1, 40, "Кожаный браслет на левую руку" ],
]


export const printListUtil = [
  ['mpbattle_overlays', 'MP_Battle_Clothing_000_M', 'MP_Battle_Clothing_000_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_001_M', 'MP_Battle_Clothing_001_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_002_M', 'MP_Battle_Clothing_002_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_003_M', 'MP_Battle_Clothing_003_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_004_M', 'MP_Battle_Clothing_004_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_005_M', 'MP_Battle_Clothing_005_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_006_M', 'MP_Battle_Clothing_006_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_007_M', 'MP_Battle_Clothing_007_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_008_M', 'MP_Battle_Clothing_008_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_009_M', 'MP_Battle_Clothing_009_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_010_M', 'MP_Battle_Clothing_010_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_011_M', 'MP_Battle_Clothing_011_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_012_M', 'MP_Battle_Clothing_012_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_013_M', 'MP_Battle_Clothing_013_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_014_M', 'MP_Battle_Clothing_014_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_015_M', 'MP_Battle_Clothing_015_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_016_M', 'MP_Battle_Clothing_016_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_017_M', 'MP_Battle_Clothing_017_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_018_M', 'MP_Battle_Clothing_018_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_019_M', 'MP_Battle_Clothing_019_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_020_M', 'MP_Battle_Clothing_020_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_021_M', 'MP_Battle_Clothing_021_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_022_M', 'MP_Battle_Clothing_022_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_023_M', 'MP_Battle_Clothing_023_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_024_M', 'MP_Battle_Clothing_024_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_025_M', 'MP_Battle_Clothing_025_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_026_M', 'MP_Battle_Clothing_026_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_027_M', 'MP_Battle_Clothing_027_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_028_M', 'MP_Battle_Clothing_028_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_029_M', 'MP_Battle_Clothing_029_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_030_M', 'MP_Battle_Clothing_030_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_031_M', 'MP_Battle_Clothing_031_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_032_M', 'MP_Battle_Clothing_032_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_033_M', 'MP_Battle_Clothing_033_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_034_M', 'MP_Battle_Clothing_034_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_035_M', 'MP_Battle_Clothing_035_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_036_M', 'MP_Battle_Clothing_036_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_037_M', 'MP_Battle_Clothing_037_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_038_M', 'MP_Battle_Clothing_038_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_039_M', 'MP_Battle_Clothing_039_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_040_M', 'MP_Battle_Clothing_040_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_041_M', 'MP_Battle_Clothing_041_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_042_M', 'MP_Battle_Clothing_042_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_043_M', 'MP_Battle_Clothing_043_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_044_M', 'MP_Battle_Clothing_044_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_045_M', 'MP_Battle_Clothing_045_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_046_M', 'MP_Battle_Clothing_046_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_047_M', 'MP_Battle_Clothing_047_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_048_M', 'MP_Battle_Clothing_048_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_049_M', 'MP_Battle_Clothing_049_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_050_M', 'MP_Battle_Clothing_050_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_051_M', 'MP_Battle_Clothing_051_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_052_M', 'MP_Battle_Clothing_052_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_053_M', 'MP_Battle_Clothing_053_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_054_M', 'MP_Battle_Clothing_054_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_055_M', 'MP_Battle_Clothing_055_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_056_M', 'MP_Battle_Clothing_056_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_057_M', 'MP_Battle_Clothing_057_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_058_M', 'MP_Battle_Clothing_058_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_059_M', 'MP_Battle_Clothing_059_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_060_M', 'MP_Battle_Clothing_060_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_061_M', 'MP_Battle_Clothing_061_F', 0],
  ['mpbattle_overlays', 'MP_Battle_Clothing_062_M', 'MP_Battle_Clothing_062_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tat_000_M', 'MP_Christmas2018_Tat_000_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_000_M', 'MP_Christmas2018_Tee_000_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_001_M', 'MP_Christmas2018_Tee_001_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_002_M', 'MP_Christmas2018_Tee_002_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_003_M', 'MP_Christmas2018_Tee_003_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_004_M', 'MP_Christmas2018_Tee_004_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_005_M', 'MP_Christmas2018_Tee_005_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_006_M', 'MP_Christmas2018_Tee_006_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_007_M', 'MP_Christmas2018_Tee_007_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_008_M', 'MP_Christmas2018_Tee_008_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_009_M', 'MP_Christmas2018_Tee_009_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_010_M', 'MP_Christmas2018_Tee_010_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_011_M', 'MP_Christmas2018_Tee_011_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_012_M', 'MP_Christmas2018_Tee_012_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_013_M', 'MP_Christmas2018_Tee_013_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_014_M', 'MP_Christmas2018_Tee_014_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_015_M', 'MP_Christmas2018_Tee_015_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_016_M', 'MP_Christmas2018_Tee_016_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_017_M', 'MP_Christmas2018_Tee_017_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_018_M', 'MP_Christmas2018_Tee_018_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_019_M', 'MP_Christmas2018_Tee_019_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_020_M', 'MP_Christmas2018_Tee_020_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_021_M', 'MP_Christmas2018_Tee_021_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_022_M', 'MP_Christmas2018_Tee_022_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_023_M', 'MP_Christmas2018_Tee_023_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_024_M', 'MP_Christmas2018_Tee_024_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_025_M', 'MP_Christmas2018_Tee_025_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_026_M', 'MP_Christmas2018_Tee_026_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_027_M', 'MP_Christmas2018_Tee_027_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_028_M', 'MP_Christmas2018_Tee_028_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_029_M', 'MP_Christmas2018_Tee_029_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_030_M', 'MP_Christmas2018_Tee_030_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_031_M', 'MP_Christmas2018_Tee_031_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_032_M', 'MP_Christmas2018_Tee_032_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_033_M', 'MP_Christmas2018_Tee_033_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_034_M', 'MP_Christmas2018_Tee_034_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_035_M', 'MP_Christmas2018_Tee_035_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_036_M', 'MP_Christmas2018_Tee_036_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_037_M', 'MP_Christmas2018_Tee_037_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_038_M', 'MP_Christmas2018_Tee_038_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_039_M', 'MP_Christmas2018_Tee_039_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_040_M', 'MP_Christmas2018_Tee_040_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_041_M', 'MP_Christmas2018_Tee_041_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_042_M', 'MP_Christmas2018_Tee_042_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_043_M', 'MP_Christmas2018_Tee_043_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_044_M', 'MP_Christmas2018_Tee_044_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_045_M', 'MP_Christmas2018_Tee_045_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_046_M', 'MP_Christmas2018_Tee_046_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_047_M', 'MP_Christmas2018_Tee_047_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_048_M', 'MP_Christmas2018_Tee_048_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_049_M', 'MP_Christmas2018_Tee_049_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_050_M', 'MP_Christmas2018_Tee_050_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_051_M', 'MP_Christmas2018_Tee_051_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_052_M', 'MP_Christmas2018_Tee_052_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_053_M', 'MP_Christmas2018_Tee_053_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_054_M', 'MP_Christmas2018_Tee_054_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_055_M', 'MP_Christmas2018_Tee_055_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_056_M', 'MP_Christmas2018_Tee_056_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_057_M', 'MP_Christmas2018_Tee_057_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_058_M', 'MP_Christmas2018_Tee_058_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_059_M', 'MP_Christmas2018_Tee_059_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_060_M', 'MP_Christmas2018_Tee_060_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_061_M', 'MP_Christmas2018_Tee_061_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_062_M', 'MP_Christmas2018_Tee_062_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_063_M', 'MP_Christmas2018_Tee_063_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_064_M', 'MP_Christmas2018_Tee_064_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_065_M', 'MP_Christmas2018_Tee_065_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_066_M', 'MP_Christmas2018_Tee_066_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_067_M', 'MP_Christmas2018_Tee_067_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_068_M', 'MP_Christmas2018_Tee_068_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_069_M', 'MP_Christmas2018_Tee_069_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_070_M', 'MP_Christmas2018_Tee_070_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_071_M', 'MP_Christmas2018_Tee_071_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_072_M', 'MP_Christmas2018_Tee_072_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_073_M', 'MP_Christmas2018_Tee_073_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_074_M', 'MP_Christmas2018_Tee_074_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_075_M', 'MP_Christmas2018_Tee_075_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_076_M', 'MP_Christmas2018_Tee_076_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_077_M', 'MP_Christmas2018_Tee_077_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_078_M', 'MP_Christmas2018_Tee_078_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_079_M', 'MP_Christmas2018_Tee_079_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_080_M', 'MP_Christmas2018_Tee_080_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_081_M', 'MP_Christmas2018_Tee_081_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_082_M', 'MP_Christmas2018_Tee_082_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_083_M', 'MP_Christmas2018_Tee_083_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_084_M', 'MP_Christmas2018_Tee_084_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_085_M', 'MP_Christmas2018_Tee_085_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_086_M', 'MP_Christmas2018_Tee_086_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_087_M', 'MP_Christmas2018_Tee_087_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_088_M', 'MP_Christmas2018_Tee_088_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_089_M', 'MP_Christmas2018_Tee_089_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_090_M', 'MP_Christmas2018_Tee_090_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_091_M', 'MP_Christmas2018_Tee_091_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_092_M', 'MP_Christmas2018_Tee_092_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_093_M', 'MP_Christmas2018_Tee_093_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_094_M', 'MP_Christmas2018_Tee_094_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_095_M', 'MP_Christmas2018_Tee_095_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_096_M', 'MP_Christmas2018_Tee_096_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_097_M', 'MP_Christmas2018_Tee_097_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_098_M', 'MP_Christmas2018_Tee_098_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_099_M', 'MP_Christmas2018_Tee_099_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_100_M', 'MP_Christmas2018_Tee_100_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_101_M', 'MP_Christmas2018_Tee_101_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_102_M', 'MP_Christmas2018_Tee_102_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_103_M', 'MP_Christmas2018_Tee_103_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_104_M', 'MP_Christmas2018_Tee_104_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_105_M', 'MP_Christmas2018_Tee_105_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_106_M', 'MP_Christmas2018_Tee_106_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_107_M', 'MP_Christmas2018_Tee_107_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_108_M', 'MP_Christmas2018_Tee_108_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_109_M', 'MP_Christmas2018_Tee_109_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_110_M', 'MP_Christmas2018_Tee_110_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_111_M', 'MP_Christmas2018_Tee_111_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_112_M', 'MP_Christmas2018_Tee_112_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_113_M', 'MP_Christmas2018_Tee_113_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_114_M', 'MP_Christmas2018_Tee_114_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_115_M', 'MP_Christmas2018_Tee_115_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_116_M', 'MP_Christmas2018_Tee_116_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_117_M', 'MP_Christmas2018_Tee_117_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_118_M', 'MP_Christmas2018_Tee_118_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_119_M', 'MP_Christmas2018_Tee_119_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_120_M', 'MP_Christmas2018_Tee_120_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_121_M', 'MP_Christmas2018_Tee_121_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_122_M', 'MP_Christmas2018_Tee_122_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_123_M', 'MP_Christmas2018_Tee_123_F', 0],
  ['mpchristmas2018_overlays', 'MP_Christmas2018_Tee_124_M', 'MP_Christmas2018_Tee_124_F', 0],
  ['mpexecutive_overlays', 'MP_Securoserv_000_M', 'MP_Securoserv_000_F', 0],
  ['mpexecutive_overlays', 'MP_exec_teams_000_M', 'MP_exec_teams_000_F', 0],
  ['mpexecutive_overlays', 'MP_exec_teams_001_M', 'MP_exec_teams_001_F', 0],
  ['mpexecutive_overlays', 'MP_exec_teams_002_M', 'MP_exec_teams_002_F', 0],
  ['mpexecutive_overlays', 'MP_exec_teams_003_M', 'MP_exec_teams_003_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_000_M', 'MP_exec_prizes_000_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_001_M', 'MP_exec_prizes_001_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_002_M', 'MP_exec_prizes_002_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_003_M', 'MP_exec_prizes_003_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_004_M', 'MP_exec_prizes_004_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_005_M', 'MP_exec_prizes_005_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_006_M', 'MP_exec_prizes_006_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_007_M', 'MP_exec_prizes_007_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_008_M', 'MP_exec_prizes_008_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_009_M', 'MP_exec_prizes_009_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_010_M', 'MP_exec_prizes_010_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_011_M', 'MP_exec_prizes_011_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_012_M', 'MP_exec_prizes_012_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_013_M', 'MP_exec_prizes_013_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_014_M', 'MP_exec_prizes_014_F', 0],
  ['mpexecutive_overlays', 'MP_exec_prizes_015_M', 'MP_exec_prizes_015_F', 0],
  ['mphalloween_overlays', 'HW_Tee_000_M', 'HW_Tee_000_F', 0],
  ['mphalloween_overlays', 'HW_Tee_002_M', 'HW_Tee_002_F', 0],
  ['mphalloween_overlays', 'HW_Tee_004_M', 'HW_Tee_004_F', 0],
  ['mphalloween_overlays', 'HW_Tee_006_M', 'HW_Tee_006_F', 0],
  ['mphalloween_overlays', 'HW_Tee_008_M', 'HW_Tee_008_F', 0],
  ['mphalloween_overlays', 'HW_Tee_010_M', 'HW_Tee_010_F', 0],
  ['mphalloween_overlays', 'HW_Tee_012_M', 'HW_Tee_012_F', 0],
  ['mphalloween_overlays', 'HW_Tee_001_M', 'HW_Tee_001_F', 0],
  ['mphalloween_overlays', 'HW_Tee_003_M', 'HW_Tee_003_F', 0],
  ['mphalloween_overlays', 'HW_Tee_005_M', 'HW_Tee_005_F', 0],
  ['mphalloween_overlays', 'HW_Tee_007_M', 'HW_Tee_007_F', 0],
  ['mphalloween_overlays', 'HW_Tee_009_M', 'HW_Tee_009_F', 0],
  ['mphalloween_overlays', 'HW_Tee_011_M', 'HW_Tee_011_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_000_M', 'MP_Vinewood_Tee_000_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_001_M', 'MP_Vinewood_Tee_001_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_002_M', 'MP_Vinewood_Tee_002_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_003_M', 'MP_Vinewood_Tee_003_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_004_M', 'MP_Vinewood_Tee_004_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_005_M', 'MP_Vinewood_Tee_005_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_006_M', 'MP_Vinewood_Tee_006_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_007_M', 'MP_Vinewood_Tee_007_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_008_M', 'MP_Vinewood_Tee_008_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_009_M', 'MP_Vinewood_Tee_009_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_010_M', 'MP_Vinewood_Tee_010_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_011_M', 'MP_Vinewood_Tee_011_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_012_M', 'MP_Vinewood_Tee_012_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_013_M', 'MP_Vinewood_Tee_013_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_014_M', 'MP_Vinewood_Tee_014_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_015_M', 'MP_Vinewood_Tee_015_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_016_M', 'MP_Vinewood_Tee_016_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_017_M', 'MP_Vinewood_Tee_017_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_018_M', 'MP_Vinewood_Tee_018_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_019_M', 'MP_Vinewood_Tee_019_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_020_M', 'MP_Vinewood_Tee_020_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_021_M', 'MP_Vinewood_Tee_021_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_022_M', 'MP_Vinewood_Tee_022_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_023_M', 'MP_Vinewood_Tee_023_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_024_M', 'MP_Vinewood_Tee_024_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_025_M', 'MP_Vinewood_Tee_025_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_026_M', 'MP_Vinewood_Tee_026_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_027_M', 'MP_Vinewood_Tee_027_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_028_M', 'MP_Vinewood_Tee_028_F', 0],
  ['mpvinewood_overlays', 'MP_Vinewood_Tee_029_M', 'MP_Vinewood_Tee_029_F', 0],

  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_000_M', 'MP_Gunrunning_Award_000_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_001_M', 'MP_Gunrunning_Award_001_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_002_M', 'MP_Gunrunning_Award_002_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_003_M', 'MP_Gunrunning_Award_003_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_004_M', 'MP_Gunrunning_Award_004_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_005_M', 'MP_Gunrunning_Award_005_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_006_M', 'MP_Gunrunning_Award_006_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_007_M', 'MP_Gunrunning_Award_007_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_008_M', 'MP_Gunrunning_Award_008_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_009_M', 'MP_Gunrunning_Award_009_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_010_M', 'MP_Gunrunning_Award_010_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_011_M', 'MP_Gunrunning_Award_011_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_012_M', 'MP_Gunrunning_Award_012_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_013_M', 'MP_Gunrunning_Award_013_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_014_M', 'MP_Gunrunning_Award_014_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_015_M', 'MP_Gunrunning_Award_015_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_016_M', 'MP_Gunrunning_Award_016_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_017_M', 'MP_Gunrunning_Award_017_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_018_M', 'MP_Gunrunning_Award_018_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_019_M', 'MP_Gunrunning_Award_019_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_020_M', 'MP_Gunrunning_Award_020_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_021_M', 'MP_Gunrunning_Award_021_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_022_M', 'MP_Gunrunning_Award_022_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_023_M', 'MP_Gunrunning_Award_023_F', 0],
  ['mpgunrunning_overlays', 'MP_Gunrunning_Award_024_M', 'MP_Gunrunning_Award_024_F', 0],

  ['mplowrider_overlays', 'MP_Broker_000_M', 'MP_Broker_000_F', 0],
  ['mplowrider_overlays', 'MP_Broker_001_M', 'MP_Broker_001_F', 0],
  ['mplowrider_overlays', 'MP_Broker_002_M', 'MP_Broker_002_F', 0],

  ['mplowrider2_overlays', 'MP_Chianski_000_M', 'MP_Chianski_000_F', 0],
  ['mplowrider2_overlays', 'MP_Chianski_001_M', 'MP_Chianski_001_F', 0],

  ['mpluxe_overlays', 'MP_LUXE_LC_004_M', 'MP_LUXE_LC_004_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_LC_011_M', 'MP_LUXE_LC_005_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_LC_005_M', 'MP_LUXE_LC_010_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_LC_010_M', 'MP_LUXE_LC_011_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_ENEMA_000_M', 'MP_LUXE_Enema_000_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_Per_001_M', 'MP_LUXE_Per_001_F', 0],
  ['mpluxe_overlays', 'MP_FAKE_SN_000_M', 'MP_FAKE_LB_000_F', 0],
  ['mpluxe_overlays', 'MP_FAKE_SC_000_M', 'MP_FAKE_LC_000_F', 0],
  ['mpluxe_overlays', 'MP_FAKE_DS_000_M', 'MP_FAKE_ENEMA_000_F', 0],
  ['mpluxe_overlays', 'MP_FAKE_Vap_000_M', 'MP_FAKE_Per_000_F', 0],
  ['mpluxe_overlays', 'MP_FAKE_DIS_000_M', 'MP_FAKE_SN_000_F', 0],
  ['mpluxe_overlays', 'MP_FAKE_DIS_001_M', 'MP_FAKE_SC_000_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_DIX_000_M', 'MP_FAKE_DS_000_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_DIX_001_M', 'MP_FAKE_Vap_000_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_DIX_002_M', 'MP_FAKE_DIS_000_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_SN_000_M', 'MP_FAKE_DIS_001_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_SN_001_M', 'MP_LUXE_DIX_000_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_SN_002_M', 'MP_LUXE_DIX_001_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_SN_003_M', 'MP_LUXE_DIX_002_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_SN_004_M', 'MP_LUXE_SN_000_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_SN_005_M', 'MP_LUXE_SN_001_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_SN_006_M', 'MP_LUXE_SN_002_F', 0],
  ['mpluxe_overlays', 'MP_LUXE_SN_007_M', 'MP_LUXE_SN_003_F', 0],
  ['mpluxe_overlays', 'MP_FILM_000_M', 'MP_LUXE_SN_004_F', 0],
  ['mpluxe_overlays', 'MP_FILM_001_M', 'MP_LUXE_SN_005_F', 0],
  ['mpluxe_overlays', 'MP_FILM_002_M', 'MP_LUXE_SN_006_F', 0],
  ['mpluxe_overlays', 'MP_FILM_003_M', 'MP_LUXE_SN_007_F', 0],
  ['mpluxe_overlays', 'MP_FILM_004_M', 'MP_LUXE_SC_000_F', 0],
  ['mpluxe_overlays', 'MP_FILM_005_M', 'MP_FILM_000_F', 0],
  ['mpluxe_overlays', 'MP_FILM_006_M', 'MP_FILM_001_F', 0],
  ['mpluxe_overlays', 'MP_FILM_007_M', 'MP_FILM_002_F', 0],
  ['mpluxe_overlays', 'MP_FILM_008_M', 'MP_FILM_003_F', 0],
  ['mpluxe_overlays', 'MP_FILM_009_M', 'MP_FILM_004_F', 0],

  ['mpluxe2_overlays', 'MP_LUXE_LC_000_M', 'MP_LUXE_LC_000_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_LC_001_M', 'MP_LUXE_LC_001_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_LC_002_M', 'MP_LUXE_LC_002_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_LC_003_M', 'MP_LUXE_LC_003_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_LC_006_M', 'MP_LUXE_LC_006_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_LC_007_M', 'MP_LUXE_LC_007_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_LC_008_M', 'MP_LUXE_LC_008_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_LC_009_M', 'MP_LUXE_LC_009_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_LC_012_M', 'MP_LUXE_LC_012_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_LC_013_M', 'MP_LUXE_LC_013_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_LC_014_M', 'MP_LUXE_LC_014_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_LC_015_M', 'MP_LUXE_LC_015_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_VDG_000_M', 'MP_LUXE_VDG_000_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_VDG_001_M', 'MP_LUXE_VDG_001_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_VDG_002_M', 'MP_LUXE_VDG_002_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_VDG_004_M', 'MP_LUXE_VDG_004_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_VDG_005_M', 'MP_LUXE_VDG_005_F', 0],
  ['mpluxe2_overlays', 'MP_LUXE_VDG_006_M', 'MP_LUXE_VDG_006_F', 0],

  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_000_M', 'MP_Smuggler_Graphic_000_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_001_M', 'MP_Smuggler_Graphic_001_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_002_M', 'MP_Smuggler_Graphic_002_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_003_M', 'MP_Smuggler_Graphic_003_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_004_M', 'MP_Smuggler_Graphic_004_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_005_M', 'MP_Smuggler_Graphic_005_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_006_M', 'MP_Smuggler_Graphic_006_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_007_M', 'MP_Smuggler_Graphic_007_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_008_M', 'MP_Smuggler_Graphic_008_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_009_M', 'MP_Smuggler_Graphic_009_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_010_M', 'MP_Smuggler_Graphic_010_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_011_M', 'MP_Smuggler_Graphic_011_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_012_M', 'MP_Smuggler_Graphic_012_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_013_M', 'MP_Smuggler_Graphic_013_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_014_M', 'MP_Smuggler_Graphic_014_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_015_M', 'MP_Smuggler_Graphic_015_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_016_M', 'MP_Smuggler_Graphic_016_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_017_M', 'MP_Smuggler_Graphic_017_F', 0],
  ['mpsmuggler_overlays', 'MP_Smuggler_Graphic_018_M', 'MP_Smuggler_Graphic_018_F', 0]
]

export const houseFridgeAmount = [100000, 500000, 1000000]
export const houseFridgeCost = 250000