// user\.get+\(([A-Za-z])\w+, (["'])age(["'])
// user\.get+\((["'A-Za-z])age(["'])
export const levelAccess = {
  /** Уровень для доступа к дальнобойщикам */
  truckerjob: 5,
  /** Доступ к покупке бизнеса */
  buyBusiness: 6,
  /** Максимальный уровень, при котором доступен начальный квест */
  startQuest: 6,
  /** Доступ к инкассаторам */
  gr6: 6,
  /** Доступ к ограблению военки на C4 */
  c4grab: 4,
  /** Доступ к ограблению военки на оружие */
  weapongrab: 3,
  /** Доступ к работе крупье */
  diceWork: 6,
  /** Доступ членству в неофке */
  inviteFraction2: 2,
  /** Бесплатное такси */
  freeTaxi: 1,
  /** Максимальный уровень, при котором можно ввести стартовый промокод */
  startPromocode: 4,
  /** Доступ к ограбе флеки */
  fleecaGrab: 4,
  /** Доступ к ограбе пацифика */
  pacificGrab: 4,
  /** Максмимальный уровень, который даёт получить x2 опыта при x2 опыта для новичков */
  x2lvlNewPlayers: 4,
  /** Скидка при лечении */
  healSkidka: 1,
  /** Доступ к получению лицензии таксиста */
  taxiLic: 2,
  /** Доступ к работе в компании (Slaughter, Slaughter & Slaughter, Bullhead, Pearson Specter) */
  companyWork: 4,
  /** Это можно не указывать */
  swater: 99999,
  /** Уровень, с которого можно получить пенсию */
  oldmoney: 25,
}