/** Минимальный процент от стоимости ТС за который можно продать */
export const VEH_SELL_MIN_PERCENT = 10;
export const vehicleSalePoints: [{ x: number, y: number, z: number }, { x: number, y: number, z: number }][] = [
    [{ x: -1581.81, y: -903.71, z: 8.20 }, { x: -1580.71, y: -901.07, z: 8.72 }],
    [{ x: -1584.18, y: -901.52, z: 8.20 }, { x: -1583.09, y: -898.93, z: 8.72 }],
    [{ x: -1586.38, y: -899.50, z: 8.20 }, { x: -1585.39, y: -896.71, z: 8.72 }],
    [{ x: -1588.70, y: -897.50, z: 8.19 }, { x: -1587.74, y: -894.91, z: 8.68 }],
    [{ x: -1590.97, y: -895.43, z: 8.15 }, { x: -1590.01, y: -892.91, z: 8.62 }],
    [{ x: -1594.57, y: -899.81, z: 7.99 }, { x: -1597.21, y: -901.15, z: 8.32 }],
    [{ x: -1592.20, y: -901.86, z: 8.01 }, { x: -1594.92, y: -903.30, z: 8.33 }],
    [{ x: -1589.93, y: -903.90, z: 8.01 }, { x: -1592.49, y: -905.09, z: 8.35 }],
    [{ x: -1587.63, y: -905.89, z: 8.01 }, { x: -1590.16, y: -907.31, z: 8.35 }],
    [{ x: -1585.27, y: -908.03, z: 8.01 }, { x: -1587.73, y: -909.24, z: 8.35 }],
    [{ x: -1602.62, y: -886.30, z: 8.17 }, { x: -1601.59, y: -883.76, z: 8.66 }],
    [{ x: -1604.89, y: -884.23, z: 8.13 }, { x: -1604.03, y: -881.79, z: 8.61 }],
    [{ x: -1607.32, y: -882.25, z: 8.12 }, { x: -1606.24, y: -879.84, z: 8.63 }],
    [{ x: -1609.59, y: -880.29, z: 8.16 }, { x: -1608.86, y: -877.84, z: 8.67 }],
    [{ x: -1611.97, y: -878.30, z: 8.17 }, { x: -1610.92, y: -875.97, z: 8.67 }],
    [{ x: -1614.37, y: -876.31, z: 8.17 }, { x: -1613.32, y: -873.85, z: 8.67 }],
    [{ x: -1616.70, y: -874.36, z: 8.17 }, { x: -1615.77, y: -872.11, z: 8.66 }],
    [{ x: -1619.01, y: -872.27, z: 8.17 }, { x: -1617.99, y: -869.89, z: 8.67 }],
    [{ x: -1621.36, y: -870.35, z: 8.17 }, { x: -1620.31, y: -867.80, z: 8.68 }],
    [{ x: -1623.72, y: -868.36, z: 8.17 }, { x: -1622.91, y: -866.04, z: 8.67 }],
    [{ x: -1626.07, y: -866.38, z: 8.17 }, { x: -1625.13, y: -864.17, z: 8.67 }],
    [{ x: -1628.39, y: -864.45, z: 8.18 }, { x: -1627.35, y: -861.81, z: 8.68 }],
    [{ x: -1630.82, y: -862.45, z: 8.18 }, { x: -1629.94, y: -859.94, z: 8.67 }],
    [{ x: -1634.44, y: -859.34, z: 8.17 }, { x: -1633.49, y: -856.88, z: 8.67 }],
    [{ x: -1636.76, y: -857.31, z: 8.17 }, { x: -1635.78, y: -854.74, z: 8.67 }],
    [{ x: -1639.10, y: -855.28, z: 8.16 }, { x: -1638.15, y: -852.93, z: 8.66 }],
    [{ x: -1641.52, y: -853.39, z: 8.14 }, { x: -1640.46, y: -850.75, z: 8.63 }],
    [{ x: -1643.89, y: -851.40, z: 8.11 }, { x: -1642.70, y: -848.81, z: 8.60 }],
    [{ x: -1646.20, y: -849.42, z: 8.09 }, { x: -1644.97, y: -846.77, z: 8.58 }],
    [{ x: -1648.53, y: -847.47, z: 8.06 }, { x: -1647.44, y: -844.71, z: 8.57 }],
    [{ x: -1650.89, y: -845.35, z: 8.07 }, { x: -1649.82, y: -842.90, z: 8.59 }],
    [{ x: -1653.17, y: -843.42, z: 8.12 }, { x: -1652.27, y: -840.91, z: 8.64 }],
    [{ x: -1655.52, y: -841.49, z: 8.15 }, { x: -1654.54, y: -838.98, z: 8.66 }],
    [{ x: -1657.89, y: -839.40, z: 8.15 }, { x: -1656.86, y: -836.97, z: 8.65 }],
    [{ x: -1660.24, y: -837.38, z: 8.15 }, { x: -1659.32, y: -834.98, z: 8.65 }],
    [{ x: -1662.53, y: -835.40, z: 8.15 }, { x: -1661.58, y: -832.95, z: 8.65 }],
    [{ x: -1666.12, y: -839.70, z: 8.00 }, { x: -1667.15, y: -841.98, z: 8.37 }],
    [{ x: -1663.84, y: -841.78, z: 8.00 }, { x: -1664.89, y: -844.22, z: 8.37 }],
    [{ x: -1661.41, y: -843.73, z: 8.00 }, { x: -1662.39, y: -846.00, z: 8.36 }],
    [{ x: -1658.97, y: -845.63, z: 7.99 }, { x: -1659.97, y: -848.00, z: 8.34 }],
    [{ x: -1656.67, y: -847.60, z: 7.95 }, { x: -1657.86, y: -850.16, z: 8.31 }],
    [{ x: -1654.33, y: -849.53, z: 7.91 }, { x: -1655.43, y: -852.07, z: 8.30 }],
    [{ x: -1651.97, y: -851.58, z: 7.93 }, { x: -1652.95, y: -853.98, z: 8.33 }],
    [{ x: -1649.64, y: -853.71, z: 7.97 }, { x: -1650.76, y: -856.03, z: 8.36 }],
    [{ x: -1647.30, y: -855.66, z: 8.00 }, { x: -1648.48, y: -858.06, z: 8.37 }],
    [{ x: -1644.98, y: -857.67, z: 8.01 }, { x: -1646.13, y: -860.03, z: 8.38 }],
    [{ x: -1642.55, y: -859.50, z: 8.02 }, { x: -1643.73, y: -861.94, z: 8.38 }],
    [{ x: -1640.16, y: -861.58, z: 8.02 }, { x: -1641.31, y: -864.01, z: 8.38 }],
    [{ x: -1637.75, y: -863.43, z: 8.03 }, { x: -1638.93, y: -865.86, z: 8.39 }],
    [{ x: -1634.19, y: -866.46, z: 8.02 }, { x: -1635.43, y: -869.07, z: 8.38 }],
    [{ x: -1631.81, y: -868.50, z: 8.02 }, { x: -1633.05, y: -871.10, z: 8.38 }],
    [{ x: -1629.51, y: -870.62, z: 8.02 }, { x: -1630.78, y: -873.15, z: 8.38 }],
    [{ x: -1627.27, y: -872.72, z: 8.02 }, { x: -1628.21, y: -875.14, z: 8.38 }],
    [{ x: -1624.91, y: -874.71, z: 8.01 }, { x: -1626.08, y: -877.08, z: 8.38 }],
    [{ x: -1622.64, y: -876.67, z: 8.02 }, { x: -1623.66, y: -879.13, z: 8.38 }],
    [{ x: -1620.26, y: -878.77, z: 8.01 }, { x: -1621.28, y: -881.01, z: 8.37 }],
    [{ x: -1617.89, y: -880.72, z: 8.01 }, { x: -1618.94, y: -883.04, z: 8.36 }],
    [{ x: -1615.54, y: -882.72, z: 8.00 }, { x: -1616.58, y: -885.00, z: 8.34 }],
    [{ x: -1613.16, y: -884.70, z: 7.98 }, { x: -1614.27, y: -887.16, z: 8.32 }],
    [{ x: -1610.79, y: -886.65, z: 7.96 }, { x: -1611.95, y: -889.08, z: 8.32 }],
    [{ x: -1608.53, y: -888.63, z: 7.97 }, { x: -1609.60, y: -891.08, z: 8.33 }],
    [{ x: -1606.02, y: -890.63, z: 8.00 }, { x: -1607.06, y: -893.04, z: 8.34 }],
];

const distanceToPos = (v1: { x: number, y: number, z: number }, v2: { x: number, y: number, z: number }) => {
    return Math.abs(Math.sqrt(Math.pow((v2.x - v1.x), 2) +
        Math.pow((v2.y - v1.y), 2) +
        Math.pow((v2.z - v1.z), 2)));
}
export const isPointInSalePosition = (pos: { x: number, y: number, z: number}) => {
    return !!vehicleSalePoints.find(q => distanceToPos(q[0], pos) < 2)
}

export const getVehicleParamName = (id: number) => {
    let name = id.toString();
    switch (id) {
        case 0:
            name = 'Спойлер';
            break;
        case 1:
            name = 'Передний бампер';
            break;
        case 2:
            name = 'Задний бампер';
            break;
        case 3:
            name = 'Юбки';
            break;
        case 4:
            name = 'Выхлоп';
            break;
        case 5:
            name = 'Рамка';
            break;
        case 6:
            name = 'Решетка';
            break;
        case 7:
            name = 'Капот';
            break;
        case 43:
            name = 'Капот-2';
            break;
        case 8:
            name = 'Крыло';
            break;
        case 10:
            name = 'Крыша';
            break;
        case 44:
            name = 'Крыша-2';
            break;
        case 14:
            name = 'Гудок';
            break;
        case 15:
            name = 'Подвеска';
            break;
        case 19:
            name = 'Решетка радиатора';
            break;
        case 23:
            name = 'Колёса';
            break;
        case 28:
            name = 'Украшения';
            break;
        case 30:
            name = 'Дизайн циферблата';
            break;
        case 32:
            name = 'Сиденья';
            break;
        case 38:
            name = 'Гидравлика';
            break;
        case 46:
            name = 'Стёкла';
            break;
        case 48:
            name = 'Винил';
            break;
        case 11:
            name = 'Двигатель';

            break;
        case 12:
            name = 'Тормоза';
            break;
        case 13:
            name = 'Трансмиссия';
            break;
        case 18:
            name = 'Турбо';
            break;
        case 69:
            name = 'Тонировка';
            break;
        case 100:
            name = 'Привод';
            break;
        case 101:
            name = 'Ускорение';
            break;
        case 102:
            name = 'Мощность двигателя';
            break;
        case 103:
            name = 'Сила торможения';
            break;
        case 104:
            name = 'Распределиние сил. торм.';
            break;
        case 105:
            name = 'Ручной тормоз';
            break;
        case 106:
            name = 'Угол поворота колёс';
            break;
        case 107:
            name = 'Сцепление колёс на повороте';
            break;
        case 108:
            name = 'Пробуксовка колёс';
            break;
    } 
    return name;
}

export const getVehicleVisualParams = (datas:string) => {
    let res: [string, string][] = [];
    const data:{[param:string]:number} = JSON.parse(datas)
    for(let param in data){
        const value = data[param];
        if(value){
            res.push([getVehicleParamName(parseInt(param)), value.toString()]);
        }
    }
    return res;
}