//2 3 1 3 3 3 1 4 2 2 1 2 2 2
export default [
  {
    text: 'Что означает мигание зеленого сигнала светофора?',
    img: false,
    ans: [
      'Предупреждает о неисправности светофора.',
      'Разрешает движение и информирует о том, что вскоре будет включен запрещающий сигнал.',
      'Запрещает дальнейшее движение.',
    ],
    correct: 2,
  },
  {
    text: 'Водитель обязан подавать сигналы световыми указателями поворота:',
    img: false,
    ans: [
      'Перед началом движения или перестроением.',
      'Перед остановкой.',
      'Во всех перечисленных случаях.',
    ],
    correct: 3,
  },
  {
    text:
      'В случае, когда правые колеса автомобиля наезжают на неукрепленную влажную обочину, рекомендуется:',
    img: false,
    ans: [
      'Затормозить и полностью остановиться.',
      'Затормозить и плавно направить автомобиль на проезжую часть.',
      'Не прибегая к торможению, плавно направить автомобиль на проезжую часть.',
    ],
    correct: 1,
  },
  {
    text: 'При повороте направо Вы:',
    img: 4,
    ans: [
      'Имеете право проехать перекресток первым.',
      'Должны уступить дорогу только пешеходу.',
      'Должны уступить дорогу автомобилю с включенными проблесковым маячком и специальным звуковым сигналом, а также пешеходу.',
    ],
    correct: 3,
  },
  {
    text:
      'В каких случаях разрешается наезжать на прерывистые линии разметки, разделяющие проезжую часть на полосы движения?',
    img: false,
    ans: [
      'Только если на дороге нет других транспортных средств.',
      'Только при движении в темное время суток.',
      'Только при перестроении.',
      'Во всех перечисленных случаях.',
    ],
    correct: 3,
  },
  {
    text:
      'В каком случае водитель может начать обгон, если такой маневр на данном участке дороги не запрещен?',
    img: false,
    ans: [
      'Только если полоса, предназначенная для встречного движения, свободна на достаточном для обгона расстоянии.',
      'Только если его транспортное средство никто не обгоняет.',
      'В случае, если выполнены оба условия.',
    ],
    correct: 3,
  },
  {
    text: 'При движении прямо Вы:',
    img: 7,
    ans: [
      'Должны остановиться перед стоп-линией, после чего продолжить движение.',
      'Можете продолжить движение через перекресток без остановки.',
      'Должны уступить дорогу всем транспортным средствам, движущимся с других направлений.',
    ],
    correct: 1,
  },
  {
    text:
      'Какие из перечисленных требований предъявляются к обучаемому на автомобиле, допущенному к учебной езде на дорогах?',
    img: false,
    ans: [
      'Возраст не менее 16 лет.',
      'Знание Правил дорожного движения.',
      'Наличие первоначальных навыков управления.',
      'Все перечисленные требования.',
    ],
    correct: 4,
  },
  {
    text:
      'Какие внешние световые приборы должны использоваться при движении в темное время суток на освещенных участках дорог населенного пункта?',
    img: false,
    ans: [
      'Только габаритные огни.',
      'Фары ближнего света.',
      'Габаритные огни или фары ближнего света',
    ],
    correct: 2,
  },
  {
    text: 'Сколько полос для движения имеет проезжая часть данной дороги?',
    img: 10,
    ans: ['Одну полосу.', 'Две полосы.', 'Три полосы.'],
    correct: 2,
  },
  {
    text:
      'По какой полосе проезжей части разрешено движение в населенном пункте, если по техническим причинам транспортное средство не может развивать скорость более 40 км/ч?',
    img: false,
    ans: ['Только по крайней правой.', 'Не далее второй полосы.', 'По любой, кроме крайней левой.'],
    correct: 1,
  },
  {
    text: 'В каких случаях разрешено применять звуковые сигналы в населенных пунктах?',
    img: false,
    ans: [
      'Только для предупреждения о намерении произвести обгон.',
      'Только для предотвращения дорожно-транспортного происшествия.',
      'В обоих перечисленных случаях.',
    ],
    correct: 2,
  },
  {
    text: 'Кто должен уступить дорогу?',
    img: 13,
    ans: ['Водитель грузового автомобиля.', 'Водитель легкового автомобиля.'],
    correct: 2,
  },
  {
    text: 'Как влияет утомленное состояние водителя на его внимание и реакцию?',
    img: false,
    ans: [
      'Внимание ослабляется, время реакции уменьшается.',
      'Внимание ослабляется, время реакции увеличивается.',
      'Внимание и время реакции не изменяются.',
    ],
    correct: 2,
  },
];
